{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Model", "config": {"output_layers": [["sigmoid", 0, 0]], "input_layers": [["data", 0, 0]], "layers": [{"inbound_nodes": [], "name": "data", "class_name": "InputLayer", "config": {"sparse": false, "name": "data", "batch_input_shape": [null, null, null, 3], "dtype": "float32"}}, {"inbound_nodes": [[["data", 0, 0, {}]]], "name": "bn_data", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "bn_data", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["bn_data", 0, 0, {}]]], "name": "zero_padding2d_123", "class_name": "ZeroPadding2D", "config": {"padding": [[3, 3], [3, 3]], "data_format": "channels_last", "name": "zero_padding2d_123", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_123", 0, 0, {}]]], "name": "conv0", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [2, 2], "kernel_regularizer": null, "name": "conv0", "bias_constraint": null, "filters": 64, "trainable": true, "activity_regularizer": null, "kernel_size": [7, 7], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["conv0", 0, 0, {}]]], "name": "bn0", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "bn0", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["bn0", 0, 0, {}]]], "name": "relu0", "class_name": "Activation", "config": {"name": "relu0", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["relu0", 0, 0, {}]]], "name": "zero_padding2d_124", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_124", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_124", 0, 0, {}]]], "name": "pooling0", "class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [3, 3], "strides": [2, 2], "data_format": "channels_last", "name": "pooling0", "trainable": true}}, {"inbound_nodes": [[["pooling0", 0, 0, {}]]], "name": "stage1_unit1_bn1", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage1_unit1_bn1", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]], "name": "stage1_unit1_relu1", "class_name": "Activation", "config": {"name": "stage1_unit1_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "name": "zero_padding2d_125", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_125", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_125", 0, 0, {}]]], "name": "stage1_unit1_conv1", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage1_unit1_conv1", "bias_constraint": null, "filters": 64, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]], "name": "stage1_unit1_bn2", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage1_unit1_bn2", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]], "name": "stage1_unit1_relu2", "class_name": "Activation", "config": {"name": "stage1_unit1_relu2", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]], "name": "zero_padding2d_126", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_126", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_126", 0, 0, {}]]], "name": "stage1_unit1_conv2", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage1_unit1_conv2", "bias_constraint": null, "filters": 64, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "name": "stage1_unit1_sc", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage1_unit1_sc", "bias_constraint": null, "filters": 64, "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]], "name": "add_54", "class_name": "Add", "config": {"name": "add_54", "trainable": true}}, {"inbound_nodes": [[["add_54", 0, 0, {}]]], "name": "stage1_unit2_bn1", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage1_unit2_bn1", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]], "name": "stage1_unit2_relu1", "class_name": "Activation", "config": {"name": "stage1_unit2_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]], "name": "zero_padding2d_127", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_127", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_127", 0, 0, {}]]], "name": "stage1_unit2_conv1", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage1_unit2_conv1", "bias_constraint": null, "filters": 64, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]], "name": "stage1_unit2_bn2", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage1_unit2_bn2", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]], "name": "stage1_unit2_relu2", "class_name": "Activation", "config": {"name": "stage1_unit2_relu2", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]], "name": "zero_padding2d_128", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_128", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_128", 0, 0, {}]]], "name": "stage1_unit2_conv2", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage1_unit2_conv2", "bias_constraint": null, "filters": 64, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_54", 0, 0, {}]]], "name": "add_55", "class_name": "Add", "config": {"name": "add_55", "trainable": true}}, {"inbound_nodes": [[["add_55", 0, 0, {}]]], "name": "stage2_unit1_bn1", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage2_unit1_bn1", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]], "name": "stage2_unit1_relu1", "class_name": "Activation", "config": {"name": "stage2_unit1_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "name": "zero_padding2d_129", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_129", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_129", 0, 0, {}]]], "name": "stage2_unit1_conv1", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [2, 2], "kernel_regularizer": null, "name": "stage2_unit1_conv1", "bias_constraint": null, "filters": 128, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]], "name": "stage2_unit1_bn2", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage2_unit1_bn2", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]], "name": "stage2_unit1_relu2", "class_name": "Activation", "config": {"name": "stage2_unit1_relu2", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]], "name": "zero_padding2d_130", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_130", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_130", 0, 0, {}]]], "name": "stage2_unit1_conv2", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage2_unit1_conv2", "bias_constraint": null, "filters": 128, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "name": "stage2_unit1_sc", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [2, 2], "kernel_regularizer": null, "name": "stage2_unit1_sc", "bias_constraint": null, "filters": 128, "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]], "name": "add_56", "class_name": "Add", "config": {"name": "add_56", "trainable": true}}, {"inbound_nodes": [[["add_56", 0, 0, {}]]], "name": "stage2_unit2_bn1", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage2_unit2_bn1", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]], "name": "stage2_unit2_relu1", "class_name": "Activation", "config": {"name": "stage2_unit2_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]], "name": "zero_padding2d_131", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_131", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_131", 0, 0, {}]]], "name": "stage2_unit2_conv1", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage2_unit2_conv1", "bias_constraint": null, "filters": 128, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]], "name": "stage2_unit2_bn2", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage2_unit2_bn2", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]], "name": "stage2_unit2_relu2", "class_name": "Activation", "config": {"name": "stage2_unit2_relu2", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]], "name": "zero_padding2d_132", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_132", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_132", 0, 0, {}]]], "name": "stage2_unit2_conv2", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage2_unit2_conv2", "bias_constraint": null, "filters": 128, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_56", 0, 0, {}]]], "name": "add_57", "class_name": "Add", "config": {"name": "add_57", "trainable": true}}, {"inbound_nodes": [[["add_57", 0, 0, {}]]], "name": "stage3_unit1_bn1", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage3_unit1_bn1", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]], "name": "stage3_unit1_relu1", "class_name": "Activation", "config": {"name": "stage3_unit1_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "name": "zero_padding2d_133", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_133", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_133", 0, 0, {}]]], "name": "stage3_unit1_conv1", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [2, 2], "kernel_regularizer": null, "name": "stage3_unit1_conv1", "bias_constraint": null, "filters": 256, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]], "name": "stage3_unit1_bn2", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage3_unit1_bn2", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]], "name": "stage3_unit1_relu2", "class_name": "Activation", "config": {"name": "stage3_unit1_relu2", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]], "name": "zero_padding2d_134", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_134", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_134", 0, 0, {}]]], "name": "stage3_unit1_conv2", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage3_unit1_conv2", "bias_constraint": null, "filters": 256, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "name": "stage3_unit1_sc", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [2, 2], "kernel_regularizer": null, "name": "stage3_unit1_sc", "bias_constraint": null, "filters": 256, "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]], "name": "add_58", "class_name": "Add", "config": {"name": "add_58", "trainable": true}}, {"inbound_nodes": [[["add_58", 0, 0, {}]]], "name": "stage3_unit2_bn1", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage3_unit2_bn1", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]], "name": "stage3_unit2_relu1", "class_name": "Activation", "config": {"name": "stage3_unit2_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]], "name": "zero_padding2d_135", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_135", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_135", 0, 0, {}]]], "name": "stage3_unit2_conv1", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage3_unit2_conv1", "bias_constraint": null, "filters": 256, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]], "name": "stage3_unit2_bn2", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage3_unit2_bn2", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]], "name": "stage3_unit2_relu2", "class_name": "Activation", "config": {"name": "stage3_unit2_relu2", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]], "name": "zero_padding2d_136", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_136", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_136", 0, 0, {}]]], "name": "stage3_unit2_conv2", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage3_unit2_conv2", "bias_constraint": null, "filters": 256, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_58", 0, 0, {}]]], "name": "add_59", "class_name": "Add", "config": {"name": "add_59", "trainable": true}}, {"inbound_nodes": [[["add_59", 0, 0, {}]]], "name": "stage4_unit1_bn1", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage4_unit1_bn1", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage4_unit1_bn1", 0, 0, {}]]], "name": "stage4_unit1_relu1", "class_name": "Activation", "config": {"name": "stage4_unit1_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "name": "zero_padding2d_137", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_137", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_137", 0, 0, {}]]], "name": "stage4_unit1_conv1", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [2, 2], "kernel_regularizer": null, "name": "stage4_unit1_conv1", "bias_constraint": null, "filters": 512, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage4_unit1_conv1", 0, 0, {}]]], "name": "stage4_unit1_bn2", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage4_unit1_bn2", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage4_unit1_bn2", 0, 0, {}]]], "name": "stage4_unit1_relu2", "class_name": "Activation", "config": {"name": "stage4_unit1_relu2", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage4_unit1_relu2", 0, 0, {}]]], "name": "zero_padding2d_138", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_138", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_138", 0, 0, {}]]], "name": "stage4_unit1_conv2", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage4_unit1_conv2", "bias_constraint": null, "filters": 512, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "name": "stage4_unit1_sc", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [2, 2], "kernel_regularizer": null, "name": "stage4_unit1_sc", "bias_constraint": null, "filters": 512, "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage4_unit1_conv2", 0, 0, {}], ["stage4_unit1_sc", 0, 0, {}]]], "name": "add_60", "class_name": "Add", "config": {"name": "add_60", "trainable": true}}, {"inbound_nodes": [[["add_60", 0, 0, {}]]], "name": "stage4_unit2_bn1", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage4_unit2_bn1", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage4_unit2_bn1", 0, 0, {}]]], "name": "stage4_unit2_relu1", "class_name": "Activation", "config": {"name": "stage4_unit2_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage4_unit2_relu1", 0, 0, {}]]], "name": "zero_padding2d_139", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_139", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_139", 0, 0, {}]]], "name": "stage4_unit2_conv1", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage4_unit2_conv1", "bias_constraint": null, "filters": 512, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage4_unit2_conv1", 0, 0, {}]]], "name": "stage4_unit2_bn2", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage4_unit2_bn2", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage4_unit2_bn2", 0, 0, {}]]], "name": "stage4_unit2_relu2", "class_name": "Activation", "config": {"name": "stage4_unit2_relu2", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage4_unit2_relu2", 0, 0, {}]]], "name": "zero_padding2d_140", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_140", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_140", 0, 0, {}]]], "name": "stage4_unit2_conv2", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage4_unit2_conv2", "bias_constraint": null, "filters": 512, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage4_unit2_conv2", 0, 0, {}], ["add_60", 0, 0, {}]]], "name": "add_61", "class_name": "Add", "config": {"name": "add_61", "trainable": true}}, {"inbound_nodes": [[["add_61", 0, 0, {}]]], "name": "bn1", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "bn1", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["bn1", 0, 0, {}]]], "name": "relu1", "class_name": "Activation", "config": {"name": "relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["relu1", 0, 0, {}]]], "name": "decoder_stage0_upsample", "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "name": "decoder_stage0_upsample", "size": [2, 2], "trainable": true, "interpolation": "nearest"}}, {"inbound_nodes": [[["decoder_stage0_upsample", 0, 0, {}], ["stage4_unit1_relu1", 0, 0, {}]]], "name": "concatenate_9", "class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_9", "trainable": true}}, {"inbound_nodes": [[["concatenate_9", 0, 0, {}]]], "name": "decoder_stage0_conv1", "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "decoder_stage0_conv1", "bias_constraint": null, "filters": 256, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["decoder_stage0_conv1", 0, 0, {}]]], "name": "decoder_stage0_bn1", "class_name": "BatchNormalization", "config": {"axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "decoder_stage0_bn1", "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["decoder_stage0_bn1", 0, 0, {}]]], "name": "decoder_stage0_relu1", "class_name": "Activation", "config": {"name": "decoder_stage0_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["decoder_stage0_relu1", 0, 0, {}]]], "name": "decoder_stage0_conv2", "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "decoder_stage0_conv2", "bias_constraint": null, "filters": 256, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["decoder_stage0_conv2", 0, 0, {}]]], "name": "decoder_stage0_bn2", "class_name": "BatchNormalization", "config": {"axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "decoder_stage0_bn2", "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["decoder_stage0_bn2", 0, 0, {}]]], "name": "decoder_stage0_relu2", "class_name": "Activation", "config": {"name": "decoder_stage0_relu2", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["decoder_stage0_relu2", 0, 0, {}]]], "name": "decoder_stage1_upsample", "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "name": "decoder_stage1_upsample", "size": [2, 2], "trainable": true, "interpolation": "nearest"}}, {"inbound_nodes": [[["decoder_stage1_upsample", 0, 0, {}], ["stage3_unit1_relu1", 0, 0, {}]]], "name": "concatenate_10", "class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_10", "trainable": true}}, {"inbound_nodes": [[["concatenate_10", 0, 0, {}]]], "name": "decoder_stage1_conv1", "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "decoder_stage1_conv1", "bias_constraint": null, "filters": 128, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["decoder_stage1_conv1", 0, 0, {}]]], "name": "decoder_stage1_bn1", "class_name": "BatchNormalization", "config": {"axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "decoder_stage1_bn1", "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["decoder_stage1_bn1", 0, 0, {}]]], "name": "decoder_stage1_relu1", "class_name": "Activation", "config": {"name": "decoder_stage1_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["decoder_stage1_relu1", 0, 0, {}]]], "name": "decoder_stage1_conv2", "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "decoder_stage1_conv2", "bias_constraint": null, "filters": 128, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["decoder_stage1_conv2", 0, 0, {}]]], "name": "decoder_stage1_bn2", "class_name": "BatchNormalization", "config": {"axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "decoder_stage1_bn2", "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["decoder_stage1_bn2", 0, 0, {}]]], "name": "decoder_stage1_relu2", "class_name": "Activation", "config": {"name": "decoder_stage1_relu2", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["decoder_stage1_relu2", 0, 0, {}]]], "name": "decoder_stage2_upsample", "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "name": "decoder_stage2_upsample", "size": [2, 2], "trainable": true, "interpolation": "nearest"}}, {"inbound_nodes": [[["decoder_stage2_upsample", 0, 0, {}], ["stage2_unit1_relu1", 0, 0, {}]]], "name": "concatenate_11", "class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_11", "trainable": true}}, {"inbound_nodes": [[["concatenate_11", 0, 0, {}]]], "name": "decoder_stage2_conv1", "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "decoder_stage2_conv1", "bias_constraint": null, "filters": 64, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["decoder_stage2_conv1", 0, 0, {}]]], "name": "decoder_stage2_bn1", "class_name": "BatchNormalization", "config": {"axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "decoder_stage2_bn1", "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["decoder_stage2_bn1", 0, 0, {}]]], "name": "decoder_stage2_relu1", "class_name": "Activation", "config": {"name": "decoder_stage2_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["decoder_stage2_relu1", 0, 0, {}]]], "name": "decoder_stage2_conv2", "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "decoder_stage2_conv2", "bias_constraint": null, "filters": 64, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["decoder_stage2_conv2", 0, 0, {}]]], "name": "decoder_stage2_bn2", "class_name": "BatchNormalization", "config": {"axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "decoder_stage2_bn2", "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["decoder_stage2_bn2", 0, 0, {}]]], "name": "decoder_stage2_relu2", "class_name": "Activation", "config": {"name": "decoder_stage2_relu2", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["decoder_stage2_relu2", 0, 0, {}]]], "name": "decoder_stage3_upsample", "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "name": "decoder_stage3_upsample", "size": [2, 2], "trainable": true, "interpolation": "nearest"}}, {"inbound_nodes": [[["decoder_stage3_upsample", 0, 0, {}], ["relu0", 0, 0, {}]]], "name": "concatenate_12", "class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_12", "trainable": true}}, {"inbound_nodes": [[["concatenate_12", 0, 0, {}]]], "name": "decoder_stage3_conv1", "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "decoder_stage3_conv1", "bias_constraint": null, "filters": 32, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["decoder_stage3_conv1", 0, 0, {}]]], "name": "decoder_stage3_bn1", "class_name": "BatchNormalization", "config": {"axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "decoder_stage3_bn1", "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["decoder_stage3_bn1", 0, 0, {}]]], "name": "decoder_stage3_relu1", "class_name": "Activation", "config": {"name": "decoder_stage3_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["decoder_stage3_relu1", 0, 0, {}]]], "name": "decoder_stage3_conv2", "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "decoder_stage3_conv2", "bias_constraint": null, "filters": 32, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["decoder_stage3_conv2", 0, 0, {}]]], "name": "decoder_stage3_bn2", "class_name": "BatchNormalization", "config": {"axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "decoder_stage3_bn2", "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["decoder_stage3_bn2", 0, 0, {}]]], "name": "decoder_stage3_relu2", "class_name": "Activation", "config": {"name": "decoder_stage3_relu2", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["decoder_stage3_relu2", 0, 0, {}]]], "name": "decoder_stage4_upsample", "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "name": "decoder_stage4_upsample", "size": [2, 2], "trainable": true, "interpolation": "nearest"}}, {"inbound_nodes": [[["decoder_stage4_upsample", 0, 0, {}]]], "name": "decoder_stage4_conv1", "class_name": "Conv2D", "config": {"padding": "same",