{"keras_version": "2.2.4", "class_name": "Model", "backend": "tensorflow", "config": {"name": "u-resnet18", "output_layers": [["sigmoid", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "sparse": false, "dtype": "float32", "name": "data"}, "inbound_nodes": [], "name": "data"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "bn_data", "scale": false, "momentum": 0.99}, "inbound_nodes": [[["data", 0, 0, {}]]], "name": "bn_data"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[3, 3], [3, 3]], "trainable": true, "name": "zero_padding2d_1"}, "inbound_nodes": [[["bn_data", 0, 0, {}]]], "name": "zero_padding2d_1"}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [7, 7], "trainable": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "conv0", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "name": "conv0"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "bn0", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["conv0", 0, 0, {}]]], "name": "bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu0"}, "inbound_nodes": [[["bn0", 0, 0, {}]]], "name": "relu0"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_2"}, "inbound_nodes": [[["relu0", 0, 0, {}]]], "name": "zero_padding2d_2"}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "name": "pooling0"}, "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]], "name": "pooling0"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage1_unit1_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["pooling0", 0, 0, {}]]], "name": "stage1_unit1_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit1_relu1"}, "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]], "name": "stage1_unit1_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_3"}, "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "name": "zero_padding2d_3"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage1_unit1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "name": "stage1_unit1_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage1_unit1_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]], "name": "stage1_unit1_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit1_relu2"}, "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]], "name": "stage1_unit1_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_4"}, "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]], "name": "zero_padding2d_4"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage1_unit1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]], "name": "stage1_unit1_conv2"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [1, 1], "trainable": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage1_unit1_sc", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "name": "stage1_unit1_sc"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]], "name": "add_1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage1_unit2_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "stage1_unit2_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit2_relu1"}, "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]], "name": "stage1_unit2_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_5"}, "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]], "name": "zero_padding2d_5"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage1_unit2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]], "name": "stage1_unit2_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage1_unit2_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]], "name": "stage1_unit2_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit2_relu2"}, "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]], "name": "stage1_unit2_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_6"}, "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]], "name": "zero_padding2d_6"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage1_unit2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]], "name": "stage1_unit2_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_1", 0, 0, {}]]], "name": "add_2"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage2_unit1_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "stage2_unit1_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit1_relu1"}, "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]], "name": "stage2_unit1_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_7"}, "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "name": "zero_padding2d_7"}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage2_unit1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]], "name": "stage2_unit1_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage2_unit1_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]], "name": "stage2_unit1_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit1_relu2"}, "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]], "name": "stage2_unit1_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_8"}, "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]], "name": "zero_padding2d_8"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage2_unit1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]], "name": "stage2_unit1_conv2"}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [1, 1], "trainable": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage2_unit1_sc", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "name": "stage2_unit1_sc"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]], "name": "add_3"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage2_unit2_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "stage2_unit2_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit2_relu1"}, "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]], "name": "stage2_unit2_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_9"}, "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]], "name": "zero_padding2d_9"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage2_unit2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]], "name": "stage2_unit2_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage2_unit2_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]], "name": "stage2_unit2_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit2_relu2"}, "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]], "name": "stage2_unit2_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_10"}, "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]], "name": "zero_padding2d_10"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage2_unit2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]], "name": "stage2_unit2_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_3", 0, 0, {}]]], "name": "add_4"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage3_unit1_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "stage3_unit1_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit1_relu1"}, "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]], "name": "stage3_unit1_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_11"}, "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "name": "zero_padding2d_11"}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage3_unit1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]], "name": "stage3_unit1_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage3_unit1_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]], "name": "stage3_unit1_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit1_relu2"}, "inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]], "name": "stage3_unit1_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_12"}, "inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]], "name": "zero_padding2d_12"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage3_unit1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_12", 0, 0, {}]]], "name": "stage3_unit1_conv2"}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [1, 1], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage3_unit1_sc", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "name": "stage3_unit1_sc"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]], "name": "add_5"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage3_unit2_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "stage3_unit2_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit2_relu1"}, "inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]], "name": "stage3_unit2_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_13"}, "inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]], "name": "zero_padding2d_13"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage3_unit2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_13", 0, 0, {}]]], "name": "stage3_unit2_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage3_unit2_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]], "name": "stage3_unit2_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit2_relu2"}, "inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]], "name": "stage3_unit2_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_14"}, "inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]], "name": "zero_padding2d_14"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage3_unit2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]], "name": "stage3_unit2_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_5", 0, 0, {}]]], "name": "add_6"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage4_unit1_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "stage4_unit1_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage4_unit1_relu1"}, "inbound_nodes": [[["stage4_unit1_bn1", 0, 0, {}]]], "name": "stage4_unit1_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_15"}, "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "name": "zero_padding2d_15"}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 512, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage4_unit1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]], "name": "stage4_unit1_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage4_unit1_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage4_unit1_conv1", 0, 0, {}]]], "name": "stage4_unit1_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage4_unit1_relu2"}, "inbound_nodes": [[["stage4_unit1_bn2", 0, 0, {}]]], "name": "stage4_unit1_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_16"}, "inbound_nodes": [[["stage4_unit1_relu2", 0, 0, {}]]], "name": "zero_padding2d_16"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 512, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage4_unit1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]], "name": "stage4_unit1_conv2"}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [1, 1], "trainable": true, "filters": 512, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage4_unit1_sc", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "name": "stage4_unit1_sc"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_7"}, "inbound_nodes": [[["stage4_unit1_conv2", 0, 0, {}], ["stage4_unit1_sc", 0, 0, {}]]], "name": "add_7"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage4_unit2_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "stage4_unit2_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage4_unit2_relu1"}, "inbound_nodes": [[["stage4_unit2_bn1", 0, 0, {}]]], "name": "stage4_unit2_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_17"}, "inbound_nodes": [[["stage4_unit2_relu1", 0, 0, {}]]], "name": "zero_padding2d_17"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 512, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage4_unit2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]], "name": "stage4_unit2_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage4_unit2_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage4_unit2_conv1", 0, 0, {}]]], "name": "stage4_unit2_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage4_unit2_relu2"}, "inbound_nodes": [[["stage4_unit2_bn2", 0, 0, {}]]], "name": "stage4_unit2_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_18"}, "inbound_nodes": [[["stage4_unit2_relu2", 0, 0, {}]]], "name": "zero_padding2d_18"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 512, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage4_unit2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_18", 0, 0, {}]]], "name": "stage4_unit2_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_8"}, "inbound_nodes": [[["stage4_unit2_conv2", 0, 0, {}], ["add_7", 0, 0, {}]]], "name": "add_8"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu1"}, "inbound_nodes": [[["bn1", 0, 0, {}]]], "name": "relu1"}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "interpolation": "nearest", "trainable": true, "data_format": "channels_last", "name": "decoder_stage0_upsample"}, "inbound_nodes": [[["relu1", 0, 0, {}]]], "name": "decoder_stage0_upsample"}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "concatenate_1"}, "inbound_nodes": [[["decoder_stage0_upsample", 0, 0, {}], ["stage4_unit1_relu1", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "decoder_stage0_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "decoder_stage0_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "name": "decoder_stage0_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["decoder_stage0_conv1", 0, 0, {}]]], "name": "decoder_stage0_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "decoder_stage0_relu1"}, "inbound_nodes": [[["decoder_stage0_bn1", 0, 0, {}]]], "name": "decoder_stage0_relu1"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "decoder_stage0_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["decoder_stage0_relu1", 0, 0, {}]]], "name": "decoder_stage0_conv2"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "name": "decoder_stage0_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["decoder_stage0_conv2", 0, 0, {}]]], "name": "decoder_stage0_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "decoder_stage0_relu2"}, "inbound_nodes": [[["decoder_stage0_bn2", 0, 0, {}]]], "name": "decoder_stage0_relu2"}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "interpolation": "nearest", "trainable": true, "data_format": "channels_last", "name": "decoder_stage1_upsample"}, "inbound_nodes": [[["decoder_stage0_relu2", 0, 0, {}]]], "name": "decoder_stage1_upsample"}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "concatenate_2"}, "inbound_nodes": [[["decoder_stage1_upsample", 0, 0, {}], ["stage3_unit1_relu1", 0, 0, {}]]], "name": "concatenate_2"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "trainable": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "decoder_stage1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "decoder_stage1_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "name": "decoder_stage1_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["decoder_stage1_conv1", 0, 0, {}]]], "name": "decoder_stage1_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "decoder_stage1_relu1"}, "inbound_nodes": [[["decoder_stage1_bn1", 0, 0, {}]]], "name": "decoder_stage1_relu1"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "trainable": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "decoder_stage1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["decoder_stage1_relu1", 0, 0, {}]]], "name": "decoder_stage1_conv2"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "name": "decoder_stage1_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["decoder_stage1_conv2", 0, 0, {}]]], "name": "decoder_stage1_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "decoder_stage1_relu2"}, "inbound_nodes": [[["decoder_stage1_bn2", 0, 0, {}]]], "name": "decoder_stage1_relu2"}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "interpolation": "nearest", "trainable": true, "data_format": "channels_last", "name": "decoder_stage2_upsample"}, "inbound_nodes": [[["decoder_stage1_relu2", 0, 0, {}]]], "name": "decoder_stage2_upsample"}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "concatenate_3"}, "inbound_nodes": [[["decoder_stage2_upsample", 0, 0, {}], ["stage2_unit1_relu1", 0, 0, {}]]], "name": "concatenate_3"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "trainable": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "decoder_stage2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "decoder_stage2_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "name": "decoder_stage2_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["decoder_stage2_conv1", 0, 0, {}]]], "name": "decoder_stage2_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "decoder_stage2_relu1"}, "inbound_nodes": [[["decoder_stage2_bn1", 0, 0, {}]]], "name": "decoder_stage2_relu1"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "trainable": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "decoder_stage2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["decoder_stage2_relu1", 0, 0, {}]]], "name": "decoder_stage2_conv2"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "name": "decoder_stage2_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["decoder_stage2_conv2", 0, 0, {}]]], "name": "decoder_stage2_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "decoder_stage2_relu2"}, "inbound_nodes": [[["decoder_stage2_bn2", 0, 0, {}]]], "name": "decoder_stage2_relu2"}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "interpolation": "nearest", "trainable": true, "data_format": "channels_last", "name": "decoder_stage3_upsample"}, "inbound_nodes": [[["decoder_stage2_relu2", 0, 0, {}]]], "name": "decoder_stage3_upsample"}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "concatenate_4"}, "inbound_nodes": [[["decoder_stage3_upsample", 0, 0, {}], ["relu0", 0, 0, {}]]], "name": "concatenate_4"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "trainable": true, "filters": 32, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "decoder_stage3_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "name": "decoder_stage3_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "name": "decoder_stage3_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["decoder_stage3_conv1", 0, 0, {}]]], "name": "decoder_stage3_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "decoder_stage3_relu1"}, "inbound_nodes": [[["decoder_stage3_bn1", 0, 0, {}]]], "name": "decoder_stage3_relu1"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "trainable": true, "filters": 32, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "decoder_stage3_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["decoder_stage3_relu1", 0, 0, {}]]], "name": "decoder_stage3_conv2"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "name": "decoder_stage3_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["decoder_stage3_conv2", 0, 0, {}]]], "name": "decoder_stage3_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "decoder_stage3_relu2"}, "inbound_nodes": [[["decoder_stage3_bn2", 0, 0, {}]]], "name": "decoder_stage3_relu2"}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "interpolation": "nearest", "trainable": true, "data_format": "channels_last", "name": "decoder_stage4_upsample"}, "inbound_nodes": [[["decoder_stage3_relu2", 0, 0, {}]]], "name": "decoder_stage4_upsample"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, 