{"backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "sparse": false, "dtype": "float32", "name": "data"}, "name": "data"}, {"inbound_nodes": [[["data", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "bn_data", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true}, "name": "bn_data"}, {"inbound_nodes": [[["bn_data", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_last", "name": "zero_padding2d_1"}, "name": "zero_padding2d_1"}, {"inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "kernel_size": [7, 7], "name": "conv0", "strides": [2, 2], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "conv0"}, {"inbound_nodes": [[["conv0", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "bn0", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "bn0"}, {"inbound_nodes": [[["bn0", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "relu0"}, "name": "relu0"}, {"inbound_nodes": [[["relu0", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_2"}, "name": "zero_padding2d_2"}, {"inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "name": "pooling0", "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2]}, "name": "pooling0"}, {"inbound_nodes": [[["pooling0", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "stage1_unit1_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "stage1_unit1_bn1"}, {"inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "stage1_unit1_relu1"}, "name": "stage1_unit1_relu1"}, {"inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_3"}, "name": "zero_padding2d_3"}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "kernel_size": [3, 3], "name": "stage1_unit1_conv1", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage1_unit1_conv1"}, {"inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "stage1_unit1_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "stage1_unit1_bn2"}, {"inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "stage1_unit1_relu2"}, "name": "stage1_unit1_relu2"}, {"inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_4"}, "name": "zero_padding2d_4"}, {"inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "kernel_size": [3, 3], "name": "stage1_unit1_conv2", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage1_unit1_conv2"}, {"inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "kernel_size": [1, 1], "name": "stage1_unit1_sc", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage1_unit1_sc"}, {"inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "name": "add_1"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "stage1_unit2_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "stage1_unit2_bn1"}, {"inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "stage1_unit2_relu1"}, "name": "stage1_unit2_relu1"}, {"inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_5"}, "name": "zero_padding2d_5"}, {"inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "kernel_size": [3, 3], "name": "stage1_unit2_conv1", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage1_unit2_conv1"}, {"inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "stage1_unit2_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "stage1_unit2_bn2"}, {"inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "stage1_unit2_relu2"}, "name": "stage1_unit2_relu2"}, {"inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_6"}, "name": "zero_padding2d_6"}, {"inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "kernel_size": [3, 3], "name": "stage1_unit2_conv2", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage1_unit2_conv2"}, {"inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_1", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "name": "add_2"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "stage2_unit1_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "stage2_unit1_bn1"}, {"inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "stage2_unit1_relu1"}, "name": "stage2_unit1_relu1"}, {"inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_7"}, "name": "zero_padding2d_7"}, {"inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 128, "kernel_size": [3, 3], "name": "stage2_unit1_conv1", "strides": [2, 2], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage2_unit1_conv1"}, {"inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "stage2_unit1_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "stage2_unit1_bn2"}, {"inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "stage2_unit1_relu2"}, "name": "stage2_unit1_relu2"}, {"inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_8"}, "name": "zero_padding2d_8"}, {"inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 128, "kernel_size": [3, 3], "name": "stage2_unit1_conv2", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage2_unit1_conv2"}, {"inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 128, "kernel_size": [1, 1], "name": "stage2_unit1_sc", "strides": [2, 2], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage2_unit1_sc"}, {"inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "name": "add_3"}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "stage2_unit2_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "stage2_unit2_bn1"}, {"inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "stage2_unit2_relu1"}, "name": "stage2_unit2_relu1"}, {"inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_9"}, "name": "zero_padding2d_9"}, {"inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 128, "kernel_size": [3, 3], "name": "stage2_unit2_conv1", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage2_unit2_conv1"}, {"inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "stage2_unit2_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "stage2_unit2_bn2"}, {"inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "stage2_unit2_relu2"}, "name": "stage2_unit2_relu2"}, {"inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_10"}, "name": "zero_padding2d_10"}, {"inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 128, "kernel_size": [3, 3], "name": "stage2_unit2_conv2", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage2_unit2_conv2"}, {"inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_3", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "name": "add_4"}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "stage3_unit1_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "stage3_unit1_bn1"}, {"inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "stage3_unit1_relu1"}, "name": "stage3_unit1_relu1"}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_11"}, "name": "zero_padding2d_11"}, {"inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "kernel_size": [3, 3], "name": "stage3_unit1_conv1", "strides": [2, 2], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage3_unit1_conv1"}, {"inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "stage3_unit1_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "stage3_unit1_bn2"}, {"inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "stage3_unit1_relu2"}, "name": "stage3_unit1_relu2"}, {"inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_12"}, "name": "zero_padding2d_12"}, {"inbound_nodes": [[["zero_padding2d_12", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "kernel_size": [3, 3], "name": "stage3_unit1_conv2", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage3_unit1_conv2"}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "kernel_size": [1, 1], "name": "stage3_unit1_sc", "strides": [2, 2], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage3_unit1_sc"}, {"inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "name": "add_5"}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "stage3_unit2_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "stage3_unit2_bn1"}, {"inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "stage3_unit2_relu1"}, "name": "stage3_unit2_relu1"}, {"inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_13"}, "name": "zero_padding2d_13"}, {"inbound_nodes": [[["zero_padding2d_13", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "kernel_size": [3, 3], "name": "stage3_unit2_conv1", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage3_unit2_conv1"}, {"inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "stage3_unit2_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "stage3_unit2_bn2"}, {"inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "stage3_unit2_relu2"}, "name": "stage3_unit2_relu2"}, {"inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_14"}, "name": "zero_padding2d_14"}, {"inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "kernel_size": [3, 3], "name": "stage3_unit2_conv2", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage3_unit2_conv2"}, {"inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_5", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "name": "add_6"}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "stage4_unit1_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "stage4_unit1_bn1"}, {"inbound_nodes": [[["stage4_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "stage4_unit1_relu1"}, "name": "stage4_unit1_relu1"}, {"inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_15"}, "name": "zero_padding2d_15"}, {"inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 512, "kernel_size": [3, 3], "name": "stage4_unit1_conv1", "strides": [2, 2], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage4_unit1_conv1"}, {"inbound_nodes": [[["stage4_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "stage4_unit1_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "stage4_unit1_bn2"}, {"inbound_nodes": [[["stage4_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "stage4_unit1_relu2"}, "name": "stage4_unit1_relu2"}, {"inbound_nodes": [[["stage4_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_16"}, "name": "zero_padding2d_16"}, {"inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 512, "kernel_size": [3, 3], "name": "stage4_unit1_conv2", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage4_unit1_conv2"}, {"inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 512, "kernel_size": [1, 1], "name": "stage4_unit1_sc", "strides": [2, 2], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage4_unit1_sc"}, {"inbound_nodes": [[["stage4_unit1_conv2", 0, 0, {}], ["stage4_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_7"}, "name": "add_7"}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "stage4_unit2_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "stage4_unit2_bn1"}, {"inbound_nodes": [[["stage4_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "stage4_unit2_relu1"}, "name": "stage4_unit2_relu1"}, {"inbound_nodes": [[["stage4_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_17"}, "name": "zero_padding2d_17"}, {"inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 512, "kernel_size": [3, 3], "name": "stage4_unit2_conv1", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage4_unit2_conv1"}, {"inbound_nodes": [[["stage4_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "stage4_unit2_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "stage4_unit2_bn2"}, {"inbound_nodes": [[["stage4_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "stage4_unit2_relu2"}, "name": "stage4_unit2_relu2"}, {"inbound_nodes": [[["stage4_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_18"}, "name": "zero_padding2d_18"}, {"inbound_nodes": [[["zero_padding2d_18", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 512, "kernel_size": [3, 3], "name": "stage4_unit2_conv2", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}}, "activation": "linear", "trainable": true}, "name": "stage4_unit2_conv2"}, {"inbound_nodes": [[["stage4_unit2_conv2", 0, 0, {}], ["add_7", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_8"}, "name": "add_8"}, {"inbound_nodes": [[["add_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": 3, "beta_constraint": null, "name": "bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "bn1"}, {"inbound_nodes": [[["bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "relu1"}, "name": "relu1"}, {"inbound_nodes": [[["relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 128, "kernel_size": [1, 1], "name": "decoder_stage0_conv1", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "trainable": true}, "name": "decoder_stage0_conv1"}, {"inbound_nodes": [[["decoder_stage0_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": -1, "beta_constraint": null, "name": "decoder_stage0_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "decoder_stage0_bn1"}, {"inbound_nodes": [[["decoder_stage0_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "decoder_stage0_relu1"}, "name": "decoder_stage0_relu1"}, {"inbound_nodes": [[["decoder_stage0_relu1", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "interpolation": "nearest", "size": [2, 2], "name": "decoder_stage0_upsample2", "data_format": "channels_last"}, "name": "decoder_stage0_upsample2"}, {"inbound_nodes": [[["decoder_stage0_upsample2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 128, "kernel_size": [3, 3], "name": "decoder_stage0_conv2", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "trainable": true}, "name": "decoder_stage0_conv2"}, {"inbound_nodes": [[["decoder_stage0_conv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": -1, "beta_constraint": null, "name": "decoder_stage0_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "decoder_stage0_bn2"}, {"inbound_nodes": [[["decoder_stage0_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "decoder_stage0_relu2"}, "name": "decoder_stage0_relu2"}, {"inbound_nodes": [[["decoder_stage0_relu2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "kernel_size": [1, 1], "name": "decoder_stage0_conv3", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "trainable": true}, "name": "decoder_stage0_conv3"}, {"inbound_nodes": [[["decoder_stage0_conv3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": -1, "beta_constraint": null, "name": "decoder_stage0_bn3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "decoder_stage0_bn3"}, {"inbound_nodes": [[["decoder_stage0_bn3", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "decoder_stage0_relu3"}, "name": "decoder_stage0_relu3"}, {"inbound_nodes": [[["decoder_stage0_relu3", 0, 0, {}], ["stage4_unit1_relu1", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_9"}, "name": "add_9"}, {"inbound_nodes": [[["add_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "kernel_size": [1, 1], "name": "decoder_stage1_conv1", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "trainable": true}, "name": "decoder_stage1_conv1"}, {"inbound_nodes": [[["decoder_stage1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": -1, "beta_constraint": null, "name": "decoder_stage1_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "decoder_stage1_bn1"}, {"inbound_nodes": [[["decoder_stage1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "decoder_stage1_relu1"}, "name": "decoder_stage1_relu1"}, {"inbound_nodes": [[["decoder_stage1_relu1", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "interpolation": "nearest", "size": [2, 2], "name": "decoder_stage1_upsample2", "data_format": "channels_last"}, "name": "decoder_stage1_upsample2"}, {"inbound_nodes": [[["decoder_stage1_upsample2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "kernel_size": [3, 3], "name": "decoder_stage1_conv2", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "trainable": true}, "name": "decoder_stage1_conv2"}, {"inbound_nodes": [[["decoder_stage1_conv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": -1, "beta_constraint": null, "name": "decoder_stage1_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "decoder_stage1_bn2"}, {"inbound_nodes": [[["decoder_stage1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "decoder_stage1_relu2"}, "name": "decoder_stage1_relu2"}, {"inbound_nodes": [[["decoder_stage1_relu2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 128, "kernel_size": [1, 1], "name": "decoder_stage1_conv3", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "trainable": true}, "name": "decoder_stage1_conv3"}, {"inbound_nodes": [[["decoder_stage1_conv3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": -1, "beta_constraint": null, "name": "decoder_stage1_bn3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "decoder_stage1_bn3"}, {"inbound_nodes": [[["decoder_stage1_bn3", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "decoder_stage1_relu3"}, "name": "decoder_stage1_relu3"}, {"inbound_nodes": [[["decoder_stage1_relu3", 0, 0, {}], ["stage3_unit1_relu1", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_10"}, "name": "add_10"}, {"inbound_nodes": [[["add_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "kernel_size": [1, 1], "name": "decoder_stage2_conv1", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "trainable": true}, "name": "decoder_stage2_conv1"}, {"inbound_nodes": [[["decoder_stage2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": -1, "beta_constraint": null, "name": "decoder_stage2_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "decoder_stage2_bn1"}, {"inbound_nodes": [[["decoder_stage2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "decoder_stage2_relu1"}, "name": "decoder_stage2_relu1"}, {"inbound_nodes": [[["decoder_stage2_relu1", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "interpolation": "nearest", "size": [2, 2], "name": "decoder_stage2_upsample2", "data_format": "channels_last"}, "name": "decoder_stage2_upsample2"}, {"inbound_nodes": [[["decoder_stage2_upsample2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "kernel_size": [3, 3], "name": "decoder_stage2_conv2", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "trainable": true}, "name": "decoder_stage2_conv2"}, {"inbound_nodes": [[["decoder_stage2_conv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": -1, "beta_constraint": null, "name": "decoder_stage2_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "decoder_stage2_bn2"}, {"inbound_nodes": [[["decoder_stage2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "decoder_stage2_relu2"}, "name": "decoder_stage2_relu2"}, {"inbound_nodes": [[["decoder_stage2_relu2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "kernel_size": [1, 1], "name": "decoder_stage2_conv3", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "trainable": true}, "name": "decoder_stage2_conv3"}, {"inbound_nodes": [[["decoder_stage2_conv3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "axis": -1, "beta_constraint": null, "name": "decoder_stage2_bn3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "name": "decoder_stage2_bn3"}, {"inbound_nodes": [[["decoder_stage2_bn3", 0, 0, {}]]], 