{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null, null, 3], "name": "data"}, "name": "data", "inbound_nodes": []}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": false, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_data", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "bn_data", "inbound_nodes": [[["data", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_37", "padding": [[3, 3], [3, 3]]}, "name": "zero_padding2d_37", "inbound_nodes": [[["bn_data", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 64, "name": "conv0", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [2, 2], "use_bias": false, "kernel_size": [7, 7]}, "name": "conv0", "inbound_nodes": [[["zero_padding2d_37", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn0", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "bn0", "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "relu0", "activation": "relu"}, "name": "relu0", "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_38", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_38", "inbound_nodes": [[["relu0", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "name": "pooling0", "pool_size": [3, 3]}, "name": "pooling0", "inbound_nodes": [[["zero_padding2d_38", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage1_unit1_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "stage1_unit1_bn1", "inbound_nodes": [[["pooling0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage1_unit1_relu1", "activation": "relu"}, "name": "stage1_unit1_relu1", "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_39", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_39", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 64, "name": "stage1_unit1_conv1", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "stage1_unit1_conv1", "inbound_nodes": [[["zero_padding2d_39", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage1_unit1_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "stage1_unit1_bn2", "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage1_unit1_relu2", "activation": "relu"}, "name": "stage1_unit1_relu2", "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_40", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_40", "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 64, "name": "stage1_unit1_conv2", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "stage1_unit1_conv2", "inbound_nodes": [[["zero_padding2d_40", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 64, "name": "stage1_unit1_sc", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [1, 1], "use_bias": false, "kernel_size": [1, 1]}, "name": "stage1_unit1_sc", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_17"}, "name": "add_17", "inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage1_unit2_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "stage1_unit2_bn1", "inbound_nodes": [[["add_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage1_unit2_relu1", "activation": "relu"}, "name": "stage1_unit2_relu1", "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_41", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_41", "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 64, "name": "stage1_unit2_conv1", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "stage1_unit2_conv1", "inbound_nodes": [[["zero_padding2d_41", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage1_unit2_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "stage1_unit2_bn2", "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage1_unit2_relu2", "activation": "relu"}, "name": "stage1_unit2_relu2", "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_42", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_42", "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 64, "name": "stage1_unit2_conv2", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "stage1_unit2_conv2", "inbound_nodes": [[["zero_padding2d_42", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_18"}, "name": "add_18", "inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_unit1_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "stage2_unit1_bn1", "inbound_nodes": [[["add_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage2_unit1_relu1", "activation": "relu"}, "name": "stage2_unit1_relu1", "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_43", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_43", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 128, "name": "stage2_unit1_conv1", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [2, 2], "use_bias": false, "kernel_size": [3, 3]}, "name": "stage2_unit1_conv1", "inbound_nodes": [[["zero_padding2d_43", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_unit1_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "stage2_unit1_bn2", "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage2_unit1_relu2", "activation": "relu"}, "name": "stage2_unit1_relu2", "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_44", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_44", "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 128, "name": "stage2_unit1_conv2", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "stage2_unit1_conv2", "inbound_nodes": [[["zero_padding2d_44", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 128, "name": "stage2_unit1_sc", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [2, 2], "use_bias": false, "kernel_size": [1, 1]}, "name": "stage2_unit1_sc", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_19"}, "name": "add_19", "inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_unit2_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "stage2_unit2_bn1", "inbound_nodes": [[["add_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage2_unit2_relu1", "activation": "relu"}, "name": "stage2_unit2_relu1", "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_45", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_45", "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 128, "name": "stage2_unit2_conv1", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "stage2_unit2_conv1", "inbound_nodes": [[["zero_padding2d_45", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_unit2_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "stage2_unit2_bn2", "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage2_unit2_relu2", "activation": "relu"}, "name": "stage2_unit2_relu2", "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_46", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_46", "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 128, "name": "stage2_unit2_conv2", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "stage2_unit2_conv2", "inbound_nodes": [[["zero_padding2d_46", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_20"}, "name": "add_20", "inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage3_unit1_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "stage3_unit1_bn1", "inbound_nodes": [[["add_20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage3_unit1_relu1", "activation": "relu"}, "name": "stage3_unit1_relu1", "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_47", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_47", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 256, "name": "stage3_unit1_conv1", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [2, 2], "use_bias": false, "kernel_size": [3, 3]}, "name": "stage3_unit1_conv1", "inbound_nodes": [[["zero_padding2d_47", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage3_unit1_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "stage3_unit1_bn2", "inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage3_unit1_relu2", "activation": "relu"}, "name": "stage3_unit1_relu2", "inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_48", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_48", "inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 256, "name": "stage3_unit1_conv2", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "stage3_unit1_conv2", "inbound_nodes": [[["zero_padding2d_48", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 256, "name": "stage3_unit1_sc", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [2, 2], "use_bias": false, "kernel_size": [1, 1]}, "name": "stage3_unit1_sc", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_21"}, "name": "add_21", "inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage3_unit2_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "stage3_unit2_bn1", "inbound_nodes": [[["add_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage3_unit2_relu1", "activation": "relu"}, "name": "stage3_unit2_relu1", "inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_49", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_49", "inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 256, "name": "stage3_unit2_conv1", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "stage3_unit2_conv1", "inbound_nodes": [[["zero_padding2d_49", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage3_unit2_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "stage3_unit2_bn2", "inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage3_unit2_relu2", "activation": "relu"}, "name": "stage3_unit2_relu2", "inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_50", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_50", "inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 256, "name": "stage3_unit2_conv2", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "stage3_unit2_conv2", "inbound_nodes": [[["zero_padding2d_50", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_22"}, "name": "add_22", "inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage4_unit1_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "stage4_unit1_bn1", "inbound_nodes": [[["add_22", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage4_unit1_relu1", "activation": "relu"}, "name": "stage4_unit1_relu1", "inbound_nodes": [[["stage4_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_51", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_51", "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 512, "name": "stage4_unit1_conv1", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [2, 2], "use_bias": false, "kernel_size": [3, 3]}, "name": "stage4_unit1_conv1", "inbound_nodes": [[["zero_padding2d_51", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage4_unit1_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "stage4_unit1_bn2", "inbound_nodes": [[["stage4_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage4_unit1_relu2", "activation": "relu"}, "name": "stage4_unit1_relu2", "inbound_nodes": [[["stage4_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_52", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_52", "inbound_nodes": [[["stage4_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 512, "name": "stage4_unit1_conv2", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "stage4_unit1_conv2", "inbound_nodes": [[["zero_padding2d_52", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 512, "name": "stage4_unit1_sc", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [2, 2], "use_bias": false, "kernel_size": [1, 1]}, "name": "stage4_unit1_sc", "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_23"}, "name": "add_23", "inbound_nodes": [[["stage4_unit1_conv2", 0, 0, {}], ["stage4_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage4_unit2_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "stage4_unit2_bn1", "inbound_nodes": [[["add_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage4_unit2_relu1", "activation": "relu"}, "name": "stage4_unit2_relu1", "inbound_nodes": [[["stage4_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_53", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_53", "inbound_nodes": [[["stage4_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 512, "name": "stage4_unit2_conv1", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "stage4_unit2_conv1", "inbound_nodes": [[["zero_padding2d_53", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage4_unit2_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "stage4_unit2_bn2", "inbound_nodes": [[["stage4_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage4_unit2_relu2", "activation": "relu"}, "name": "stage4_unit2_relu2", "inbound_nodes": [[["stage4_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "name": "zero_padding2d_54", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_54", "inbound_nodes": [[["stage4_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 512, "name": "stage4_unit2_conv2", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "stage4_unit2_conv2", "inbound_nodes": [[["zero_padding2d_54", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_24"}, "name": "add_24", "inbound_nodes": [[["stage4_unit2_conv2", 0, 0, {}], ["add_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 2e-05, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "bn1", "inbound_nodes": [[["add_24", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "relu1", "activation": "relu"}, "name": "relu1", "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"interpolation": "nearest", "data_format": "channels_last", "trainable": true, "name": "decoder_stage0_upsample", "size": [2, 2]}, "name": "decoder_stage0_upsample", "inbound_nodes": [[["relu1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_5", "axis": -1}, "name": "concatenate_5", "inbound_nodes": [[["decoder_stage0_upsample", 0, 0, {}], ["stage4_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 256, "name": "decoder_stage0_conv1", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "same", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "decoder_stage0_conv1", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage0_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "decoder_stage0_bn1", "inbound_nodes": [[["decoder_stage0_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage0_relu1", "activation": "relu"}, "name": "decoder_stage0_relu1", "inbound_nodes": [[["decoder_stage0_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 256, "name": "decoder_stage0_conv2", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "same", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "decoder_stage0_conv2", "inbound_nodes": [[["decoder_stage0_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage0_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "decoder_stage0_bn2", "inbound_nodes": [[["decoder_stage0_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage0_relu2", "activation": "relu"}, "name": "decoder_stage0_relu2", "inbound_nodes": [[["decoder_stage0_bn2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"interpolation": "nearest", "data_format": "channels_last", "trainable": true, "name": "decoder_stage1_upsample", "size": [2, 2]}, "name": "decoder_stage1_upsample", "inbound_nodes": [[["decoder_stage0_relu2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_6", "axis": -1}, "name": "concatenate_6", "inbound_nodes": [[["decoder_stage1_upsample", 0, 0, {}], ["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 128, "name": "decoder_stage1_conv1", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "same", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "decoder_stage1_conv1", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage1_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "decoder_stage1_bn1", "inbound_nodes": [[["decoder_stage1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage1_relu1", "activation": "relu"}, "name": "decoder_stage1_relu1", "inbound_nodes": [[["decoder_stage1_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 128, "name": "decoder_stage1_conv2", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "same", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "decoder_stage1_conv2", "inbound_nodes": [[["decoder_stage1_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage1_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "decoder_stage1_bn2", "inbound_nodes": [[["decoder_stage1_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage1_relu2", "activation": "relu"}, "name": "decoder_stage1_relu2", "inbound_nodes": [[["decoder_stage1_bn2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"interpolation": "nearest", "data_format": "channels_last", "trainable": true, "name": "decoder_stage2_upsample", "size": [2, 2]}, "name": "decoder_stage2_upsample", "inbound_nodes": [[["decoder_stage1_relu2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_7", "axis": -1}, "name": "concatenate_7", "inbound_nodes": [[["decoder_stage2_upsample", 0, 0, {}], ["stage2_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 64, "name": "decoder_stage2_conv1", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "same", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "decoder_stage2_conv1", "inbound_nodes": [[["concatenate_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage2_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "decoder_stage2_bn1", "inbound_nodes": [[["decoder_stage2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage2_relu1", "activation": "relu"}, "name": "decoder_stage2_relu1", "inbound_nodes": [[["decoder_stage2_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 64, "name": "decoder_stage2_conv2", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "same", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "decoder_stage2_conv2", "inbound_nodes": [[["decoder_stage2_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage2_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "decoder_stage2_bn2", "inbound_nodes": [[["decoder_stage2_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage2_relu2", "activation": "relu"}, "name": "decoder_stage2_relu2", "inbound_nodes": [[["decoder_stage2_bn2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"interpolation": "nearest", "data_format": "channels_last", "trainable": true, "name": "decoder_stage3_upsample", "size": [2, 2]}, "name": "decoder_stage3_upsample", "inbound_nodes": [[["decoder_stage2_relu2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_8", "axis": -1}, "name": "concatenate_8", "inbound_nodes": [[["decoder_stage3_upsample", 0, 0, {}], ["relu0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 32, "name": "decoder_stage3_conv1", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "same", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "decoder_stage3_conv1", "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage3_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "decoder_stage3_bn1", "inbound_nodes": [[["decoder_stage3_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage3_relu1", "activation": "relu"}, "name": "decoder_stage3_relu1", "inbound_nodes": [[["decoder_stage3_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "filters": 32, "name": "decoder_stage3_conv2", "activity_regularizer": null, "trainable": true, "activation": "linear", "padding": "same", "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3]}, "name": "decoder_stage3_conv2", "inbound_nodes": [[["decoder_stage3_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "epsilon": 0.001, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage3_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "decoder_stage3_bn2", "inbound_nodes": [[["decoder_stage3_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage3_relu2", "activation": "relu"}, "name": "decoder_stage3_relu2", "inbound_nodes": [[["decoder_stage3_bn2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"interpolation": "nearest", "data_format": "channels_last", "trainable": true, "name": "decoder_stage4_upsample", "size": [2, 2]}, "name": "decoder_stage4_upsample", "inbound_nodes": [[["decoder_stage3_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, 