{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"name": "data", "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null, null, 3], "name": "data"}, "inbound_nodes": []}, {"name": "bn_data", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "bn_data", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["data", 0, 0, {}]]]}, {"name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "data_format": "channels_last", "padding": [[3, 3], [3, 3]]}, "inbound_nodes": [[["bn_data", 0, 0, {}]]]}, {"name": "conv0", "class_name": "Conv2D", "config": {"kernel_size": [7, 7], "strides": [2, 2], "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv0", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"name": "bn0", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "bn0", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"name": "relu0", "class_name": "Activation", "config": {"name": "relu0", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"name": "zero_padding2d_2", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["relu0", 0, 0, {}]]]}, {"name": "pooling0", "class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "pooling0", "trainable": true, "pool_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"name": "stage1_unit1_bn1", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "stage1_unit1_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["pooling0", 0, 0, {}]]]}, {"name": "stage1_unit1_relu1", "class_name": "Activation", "config": {"name": "stage1_unit1_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_3", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"name": "stage1_unit1_conv1", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage1_unit1_conv1", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "stage1_unit1_bn2", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "stage1_unit1_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]]}, {"name": "stage1_unit1_relu2", "class_name": "Activation", "config": {"name": "stage1_unit1_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_4", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_4", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]]}, {"name": "stage1_unit1_conv2", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage1_unit1_conv2", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]]}, {"name": "stage1_unit1_sc", "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [1, 1], "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage1_unit1_sc", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]]}, {"name": "stage1_unit2_bn1", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "stage1_unit2_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "stage1_unit2_relu1", "class_name": "Activation", "config": {"name": "stage1_unit2_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_5", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_5", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]]}, {"name": "stage1_unit2_conv1", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage1_unit2_conv1", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]]}, {"name": "stage1_unit2_bn2", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "stage1_unit2_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]]}, {"name": "stage1_unit2_relu2", "class_name": "Activation", "config": {"name": "stage1_unit2_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_6", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_6", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]]}, {"name": "stage1_unit2_conv2", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage1_unit2_conv2", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_1", 0, 0, {}]]]}, {"name": "stage2_unit1_bn1", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "stage2_unit1_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "stage2_unit1_relu1", "class_name": "Activation", "config": {"name": "stage2_unit1_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_7", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_7", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"name": "stage2_unit1_conv1", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [2, 2], "bias_constraint": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage2_unit1_conv1", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]]}, {"name": "stage2_unit1_bn2", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "stage2_unit1_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]]}, {"name": "stage2_unit1_relu2", "class_name": "Activation", "config": {"name": "stage2_unit1_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_8", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_8", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]]}, {"name": "stage2_unit1_conv2", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage2_unit1_conv2", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]]}, {"name": "stage2_unit1_sc", "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [2, 2], "bias_constraint": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage2_unit1_sc", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]]}, {"name": "stage2_unit2_bn1", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "stage2_unit2_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "stage2_unit2_relu1", "class_name": "Activation", "config": {"name": "stage2_unit2_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_9", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_9", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]]}, {"name": "stage2_unit2_conv1", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage2_unit2_conv1", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]]}, {"name": "stage2_unit2_bn2", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "stage2_unit2_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]]}, {"name": "stage2_unit2_relu2", "class_name": "Activation", "config": {"name": "stage2_unit2_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_10", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_10", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]]}, {"name": "stage2_unit2_conv2", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage2_unit2_conv2", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_3", 0, 0, {}]]]}, {"name": "stage3_unit1_bn1", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "stage3_unit1_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "stage3_unit1_relu1", "class_name": "Activation", "config": {"name": "stage3_unit1_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_11", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_11", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"name": "stage3_unit1_conv1", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [2, 2], "bias_constraint": null, "filters": 256, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage3_unit1_conv1", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]]}, {"name": "stage3_unit1_bn2", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "stage3_unit1_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]]}, {"name": "stage3_unit1_relu2", "class_name": "Activation", "config": {"name": "stage3_unit1_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_12", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_12", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]]}, {"name": "stage3_unit1_conv2", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 256, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage3_unit1_conv2", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["zero_padding2d_12", 0, 0, {}]]]}, {"name": "stage3_unit1_sc", "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [2, 2], "bias_constraint": null, "filters": 256, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage3_unit1_sc", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]]}, {"name": "stage3_unit2_bn1", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "stage3_unit2_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "stage3_unit2_relu1", "class_name": "Activation", "config": {"name": "stage3_unit2_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_13", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_13", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]]}, {"name": "stage3_unit2_conv1", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 256, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage3_unit2_conv1", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["zero_padding2d_13", 0, 0, {}]]]}, {"name": "stage3_unit2_bn2", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "stage3_unit2_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]]}, {"name": "stage3_unit2_relu2", "class_name": "Activation", "config": {"name": "stage3_unit2_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_14", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_14", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]]}, {"name": "stage3_unit2_conv2", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 256, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage3_unit2_conv2", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_5", 0, 0, {}]]]}, {"name": "stage4_unit1_bn1", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "stage4_unit1_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "stage4_unit1_relu1", "class_name": "Activation", "config": {"name": "stage4_unit1_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage4_unit1_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_15", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_15", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]]}, {"name": "stage4_unit1_conv1", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [2, 2], "bias_constraint": null, "filters": 512, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage4_unit1_conv1", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]]}, {"name": "stage4_unit1_bn2", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "stage4_unit1_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["stage4_unit1_conv1", 0, 0, {}]]]}, {"name": "stage4_unit1_relu2", "class_name": "Activation", "config": {"name": "stage4_unit1_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage4_unit1_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_16", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_16", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage4_unit1_relu2", 0, 0, {}]]]}, {"name": "stage4_unit1_conv2", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 512, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage4_unit1_conv2", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]]}, {"name": "stage4_unit1_sc", "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [2, 2], "bias_constraint": null, "filters": 512, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage4_unit1_sc", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["stage4_unit1_conv2", 0, 0, {}], ["stage4_unit1_sc", 0, 0, {}]]]}, {"name": "stage4_unit2_bn1", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "stage4_unit2_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "stage4_unit2_relu1", "class_name": "Activation", "config": {"name": "stage4_unit2_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage4_unit2_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_17", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_17", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage4_unit2_relu1", 0, 0, {}]]]}, {"name": "stage4_unit2_conv1", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 512, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage4_unit2_conv1", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]]}, {"name": "stage4_unit2_bn2", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "stage4_unit2_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["stage4_unit2_conv1", 0, 0, {}]]]}, {"name": "stage4_unit2_relu2", "class_name": "Activation", "config": {"name": "stage4_unit2_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stage4_unit2_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_18", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_18", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage4_unit2_relu2", 0, 0, {}]]]}, {"name": "stage4_unit2_conv2", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 512, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "stage4_unit2_conv2", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}, "inbound_nodes": [[["zero_padding2d_18", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["stage4_unit2_conv2", 0, 0, {}], ["add_7", 0, 0, {}]]]}, {"name": "bn1", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 2e-05, "name": "bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "relu1", "class_name": "Activation", "config": {"name": "relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"name": "decoder_stage0_upsample", "class_name": "UpSampling2D", "config": {"name": "decoder_stage0_upsample", "trainable": true, "data_format": "channels_last", "size": [2, 2], "interpolation": "nearest"}, "inbound_nodes": [[["relu1", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["decoder_stage0_upsample", 0, 0, {}], ["stage4_unit1_relu1", 0, 0, {}]]]}, {"name": "decoder_stage0_conv1", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 256, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "decoder_stage0_conv1", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "decoder_stage0_bn1", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "name": "decoder_stage0_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null}, "inbound_nodes": [[["decoder_stage0_conv1", 0, 0, {}]]]}, {"name": "decoder_stage0_relu1", "class_name": "Activation", "config": {"name": "decoder_stage0_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["decoder_stage0_bn1", 0, 0, {}]]]}, {"name": "decoder_stage0_conv2", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 256, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "decoder_stage0_conv2", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["decoder_stage0_relu1", 0, 0, {}]]]}, {"name": "decoder_stage0_bn2", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "name": "decoder_stage0_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null}, "inbound_nodes": [[["decoder_stage0_conv2", 0, 0, {}]]]}, {"name": "decoder_stage0_relu2", "class_name": "Activation", "config": {"name": "decoder_stage0_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["decoder_stage0_bn2", 0, 0, {}]]]}, {"name": "decoder_stage1_upsample", "class_name": "UpSampling2D", "config": {"name": "decoder_stage1_upsample", "trainable": true, "data_format": "channels_last", "size": [2, 2], "interpolation": "nearest"}, "inbound_nodes": [[["decoder_stage0_relu2", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "axis": -1}, "inbound_nodes": [[["decoder_stage1_upsample", 0, 0, {}], ["stage3_unit1_relu1", 0, 0, {}]]]}, {"name": "decoder_stage1_conv1", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "decoder_stage1_conv1", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "decoder_stage1_bn1", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "name": "decoder_stage1_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null}, "inbound_nodes": [[["decoder_stage1_conv1", 0, 0, {}]]]}, {"name": "decoder_stage1_relu1", "class_name": "Activation", "config": {"name": "decoder_stage1_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["decoder_stage1_bn1", 0, 0, {}]]]}, {"name": "decoder_stage1_conv2", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "decoder_stage1_conv2", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["decoder_stage1_relu1", 0, 0, {}]]]}, {"name": "decoder_stage1_bn2", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "name": "decoder_stage1_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null}, "inbound_nodes": [[["decoder_stage1_conv2", 0, 0, {}]]]}, {"name": "decoder_stage1_relu2", "class_name": "Activation", "config": {"name": "decoder_stage1_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["decoder_stage1_bn2", 0, 0, {}]]]}, {"name": "decoder_stage2_upsample", "class_name": "UpSampling2D", "config": {"name": "decoder_stage2_upsample", "trainable": true, "data_format": "channels_last", "size": [2, 2], "interpolation": "nearest"}, "inbound_nodes": [[["decoder_stage1_relu2", 0, 0, {}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "axis": -1}, "inbound_nodes": [[["decoder_stage2_upsample", 0, 0, {}], ["stage2_unit1_relu1", 0, 0, {}]]]}, {"name": "decoder_stage2_conv1", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "decoder_stage2_conv1", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "decoder_stage2_bn1", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "name": "decoder_stage2_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null}, "inbound_nodes": [[["decoder_stage2_conv1", 0, 0, {}]]]}, {"name": "decoder_stage2_relu1", "class_name": "Activation", "config": {"name": "decoder_stage2_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["decoder_stage2_bn1", 0, 0, {}]]]}, {"name": "decoder_stage2_conv2", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "decoder_stage2_conv2", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["decoder_stage2_relu1", 0, 0, {}]]]}, {"name": "decoder_stage2_bn2", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "name": "decoder_stage2_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null}, "inbound_nodes": [[["decoder_stage2_conv2", 0, 0, {}]]]}, {"name": "decoder_stage2_relu2", "class_name": "Activation", "config": {"name": "decoder_stage2_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["decoder_stage2_bn2", 0, 0, {}]]]}, {"name": "decoder_stage3_upsample", "class_name": "UpSampling2D", "config": {"name": "decoder_stage3_upsample", "trainable": true, "data_format": "channels_last", "size": [2, 2], "interpolation": "nearest"}, "inbound_nodes": [[["decoder_stage2_relu2", 0, 0, {}]]]}, {"name": "concatenate_4", "class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "axis": -1}, "inbound_nodes": [[["decoder_stage3_upsample", 0, 0, {}], ["relu0", 0, 0, {}]]]}, {"name": "decoder_stage3_conv1", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 32, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "decoder_stage3_conv1", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"name": "decoder_stage3_bn1", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "name": "decoder_stage3_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null}, "inbound_nodes": [[["decoder_stage3_conv1", 0, 0, {}]]]}, {"name": "decoder_stage3_relu1", "class_name": "Activation", "config": {"name": "decoder_stage3_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["decoder_stage3_bn1", 0, 0, {}]]]}, {"name": "decoder_stage3_conv2", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 32, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "decoder_stage3_conv2", "use_bias": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["decoder_stage3_relu1", 0, 0, {}]]]}, {"name": "decoder_stage3_bn2", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "name": "decoder_stage3_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null}, "inbound_nodes": [[["decoder_stage3_conv2", 0, 0, {}]]]}, {"name": "decoder_stage3_relu2", "class_name": "Activation", "config": {"name": "decoder_stage3_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["decoder_stage3_bn2", 0, 0, {}]]]}, {"name": "decoder_stage4_upsample", "class_name": "UpSampling2D", "config": {"name": "decoder_stage4_upsample", "trainable": true, "data_format": "channels_last", "size": [2, 2], "interpolation": "nearest"}, "inbound_nodes": [[["decoder_stage3_relu2", 0, 0, {}]]]}, {"name": "decoder_stage4_conv1", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "filters": 16, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "padding": "same", "data_format": "channels_last", 