{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4", "config": {"output_layers": [["sigmoid", 0, 0]], "name": "u-resnet18", "layers": [{"name": "data", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "data"}}, {"name": "bn_data", "class_name": "BatchNormalization", "inbound_nodes": [[["data", 0, 0, {}]]], "config": {"scale": false, "name": "bn_data", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "zero_padding2d_19", "class_name": "ZeroPadding2D", "inbound_nodes": [[["bn_data", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[3, 3], [3, 3]], "name": "zero_padding2d_19"}}, {"name": "conv0", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_19", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv0", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [7, 7], "strides": [2, 2], "use_bias": false, "bias_regularizer": null, "filters": 64, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "bn0", "class_name": "BatchNormalization", "inbound_nodes": [[["conv0", 0, 0, {}]]], "config": {"scale": true, "name": "bn0", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "relu0", "class_name": "Activation", "inbound_nodes": [[["bn0", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "relu0"}}, {"name": "zero_padding2d_20", "class_name": "ZeroPadding2D", "inbound_nodes": [[["relu0", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_20"}}, {"name": "pooling0", "class_name": "MaxPooling2D", "inbound_nodes": [[["zero_padding2d_20", 0, 0, {}]]], "config": {"strides": [2, 2], "padding": "valid", "name": "pooling0", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3]}}, {"name": "stage1_unit1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["pooling0", 0, 0, {}]]], "config": {"scale": true, "name": "stage1_unit1_bn1", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "stage1_unit1_relu1", "class_name": "Activation", "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "stage1_unit1_relu1"}}, {"name": "zero_padding2d_21", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_21"}}, {"name": "stage1_unit1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_21", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage1_unit1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 64, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "stage1_unit1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]], "config": {"scale": true, "name": "stage1_unit1_bn2", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "stage1_unit1_relu2", "class_name": "Activation", "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "stage1_unit1_relu2"}}, {"name": "zero_padding2d_22", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_22"}}, {"name": "stage1_unit1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_22", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage1_unit1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 64, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "stage1_unit1_sc", "class_name": "Conv2D", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage1_unit1_sc", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 64, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "add_9", "class_name": "Add", "inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]], "config": {"trainable": true, "name": "add_9"}}, {"name": "stage1_unit2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"scale": true, "name": "stage1_unit2_bn1", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "stage1_unit2_relu1", "class_name": "Activation", "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "stage1_unit2_relu1"}}, {"name": "zero_padding2d_23", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_23"}}, {"name": "stage1_unit2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_23", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage1_unit2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 64, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "stage1_unit2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]], "config": {"scale": true, "name": "stage1_unit2_bn2", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "stage1_unit2_relu2", "class_name": "Activation", "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "stage1_unit2_relu2"}}, {"name": "zero_padding2d_24", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_24"}}, {"name": "stage1_unit2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_24", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage1_unit2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 64, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "add_10", "class_name": "Add", "inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_9", 0, 0, {}]]], "config": {"trainable": true, "name": "add_10"}}, {"name": "stage2_unit1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_10", 0, 0, {}]]], "config": {"scale": true, "name": "stage2_unit1_bn1", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "stage2_unit1_relu1", "class_name": "Activation", "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "stage2_unit1_relu1"}}, {"name": "zero_padding2d_25", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_25"}}, {"name": "stage2_unit1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_25", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage2_unit1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "use_bias": false, "bias_regularizer": null, "filters": 128, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "stage2_unit1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]], "config": {"scale": true, "name": "stage2_unit1_bn2", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "stage2_unit1_relu2", "class_name": "Activation", "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "stage2_unit1_relu2"}}, {"name": "zero_padding2d_26", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_26"}}, {"name": "stage2_unit1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_26", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage2_unit1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 128, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "stage2_unit1_sc", "class_name": "Conv2D", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage2_unit1_sc", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [1, 1], "strides": [2, 2], "use_bias": false, "bias_regularizer": null, "filters": 128, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "add_11", "class_name": "Add", "inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]], "config": {"trainable": true, "name": "add_11"}}, {"name": "stage2_unit2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_11", 0, 0, {}]]], "config": {"scale": true, "name": "stage2_unit2_bn1", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "stage2_unit2_relu1", "class_name": "Activation", "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "stage2_unit2_relu1"}}, {"name": "zero_padding2d_27", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_27"}}, {"name": "stage2_unit2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_27", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage2_unit2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 128, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "stage2_unit2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]], "config": {"scale": true, "name": "stage2_unit2_bn2", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "stage2_unit2_relu2", "class_name": "Activation", "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "stage2_unit2_relu2"}}, {"name": "zero_padding2d_28", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_28"}}, {"name": "stage2_unit2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_28", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage2_unit2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 128, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "add_12", "class_name": "Add", "inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_11", 0, 0, {}]]], "config": {"trainable": true, "name": "add_12"}}, {"name": "stage3_unit1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_12", 0, 0, {}]]], "config": {"scale": true, "name": "stage3_unit1_bn1", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "stage3_unit1_relu1", "class_name": "Activation", "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "stage3_unit1_relu1"}}, {"name": "zero_padding2d_29", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_29"}}, {"name": "stage3_unit1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_29", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage3_unit1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "use_bias": false, "bias_regularizer": null, "filters": 256, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "stage3_unit1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]], "config": {"scale": true, "name": "stage3_unit1_bn2", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "stage3_unit1_relu2", "class_name": "Activation", "inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "stage3_unit1_relu2"}}, {"name": "zero_padding2d_30", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_30"}}, {"name": "stage3_unit1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_30", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage3_unit1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 256, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "stage3_unit1_sc", "class_name": "Conv2D", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage3_unit1_sc", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [1, 1], "strides": [2, 2], "use_bias": false, "bias_regularizer": null, "filters": 256, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "add_13", "class_name": "Add", "inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]], "config": {"trainable": true, "name": "add_13"}}, {"name": "stage3_unit2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_13", 0, 0, {}]]], "config": {"scale": true, "name": "stage3_unit2_bn1", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "stage3_unit2_relu1", "class_name": "Activation", "inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "stage3_unit2_relu1"}}, {"name": "zero_padding2d_31", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_31"}}, {"name": "stage3_unit2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_31", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage3_unit2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 256, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "stage3_unit2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]], "config": {"scale": true, "name": "stage3_unit2_bn2", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "stage3_unit2_relu2", "class_name": "Activation", "inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "stage3_unit2_relu2"}}, {"name": "zero_padding2d_32", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_32"}}, {"name": "stage3_unit2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_32", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage3_unit2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 256, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "add_14", "class_name": "Add", "inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_13", 0, 0, {}]]], "config": {"trainable": true, "name": "add_14"}}, {"name": "stage4_unit1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_14", 0, 0, {}]]], "config": {"scale": true, "name": "stage4_unit1_bn1", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "stage4_unit1_relu1", "class_name": "Activation", "inbound_nodes": [[["stage4_unit1_bn1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "stage4_unit1_relu1"}}, {"name": "zero_padding2d_33", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_33"}}, {"name": "stage4_unit1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_33", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage4_unit1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "use_bias": false, "bias_regularizer": null, "filters": 512, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "stage4_unit1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage4_unit1_conv1", 0, 0, {}]]], "config": {"scale": true, "name": "stage4_unit1_bn2", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "stage4_unit1_relu2", "class_name": "Activation", "inbound_nodes": [[["stage4_unit1_bn2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "stage4_unit1_relu2"}}, {"name": "zero_padding2d_34", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage4_unit1_relu2", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_34"}}, {"name": "stage4_unit1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_34", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage4_unit1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 512, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "stage4_unit1_sc", "class_name": "Conv2D", "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage4_unit1_sc", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [1, 1], "strides": [2, 2], "use_bias": false, "bias_regularizer": null, "filters": 512, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "add_15", "class_name": "Add", "inbound_nodes": [[["stage4_unit1_conv2", 0, 0, {}], ["stage4_unit1_sc", 0, 0, {}]]], "config": {"trainable": true, "name": "add_15"}}, {"name": "stage4_unit2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_15", 0, 0, {}]]], "config": {"scale": true, "name": "stage4_unit2_bn1", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "stage4_unit2_relu1", "class_name": "Activation", "inbound_nodes": [[["stage4_unit2_bn1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "stage4_unit2_relu1"}}, {"name": "zero_padding2d_35", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage4_unit2_relu1", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_35"}}, {"name": "stage4_unit2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_35", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage4_unit2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 512, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "stage4_unit2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage4_unit2_conv1", 0, 0, {}]]], "config": {"scale": true, "name": "stage4_unit2_bn2", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "stage4_unit2_relu2", "class_name": "Activation", "inbound_nodes": [[["stage4_unit2_bn2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "stage4_unit2_relu2"}}, {"name": "zero_padding2d_36", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage4_unit2_relu2", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "zero_padding2d_36"}}, {"name": "stage4_unit2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_36", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "stage4_unit2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 512, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "uniform", "mode": "fan_in"}}}}, {"name": "add_16", "class_name": "Add", "inbound_nodes": [[["stage4_unit2_conv2", 0, 0, {}], ["add_15", 0, 0, {}]]], "config": {"trainable": true, "name": "add_16"}}, {"name": "bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_16", 0, 0, {}]]], "config": {"scale": true, "name": "bn1", "axis": 3, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "relu1", "class_name": "Activation", "inbound_nodes": [[["bn1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "relu1"}}, {"name": "decoder_stage0_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["relu1", 0, 0, {}]]], "config": {"interpolation": "nearest", "name": "decoder_stage0_upsample", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"name": "concatenate_5", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage0_upsample", 0, 0, {}], ["stage4_unit1_relu1", 0, 0, {}]]], "config": {"trainable": true, "axis": -1, "name": "concatenate_5"}}, {"name": "decoder_stage0_conv1", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "decoder_stage0_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 256, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"name": "decoder_stage0_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage0_conv1", 0, 0, {}]]], "config": {"scale": true, "name": "decoder_stage0_bn1", "axis": -1, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "decoder_stage0_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage0_bn1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "decoder_stage0_relu1"}}, {"name": "decoder_stage0_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage0_relu1", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "decoder_stage0_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 256, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"name": "decoder_stage0_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage0_conv2", 0, 0, {}]]], "config": {"scale": true, "name": "decoder_stage0_bn2", "axis": -1, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "decoder_stage0_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage0_bn2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "decoder_stage0_relu2"}}, {"name": "decoder_stage1_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage0_relu2", 0, 0, {}]]], "config": {"interpolation": "nearest", "name": "decoder_stage1_upsample", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"name": "concatenate_6", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage1_upsample", 0, 0, {}], ["stage3_unit1_relu1", 0, 0, {}]]], "config": {"trainable": true, "axis": -1, "name": "concatenate_6"}}, {"name": "decoder_stage1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "decoder_stage1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 128, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"name": "decoder_stage1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage1_conv1", 0, 0, {}]]], "config": {"scale": true, "name": "decoder_stage1_bn1", "axis": -1, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "decoder_stage1_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage1_bn1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "decoder_stage1_relu1"}}, {"name": "decoder_stage1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage1_relu1", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "decoder_stage1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 128, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"name": "decoder_stage1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage1_conv2", 0, 0, {}]]], "config": {"scale": true, "name": "decoder_stage1_bn2", "axis": -1, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "decoder_stage1_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage1_bn2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "decoder_stage1_relu2"}}, {"name": "decoder_stage2_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage1_relu2", 0, 0, {}]]], "config": {"interpolation": "nearest", "name": "decoder_stage2_upsample", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"name": "concatenate_7", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage2_upsample", 0, 0, {}], ["stage2_unit1_relu1", 0, 0, {}]]], "config": {"trainable": true, "axis": -1, "name": "concatenate_7"}}, {"name": "decoder_stage2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_7", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "decoder_stage2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 64, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"name": "decoder_stage2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage2_conv1", 0, 0, {}]]], "config": {"scale": true, "name": "decoder_stage2_bn1", "axis": -1, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "decoder_stage2_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage2_bn1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "decoder_stage2_relu1"}}, {"name": "decoder_stage2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage2_relu1", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "decoder_stage2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 64, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"name": "decoder_stage2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage2_conv2", 0, 0, {}]]], "config": {"scale": true, "name": "decoder_stage2_bn2", "axis": -1, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "decoder_stage2_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage2_bn2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "decoder_stage2_relu2"}}, {"name": "decoder_stage3_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage2_relu2", 0, 0, {}]]], "config": {"interpolation": "nearest", "name": "decoder_stage3_upsample", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"name": "concatenate_8", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage3_upsample", 0, 0, {}], ["relu0", 0, 0, {}]]], "config": {"trainable": true, "axis": -1, "name": "concatenate_8"}}, {"name": "decoder_stage3_conv1", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_8", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "decoder_stage3_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 32, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"name": "decoder_stage3_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage3_conv1", 0, 0, {}]]], "config": {"scale": true, "name": "decoder_stage3_bn1", "axis": -1, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "decoder_stage3_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage3_bn1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "decoder_stage3_relu1"}}, {"name": "decoder_stage3_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage3_relu1", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "decoder_stage3_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "filters": 32, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"name": "decoder_stage3_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage3_conv2", 0, 0, {}]]], "config": {"scale": true, "name": "decoder_stage3_bn2", "axis": -1, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"name": "decoder_stage3_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage3_bn2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "decoder_stage3_relu2"}}, {"name": "decoder_stage4_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage3_relu2", 0, 0, {}]]], "config": {"interpolation": "nearest", "name": "decoder_stage4_upsample", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"name": "decoder_stage4_conv1", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage4_upsample", 0, 0, {}]]], "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": 