{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["sigmoid", 0, 0]], "name": "link-resnet18", "layers": [{"name": "data", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "name": "data", "sparse": false}}, {"name": "bn_data", "inbound_nodes": [[["data", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": false, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "bn_data", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "zero_padding2d_1", "inbound_nodes": [[["bn_data", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "data_format": "channels_last", "trainable": true, "padding": [[3, 3], [3, 3]]}}, {"name": "conv0", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [7, 7], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "name": "conv0", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "bn0", "inbound_nodes": [[["conv0", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "bn0", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "relu0", "inbound_nodes": [[["bn0", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu0", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_2", "inbound_nodes": [[["relu0", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "pooling0", "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "trainable": true, "strides": [2, 2], "name": "pooling0", "data_format": "channels_last", "padding": "valid"}}, {"name": "stage1_unit1_bn1", "inbound_nodes": [[["pooling0", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "stage1_unit1_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "stage1_unit1_relu1", "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "stage1_unit1_relu1", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_3", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "stage1_unit1_conv1", "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "name": "stage1_unit1_conv1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "stage1_unit1_bn2", "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "stage1_unit1_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "stage1_unit1_relu2", "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "stage1_unit1_relu2", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_4", "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_4", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "stage1_unit1_conv2", "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "name": "stage1_unit1_conv2", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "stage1_unit1_sc", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "name": "stage1_unit1_sc", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "add_1", "inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_1", "trainable": true}}, {"name": "stage1_unit2_bn1", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "stage1_unit2_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "stage1_unit2_relu1", "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "stage1_unit2_relu1", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_5", "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_5", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "stage1_unit2_conv1", "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "name": "stage1_unit2_conv1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "stage1_unit2_bn2", "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "stage1_unit2_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "stage1_unit2_relu2", "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "stage1_unit2_relu2", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_6", "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_6", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "stage1_unit2_conv2", "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "name": "stage1_unit2_conv2", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "add_2", "inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_2", "trainable": true}}, {"name": "stage2_unit1_bn1", "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "stage2_unit1_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "stage2_unit1_relu1", "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "stage2_unit1_relu1", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_7", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_7", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "stage2_unit1_conv1", "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "name": "stage2_unit1_conv1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "stage2_unit1_bn2", "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "stage2_unit1_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "stage2_unit1_relu2", "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "stage2_unit1_relu2", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_8", "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_8", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "stage2_unit1_conv2", "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "name": "stage2_unit1_conv2", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "stage2_unit1_sc", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "name": "stage2_unit1_sc", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "add_3", "inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_3", "trainable": true}}, {"name": "stage2_unit2_bn1", "inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "stage2_unit2_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "stage2_unit2_relu1", "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "stage2_unit2_relu1", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_9", "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_9", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "stage2_unit2_conv1", "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "name": "stage2_unit2_conv1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "stage2_unit2_bn2", "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "stage2_unit2_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "stage2_unit2_relu2", "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "stage2_unit2_relu2", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_10", "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_10", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "stage2_unit2_conv2", "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "name": "stage2_unit2_conv2", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "add_4", "inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_3", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_4", "trainable": true}}, {"name": "stage3_unit1_bn1", "inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "stage3_unit1_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "stage3_unit1_relu1", "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "stage3_unit1_relu1", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_11", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_11", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "stage3_unit1_conv1", "inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 256, "kernel_regularizer": null, "trainable": true, "name": "stage3_unit1_conv1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "stage3_unit1_bn2", "inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "stage3_unit1_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "stage3_unit1_relu2", "inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "stage3_unit1_relu2", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_12", "inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_12", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "stage3_unit1_conv2", "inbound_nodes": [[["zero_padding2d_12", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 256, "kernel_regularizer": null, "trainable": true, "name": "stage3_unit1_conv2", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "stage3_unit1_sc", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 256, "kernel_regularizer": null, "trainable": true, "name": "stage3_unit1_sc", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "add_5", "inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_5", "trainable": true}}, {"name": "stage3_unit2_bn1", "inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "stage3_unit2_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "stage3_unit2_relu1", "inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "stage3_unit2_relu1", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_13", "inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_13", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "stage3_unit2_conv1", "inbound_nodes": [[["zero_padding2d_13", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 256, "kernel_regularizer": null, "trainable": true, "name": "stage3_unit2_conv1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "stage3_unit2_bn2", "inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "stage3_unit2_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "stage3_unit2_relu2", "inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "stage3_unit2_relu2", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_14", "inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_14", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "stage3_unit2_conv2", "inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 256, "kernel_regularizer": null, "trainable": true, "name": "stage3_unit2_conv2", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "add_6", "inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_5", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_6", "trainable": true}}, {"name": "stage4_unit1_bn1", "inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "stage4_unit1_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "stage4_unit1_relu1", "inbound_nodes": [[["stage4_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "stage4_unit1_relu1", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_15", "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_15", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "stage4_unit1_conv1", "inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 512, "kernel_regularizer": null, "trainable": true, "name": "stage4_unit1_conv1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "stage4_unit1_bn2", "inbound_nodes": [[["stage4_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "stage4_unit1_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "stage4_unit1_relu2", "inbound_nodes": [[["stage4_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "stage4_unit1_relu2", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_16", "inbound_nodes": [[["stage4_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_16", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "stage4_unit1_conv2", "inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 512, "kernel_regularizer": null, "trainable": true, "name": "stage4_unit1_conv2", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "stage4_unit1_sc", "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 512, "kernel_regularizer": null, "trainable": true, "name": "stage4_unit1_sc", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "add_7", "inbound_nodes": [[["stage4_unit1_conv2", 0, 0, {}], ["stage4_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_7", "trainable": true}}, {"name": "stage4_unit2_bn1", "inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "stage4_unit2_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "stage4_unit2_relu1", "inbound_nodes": [[["stage4_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "stage4_unit2_relu1", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_17", "inbound_nodes": [[["stage4_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_17", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "stage4_unit2_conv1", "inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 512, "kernel_regularizer": null, "trainable": true, "name": "stage4_unit2_conv1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "stage4_unit2_bn2", "inbound_nodes": [[["stage4_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "stage4_unit2_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "stage4_unit2_relu2", "inbound_nodes": [[["stage4_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "stage4_unit2_relu2", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_18", "inbound_nodes": [[["stage4_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_18", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "stage4_unit2_conv2", "inbound_nodes": [[["zero_padding2d_18", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "filters": 512, "kernel_regularizer": null, "trainable": true, "name": "stage4_unit2_conv2", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "add_8", "inbound_nodes": [[["stage4_unit2_conv2", 0, 0, {}], ["add_7", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_8", "trainable": true}}, {"name": "bn1", "inbound_nodes": [[["add_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": 3, "gamma_constraint": null, "epsilon": 2e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "relu1", "inbound_nodes": [[["bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu1", "trainable": true, "activation": "relu"}}, {"name": "decoder_stage0_conv1", "inbound_nodes": [[["relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "name": "decoder_stage0_conv1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "decoder_stage0_bn1", "inbound_nodes": [[["decoder_stage0_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "decoder_stage0_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "decoder_stage0_relu1", "inbound_nodes": [[["decoder_stage0_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "decoder_stage0_relu1", "trainable": true, "activation": "relu"}}, {"name": "decoder_stage0_upsample2", "inbound_nodes": [[["decoder_stage0_relu1", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "decoder_stage0_upsample2", "trainable": true, "interpolation": "nearest", "size": [2, 2], "data_format": "channels_last"}}, {"name": "decoder_stage0_conv2", "inbound_nodes": [[["decoder_stage0_upsample2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "name": "decoder_stage0_conv2", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "decoder_stage0_bn2", "inbound_nodes": [[["decoder_stage0_conv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "decoder_stage0_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "decoder_stage0_relu2", "inbound_nodes": [[["decoder_stage0_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "decoder_stage0_relu2", "trainable": true, "activation": "relu"}}, {"name": "decoder_stage0_conv3", "inbound_nodes": [[["decoder_stage0_relu2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "filters": 256, "kernel_regularizer": null, "trainable": true, "name": "decoder_stage0_conv3", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "decoder_stage0_bn3", "inbound_nodes": [[["decoder_stage0_conv3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "decoder_stage0_bn3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "decoder_stage0_relu3", "inbound_nodes": [[["decoder_stage0_bn3", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "decoder_stage0_relu3", "trainable": true, "activation": "relu"}}, {"name": "add_9", "inbound_nodes": [[["decoder_stage0_relu3", 0, 0, {}], ["stage4_unit1_relu1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_9", "trainable": true}}, {"name": "decoder_stage1_conv1", "inbound_nodes": [[["add_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "name": "decoder_stage1_conv1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "decoder_stage1_bn1", "inbound_nodes": [[["decoder_stage1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "decoder_stage1_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "decoder_stage1_relu1", "inbound_nodes": [[["decoder_stage1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "decoder_stage1_relu1", "trainable": true, "activation": "relu"}}, {"name": "decoder_stage1_upsample2", "inbound_nodes": [[["decoder_stage1_relu1", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "decoder_stage1_upsample2", "trainable": true, "interpolation": "nearest", "size": [2, 2], "data_format": "channels_last"}}, {"name": "decoder_stage1_conv2", "inbound_nodes": [[["decoder_stage1_upsample2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "name": "decoder_stage1_conv2", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "decoder_stage1_bn2", "inbound_nodes": [[["decoder_stage1_conv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "decoder_stage1_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "decoder_stage1_relu2", "inbound_nodes": [[["decoder_stage1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "decoder_stage1_relu2", "trainable": true, "activation": "relu"}}, {"name": "decoder_stage1_conv3", "inbound_nodes": [[["decoder_stage1_relu2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "name": "decoder_stage1_conv3", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "decoder_stage1_bn3", "inbound_nodes": [[["decoder_stage1_conv3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "decoder_stage1_bn3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "decoder_stage1_relu3", "inbound_nodes": [[["decoder_stage1_bn3", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "decoder_stage1_relu3", "trainable": true, "activation": "relu"}}, {"name": "add_10", "inbound_nodes": [[["decoder_stage1_relu3", 0, 0, {}], ["stage3_unit1_relu1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_10", "trainable": true}}, {"name": "decoder_stage2_conv1", "inbound_nodes": [[["add_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "filters": 32, "kernel_regularizer": null, "trainable": true, "name": "decoder_stage2_conv1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "decoder_stage2_bn1", "inbound_nodes": [[["decoder_stage2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "decoder_stage2_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "decoder_stage2_relu1", "inbound_nodes": [[["decoder_stage2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "decoder_stage2_relu1", "trainable": true, "activation": "relu"}}, {"name": "decoder_stage2_upsample2", "inbound_nodes": [[["decoder_stage2_relu1", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "decoder_stage2_upsample2", "trainable": true, "interpolation": "nearest", "size": [2, 2], "data_format": "channels_last"}}, {"name": "decoder_stage2_conv2", "inbound_nodes": [[["decoder_stage2_upsample2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "filters": 32, "kernel_regularizer": null, "trainable": true, "name": "decoder_stage2_conv2", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "decoder_stage2_bn2", "inbound_nodes": [[["decoder_stage2_conv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "decoder_stage2_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"name": "decoder_stage2_relu2", "inbound_nodes": [[["decoder_stage2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "decoder_stage2_relu2", "trainable": true, "activation": "relu"}}, {"name": "decoder_stage2_conv3", "inbound_nodes": [[["decoder_stage2_relu2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "bias_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "name": "decoder_stage2_conv3", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last"}}, {"name": "decoder_stage2_bn3", "inbound_nodes": [[["decoder_stage2_conv3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "scale": true, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "name": "decoder_stage2_bn3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, 