{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Model", "config": {"output_layers": [["sigmoid", 0, 0]], "input_layers": [["data", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "data"}, "name": "data"}, {"inbound_nodes": [[["data", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "bn_data", "scale": false, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "bn_data"}, {"inbound_nodes": [[["bn_data", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_1", "padding": [[3, 3], [3, 3]]}, "name": "zero_padding2d_1"}, {"inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 64, "name": "conv0", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [7, 7], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "conv0"}, {"inbound_nodes": [[["conv0", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "bn0", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "bn0"}, {"inbound_nodes": [[["bn0", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu0", "activation": "relu"}, "name": "relu0"}, {"inbound_nodes": [[["relu0", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_2", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_2"}, {"inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [3, 3], "name": "pooling0", "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "name": "pooling0"}, {"inbound_nodes": [[["pooling0", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "stage1_unit1_bn1", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "stage1_unit1_bn1"}, {"inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "stage1_unit1_relu1", "activation": "relu"}, "name": "stage1_unit1_relu1"}, {"inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_3", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_3"}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 64, "name": "stage1_unit1_conv1", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage1_unit1_conv1"}, {"inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "stage1_unit1_bn2", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "stage1_unit1_bn2"}, {"inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "stage1_unit1_relu2", "activation": "relu"}, "name": "stage1_unit1_relu2"}, {"inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_4", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_4"}, {"inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 64, "name": "stage1_unit1_conv2", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage1_unit1_conv2"}, {"inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 64, "name": "stage1_unit1_sc", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage1_unit1_sc"}, {"inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "name": "add_1"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "stage1_unit2_bn1", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "stage1_unit2_bn1"}, {"inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "stage1_unit2_relu1", "activation": "relu"}, "name": "stage1_unit2_relu1"}, {"inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_5", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_5"}, {"inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 64, "name": "stage1_unit2_conv1", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage1_unit2_conv1"}, {"inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "stage1_unit2_bn2", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "stage1_unit2_bn2"}, {"inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "stage1_unit2_relu2", "activation": "relu"}, "name": "stage1_unit2_relu2"}, {"inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_6", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_6"}, {"inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 64, "name": "stage1_unit2_conv2", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage1_unit2_conv2"}, {"inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_1", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "name": "add_2"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "stage2_unit1_bn1", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "stage2_unit1_bn1"}, {"inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "stage2_unit1_relu1", "activation": "relu"}, "name": "stage2_unit1_relu1"}, {"inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_7", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_7"}, {"inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 128, "name": "stage2_unit1_conv1", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage2_unit1_conv1"}, {"inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "stage2_unit1_bn2", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "stage2_unit1_bn2"}, {"inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "stage2_unit1_relu2", "activation": "relu"}, "name": "stage2_unit1_relu2"}, {"inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_8", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_8"}, {"inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 128, "name": "stage2_unit1_conv2", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage2_unit1_conv2"}, {"inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 128, "name": "stage2_unit1_sc", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage2_unit1_sc"}, {"inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "name": "add_3"}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "stage2_unit2_bn1", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "stage2_unit2_bn1"}, {"inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "stage2_unit2_relu1", "activation": "relu"}, "name": "stage2_unit2_relu1"}, {"inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_9", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_9"}, {"inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 128, "name": "stage2_unit2_conv1", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage2_unit2_conv1"}, {"inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "stage2_unit2_bn2", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "stage2_unit2_bn2"}, {"inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "stage2_unit2_relu2", "activation": "relu"}, "name": "stage2_unit2_relu2"}, {"inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_10", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_10"}, {"inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 128, "name": "stage2_unit2_conv2", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage2_unit2_conv2"}, {"inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_3", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "name": "add_4"}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "stage3_unit1_bn1", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "stage3_unit1_bn1"}, {"inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "stage3_unit1_relu1", "activation": "relu"}, "name": "stage3_unit1_relu1"}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_11", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_11"}, {"inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 256, "name": "stage3_unit1_conv1", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage3_unit1_conv1"}, {"inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "stage3_unit1_bn2", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "stage3_unit1_bn2"}, {"inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "stage3_unit1_relu2", "activation": "relu"}, "name": "stage3_unit1_relu2"}, {"inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_12", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_12"}, {"inbound_nodes": [[["zero_padding2d_12", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 256, "name": "stage3_unit1_conv2", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage3_unit1_conv2"}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 256, "name": "stage3_unit1_sc", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage3_unit1_sc"}, {"inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "name": "add_5"}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "stage3_unit2_bn1", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "stage3_unit2_bn1"}, {"inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "stage3_unit2_relu1", "activation": "relu"}, "name": "stage3_unit2_relu1"}, {"inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_13", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_13"}, {"inbound_nodes": [[["zero_padding2d_13", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 256, "name": "stage3_unit2_conv1", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage3_unit2_conv1"}, {"inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "stage3_unit2_bn2", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "stage3_unit2_bn2"}, {"inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "stage3_unit2_relu2", "activation": "relu"}, "name": "stage3_unit2_relu2"}, {"inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_14", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_14"}, {"inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 256, "name": "stage3_unit2_conv2", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage3_unit2_conv2"}, {"inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_5", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "name": "add_6"}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "stage4_unit1_bn1", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "stage4_unit1_bn1"}, {"inbound_nodes": [[["stage4_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "stage4_unit1_relu1", "activation": "relu"}, "name": "stage4_unit1_relu1"}, {"inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_15", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_15"}, {"inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 512, "name": "stage4_unit1_conv1", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage4_unit1_conv1"}, {"inbound_nodes": [[["stage4_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "stage4_unit1_bn2", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "stage4_unit1_bn2"}, {"inbound_nodes": [[["stage4_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "stage4_unit1_relu2", "activation": "relu"}, "name": "stage4_unit1_relu2"}, {"inbound_nodes": [[["stage4_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_16", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_16"}, {"inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 512, "name": "stage4_unit1_conv2", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage4_unit1_conv2"}, {"inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 512, "name": "stage4_unit1_sc", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage4_unit1_sc"}, {"inbound_nodes": [[["stage4_unit1_conv2", 0, 0, {}], ["stage4_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_7"}, "name": "add_7"}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "stage4_unit2_bn1", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "stage4_unit2_bn1"}, {"inbound_nodes": [[["stage4_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "stage4_unit2_relu1", "activation": "relu"}, "name": "stage4_unit2_relu1"}, {"inbound_nodes": [[["stage4_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_17", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_17"}, {"inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 512, "name": "stage4_unit2_conv1", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage4_unit2_conv1"}, {"inbound_nodes": [[["stage4_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "stage4_unit2_bn2", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "stage4_unit2_bn2"}, {"inbound_nodes": [[["stage4_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "stage4_unit2_relu2", "activation": "relu"}, "name": "stage4_unit2_relu2"}, {"inbound_nodes": [[["stage4_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_18", "padding": [[1, 1], [1, 1]]}, "name": "zero_padding2d_18"}, {"inbound_nodes": [[["zero_padding2d_18", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 512, "name": "stage4_unit2_conv2", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 2.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "stage4_unit2_conv2"}, {"inbound_nodes": [[["stage4_unit2_conv2", 0, 0, {}], ["add_7", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_8"}, "name": "add_8"}, {"inbound_nodes": [[["add_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 2e-05, "axis": 3, "name": "bn1", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "bn1"}, {"inbound_nodes": [[["bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu1", "activation": "relu"}, "name": "relu1"}, {"inbound_nodes": [[["relu1", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "interpolation": "nearest", "size": [2, 2], "name": "decoder_stage0_upsample"}, "name": "decoder_stage0_upsample"}, {"inbound_nodes": [[["decoder_stage0_upsample", 0, 0, {}], ["stage4_unit1_relu1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "name": "concatenate_1"}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 256, "name": "decoder_stage0_conv1", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "decoder_stage0_conv1"}, {"inbound_nodes": [[["decoder_stage0_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 0.001, "axis": -1, "name": "decoder_stage0_bn1", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "decoder_stage0_bn1"}, {"inbound_nodes": [[["decoder_stage0_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage0_relu1", "activation": "relu"}, "name": "decoder_stage0_relu1"}, {"inbound_nodes": [[["decoder_stage0_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 256, "name": "decoder_stage0_conv2", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "decoder_stage0_conv2"}, {"inbound_nodes": [[["decoder_stage0_conv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 0.001, "axis": -1, "name": "decoder_stage0_bn2", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "decoder_stage0_bn2"}, {"inbound_nodes": [[["decoder_stage0_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage0_relu2", "activation": "relu"}, "name": "decoder_stage0_relu2"}, {"inbound_nodes": [[["decoder_stage0_relu2", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "interpolation": "nearest", "size": [2, 2], "name": "decoder_stage1_upsample"}, "name": "decoder_stage1_upsample"}, {"inbound_nodes": [[["decoder_stage1_upsample", 0, 0, {}], ["stage3_unit1_relu1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_2"}, "name": "concatenate_2"}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 128, "name": "decoder_stage1_conv1", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "decoder_stage1_conv1"}, {"inbound_nodes": [[["decoder_stage1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 0.001, "axis": -1, "name": "decoder_stage1_bn1", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "decoder_stage1_bn1"}, {"inbound_nodes": [[["decoder_stage1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage1_relu1", "activation": "relu"}, "name": "decoder_stage1_relu1"}, {"inbound_nodes": [[["decoder_stage1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 128, "name": "decoder_stage1_conv2", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "decoder_stage1_conv2"}, {"inbound_nodes": [[["decoder_stage1_conv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 0.001, "axis": -1, "name": "decoder_stage1_bn2", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "decoder_stage1_bn2"}, {"inbound_nodes": [[["decoder_stage1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage1_relu2", "activation": "relu"}, "name": "decoder_stage1_relu2"}, {"inbound_nodes": [[["decoder_stage1_relu2", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "interpolation": "nearest", "size": [2, 2], "name": "decoder_stage2_upsample"}, "name": "decoder_stage2_upsample"}, {"inbound_nodes": [[["decoder_stage2_upsample", 0, 0, {}], ["stage2_unit1_relu1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_3"}, "name": "concatenate_3"}, {"inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 64, "name": "decoder_stage2_conv1", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "decoder_stage2_conv1"}, {"inbound_nodes": [[["decoder_stage2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 0.001, "axis": -1, "name": "decoder_stage2_bn1", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "decoder_stage2_bn1"}, {"inbound_nodes": [[["decoder_stage2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage2_relu1", "activation": "relu"}, "name": "decoder_stage2_relu1"}, {"inbound_nodes": [[["decoder_stage2_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 64, "name": "decoder_stage2_conv2", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "decoder_stage2_conv2"}, {"inbound_nodes": [[["decoder_stage2_conv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 0.001, "axis": -1, "name": "decoder_stage2_bn2", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "decoder_stage2_bn2"}, {"inbound_nodes": [[["decoder_stage2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage2_relu2", "activation": "relu"}, "name": "decoder_stage2_relu2"}, {"inbound_nodes": [[["decoder_stage2_relu2", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "interpolation": "nearest", "size": [2, 2], "name": "decoder_stage3_upsample"}, "name": "decoder_stage3_upsample"}, {"inbound_nodes": [[["decoder_stage3_upsample", 0, 0, {}], ["relu0", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_4"}, "name": "concatenate_4"}, {"inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 32, "name": "decoder_stage3_conv1", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "decoder_stage3_conv1"}, {"inbound_nodes": [[["decoder_stage3_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 0.001, "axis": -1, "name": "decoder_stage3_bn1", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "decoder_stage3_bn1"}, {"inbound_nodes": [[["decoder_stage3_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage3_relu1", "activation": "relu"}, "name": "decoder_stage3_relu1"}, {"inbound_nodes": [[["decoder_stage3_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 32, "name": "decoder_stage3_conv2", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last"}, "name": "decoder_stage3_conv2"}, {"inbound_nodes": [[["decoder_stage3_conv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "epsilon": 0.001, "axis": -1, "name": "decoder_stage3_bn2", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}, "name": "decoder_stage3_bn2"}, {"inbound_nodes": [[["decoder_stage3_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage3_relu2", "activation": "relu"}, "name": "decoder_stage3_relu2"}, {"inbound_nodes": [[["decoder_stage3_relu2", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "interpolation": "nearest", "size": [2, 2], "name": "decoder_stage4_upsample"}, "name": "decoder_stage4_upsample"}, {"inbound_nodes": [[["decoder_stage4_upsample", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "filters": 16, "name": "decoder_stage4_conv1", "activation": "linear", "bias_constraint": null, "use_bias": false, "padding": "same", 