{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "data", "config": {"dtype": "float32", "batch_input_shape": [null, null, null, 3], "name": "data", "sparse": false}, "inbound_nodes": []}, {"class_name": "BatchNormalization", "name": "bn_data", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "name": "bn_data", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["data", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_55", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_55", "padding": [[3, 3], [3, 3]]}, "inbound_nodes": [[["bn_data", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv0", "config": {"trainable": true, "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [2, 2], "kernel_size": [7, 7], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "conv0", "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_55", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn0", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "bn0", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"class_name": "Activation", "name": "relu0", "config": {"trainable": true, "name": "relu0", "activation": "relu"}, "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_56", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_56", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["relu0", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "pooling0", "config": {"trainable": true, "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2], "name": "pooling0", "padding": "valid"}, "inbound_nodes": [[["zero_padding2d_56", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage1_unit1_bn1", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "stage1_unit1_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["pooling0", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage1_unit1_relu1", "config": {"trainable": true, "name": "stage1_unit1_relu1", "activation": "relu"}, "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_57", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_57", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage1_unit1_conv1", "config": {"trainable": true, "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage1_unit1_conv1", "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_57", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage1_unit1_bn2", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "stage1_unit1_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage1_unit1_relu2", "config": {"trainable": true, "name": "stage1_unit1_relu2", "activation": "relu"}, "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_58", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_58", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage1_unit1_conv2", "config": {"trainable": true, "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage1_unit1_conv2", "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_58", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage1_unit1_sc", "config": {"trainable": true, "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage1_unit1_sc", "bias_constraint": null}, "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_25", "config": {"trainable": true, "name": "add_25"}, "inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage1_unit2_bn1", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "stage1_unit2_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["add_25", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage1_unit2_relu1", "config": {"trainable": true, "name": "stage1_unit2_relu1", "activation": "relu"}, "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_59", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_59", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage1_unit2_conv1", "config": {"trainable": true, "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage1_unit2_conv1", "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_59", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage1_unit2_bn2", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "stage1_unit2_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage1_unit2_relu2", "config": {"trainable": true, "name": "stage1_unit2_relu2", "activation": "relu"}, "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_60", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_60", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage1_unit2_conv2", "config": {"trainable": true, "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage1_unit2_conv2", "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_60", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_26", "config": {"trainable": true, "name": "add_26"}, "inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage2_unit1_bn1", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "stage2_unit1_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["add_26", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage2_unit1_relu1", "config": {"trainable": true, "name": "stage2_unit1_relu1", "activation": "relu"}, "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_61", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_61", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage2_unit1_conv1", "config": {"trainable": true, "filters": 128, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [2, 2], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage2_unit1_conv1", "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_61", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage2_unit1_bn2", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "stage2_unit1_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage2_unit1_relu2", "config": {"trainable": true, "name": "stage2_unit1_relu2", "activation": "relu"}, "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_62", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_62", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage2_unit1_conv2", "config": {"trainable": true, "filters": 128, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage2_unit1_conv2", "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_62", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage2_unit1_sc", "config": {"trainable": true, "filters": 128, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [2, 2], "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage2_unit1_sc", "bias_constraint": null}, "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_27", "config": {"trainable": true, "name": "add_27"}, "inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage2_unit2_bn1", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "stage2_unit2_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["add_27", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage2_unit2_relu1", "config": {"trainable": true, "name": "stage2_unit2_relu1", "activation": "relu"}, "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_63", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_63", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage2_unit2_conv1", "config": {"trainable": true, "filters": 128, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage2_unit2_conv1", "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_63", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage2_unit2_bn2", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "stage2_unit2_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage2_unit2_relu2", "config": {"trainable": true, "name": "stage2_unit2_relu2", "activation": "relu"}, "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_64", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_64", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage2_unit2_conv2", "config": {"trainable": true, "filters": 128, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage2_unit2_conv2", "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_64", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_28", "config": {"trainable": true, "name": "add_28"}, "inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage3_unit1_bn1", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "stage3_unit1_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["add_28", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage3_unit1_relu1", "config": {"trainable": true, "name": "stage3_unit1_relu1", "activation": "relu"}, "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_65", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_65", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage3_unit1_conv1", "config": {"trainable": true, "filters": 256, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [2, 2], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage3_unit1_conv1", "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_65", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage3_unit1_bn2", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "stage3_unit1_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage3_unit1_relu2", "config": {"trainable": true, "name": "stage3_unit1_relu2", "activation": "relu"}, "inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_66", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_66", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage3_unit1_conv2", "config": {"trainable": true, "filters": 256, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage3_unit1_conv2", "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_66", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage3_unit1_sc", "config": {"trainable": true, "filters": 256, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [2, 2], "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage3_unit1_sc", "bias_constraint": null}, "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_29", "config": {"trainable": true, "name": "add_29"}, "inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage3_unit2_bn1", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "stage3_unit2_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["add_29", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage3_unit2_relu1", "config": {"trainable": true, "name": "stage3_unit2_relu1", "activation": "relu"}, "inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_67", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_67", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage3_unit2_conv1", "config": {"trainable": true, "filters": 256, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage3_unit2_conv1", "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_67", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage3_unit2_bn2", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "stage3_unit2_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage3_unit2_relu2", "config": {"trainable": true, "name": "stage3_unit2_relu2", "activation": "relu"}, "inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_68", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_68", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage3_unit2_conv2", "config": {"trainable": true, "filters": 256, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage3_unit2_conv2", "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_68", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_30", "config": {"trainable": true, "name": "add_30"}, "inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage4_unit1_bn1", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "stage4_unit1_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["add_30", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage4_unit1_relu1", "config": {"trainable": true, "name": "stage4_unit1_relu1", "activation": "relu"}, "inbound_nodes": [[["stage4_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_69", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_69", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage4_unit1_conv1", "config": {"trainable": true, "filters": 512, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [2, 2], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage4_unit1_conv1", "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_69", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage4_unit1_bn2", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "stage4_unit1_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["stage4_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage4_unit1_relu2", "config": {"trainable": true, "name": "stage4_unit1_relu2", "activation": "relu"}, "inbound_nodes": [[["stage4_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_70", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_70", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage4_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage4_unit1_conv2", "config": {"trainable": true, "filters": 512, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage4_unit1_conv2", "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_70", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage4_unit1_sc", "config": {"trainable": true, "filters": 512, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [2, 2], "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage4_unit1_sc", "bias_constraint": null}, "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_31", "config": {"trainable": true, "name": "add_31"}, "inbound_nodes": [[["stage4_unit1_conv2", 0, 0, {}], ["stage4_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage4_unit2_bn1", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "stage4_unit2_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["add_31", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage4_unit2_relu1", "config": {"trainable": true, "name": "stage4_unit2_relu1", "activation": "relu"}, "inbound_nodes": [[["stage4_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_71", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_71", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage4_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage4_unit2_conv1", "config": {"trainable": true, "filters": 512, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage4_unit2_conv1", "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_71", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage4_unit2_bn2", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "stage4_unit2_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["stage4_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage4_unit2_relu2", "config": {"trainable": true, "name": "stage4_unit2_relu2", "activation": "relu"}, "inbound_nodes": [[["stage4_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_72", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_72", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage4_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage4_unit2_conv2", "config": {"trainable": true, "filters": 512, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "stage4_unit2_conv2", "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_72", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_32", "config": {"trainable": true, "name": "add_32"}, "inbound_nodes": [[["stage4_unit2_conv2", 0, 0, {}], ["add_31", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn1", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 2e-05, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["add_32", 0, 0, {}]]]}, {"class_name": "Activation", "name": "relu1", "config": {"trainable": true, "name": "relu1", "activation": "relu"}, "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "decoder_stage0_upsample", "config": {"trainable": true, "interpolation": "nearest", "data_format": "channels_last", "name": "decoder_stage0_upsample", "size": [2, 2]}, "inbound_nodes": [[["relu1", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_13", "config": {"trainable": true, "axis": -1, "name": "concatenate_13"}, "inbound_nodes": [[["decoder_stage0_upsample", 0, 0, {}], ["stage4_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage0_conv1", "config": {"trainable": true, "filters": 256, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "decoder_stage0_conv1", "bias_constraint": null}, "inbound_nodes": [[["concatenate_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "decoder_stage0_bn1", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "decoder_stage0_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["decoder_stage0_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "decoder_stage0_relu1", "config": {"trainable": true, "name": "decoder_stage0_relu1", "activation": "relu"}, "inbound_nodes": [[["decoder_stage0_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage0_conv2", "config": {"trainable": true, "filters": 256, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "decoder_stage0_conv2", "bias_constraint": null}, "inbound_nodes": [[["decoder_stage0_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "decoder_stage0_bn2", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "decoder_stage0_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["decoder_stage0_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "decoder_stage0_relu2", "config": {"trainable": true, "name": "decoder_stage0_relu2", "activation": "relu"}, "inbound_nodes": [[["decoder_stage0_bn2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "decoder_stage1_upsample", "config": {"trainable": true, "interpolation": "nearest", "data_format": "channels_last", "name": "decoder_stage1_upsample", "size": [2, 2]}, "inbound_nodes": [[["decoder_stage0_relu2", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_14", "config": {"trainable": true, "axis": -1, "name": "concatenate_14"}, "inbound_nodes": [[["decoder_stage1_upsample", 0, 0, {}], ["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage1_conv1", "config": {"trainable": true, "filters": 128, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "decoder_stage1_conv1", "bias_constraint": null}, "inbound_nodes": [[["concatenate_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "decoder_stage1_bn1", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "decoder_stage1_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["decoder_stage1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "decoder_stage1_relu1", "config": {"trainable": true, "name": "decoder_stage1_relu1", "activation": "relu"}, "inbound_nodes": [[["decoder_stage1_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage1_conv2", "config": {"trainable": true, "filters": 128, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "decoder_stage1_conv2", "bias_constraint": null}, "inbound_nodes": [[["decoder_stage1_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "decoder_stage1_bn2", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "decoder_stage1_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["decoder_stage1_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "decoder_stage1_relu2", "config": {"trainable": true, "name": "decoder_stage1_relu2", "activation": "relu"}, "inbound_nodes": [[["decoder_stage1_bn2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "decoder_stage2_upsample", "config": {"trainable": true, "interpolation": "nearest", "data_format": "channels_last", "name": "decoder_stage2_upsample", "size": [2, 2]}, "inbound_nodes": [[["decoder_stage1_relu2", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_15", "config": {"trainable": true, "axis": -1, "name": "concatenate_15"}, "inbound_nodes": [[["decoder_stage2_upsample", 0, 0, {}], ["stage2_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage2_conv1", "config": {"trainable": true, "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "decoder_stage2_conv1", "bias_constraint": null}, "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "decoder_stage2_bn1", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "decoder_stage2_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["decoder_stage2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "decoder_stage2_relu1", "config": {"trainable": true, "name": "decoder_stage2_relu1", "activation": "relu"}, "inbound_nodes": [[["decoder_stage2_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage2_conv2", "config": {"trainable": true, "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "decoder_stage2_conv2", "bias_constraint": null}, "inbound_nodes": [[["decoder_stage2_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "decoder_stage2_bn2", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "decoder_stage2_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["decoder_stage2_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "decoder_stage2_relu2", "config": {"trainable": true, "name": "decoder_stage2_relu2", "activation": "relu"}, "inbound_nodes": [[["decoder_stage2_bn2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "decoder_stage3_upsample", "config": {"trainable": true, "interpolation": "nearest", "data_format": "channels_last", "name": "decoder_stage3_upsample", "size": [2, 2]}, "inbound_nodes": [[["decoder_stage2_relu2", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_16", "config": {"trainable": true, "axis": -1, "name": "concatenate_16"}, "inbound_nodes": [[["decoder_stage3_upsample", 0, 0, {}], ["relu0", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage3_conv1", "config": {"trainable": true, "filters": 32, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "decoder_stage3_conv1", "bias_constraint": null}, "inbound_nodes": [[["concatenate_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "decoder_stage3_bn1", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "decoder_stage3_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["decoder_stage3_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "decoder_stage3_relu1", "config": {"trainable": true, "name": "decoder_stage3_relu1", "activation": "relu"}, "inbound_nodes": [[["decoder_stage3_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage3_conv2", "config": {"trainable": true, "filters": 32, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": false, "name": "decoder_stage3_conv2", "bias_constraint": null}, "inbound_nodes": [[["decoder_stage3_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "decoder_stage3_bn2", "config": {"trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "gamma_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "decoder_stage3_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["decoder_stage3_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "decoder_stage3_relu2", "config": {"trainable": true, "name": "decoder_stage3_relu2", "activation": "relu"}, "inbound_nodes": [[["decoder_stage3_bn2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "decoder_stage4_upsample", "config": {"trainable": true, "interpolation": "nearest", "data_format": "channels_last", "name": "decoder_stage4_upsample", "size": [2, 2]}, "inbound_nodes": [[["decoder_stage3_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage4_conv1", "config": {"trainable": true, "filters": 16, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "kernel_size": [3, 