{"keras_version": "2.2.4", "class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["sigmoid", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "data", "config": {"sparse": false, "batch_input_shape": [null, null, null, 3], "dtype": "float32", "name": "data"}, "inbound_nodes": []}, {"class_name": "BatchNormalization", "name": "bn_data", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_data", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": false}, "inbound_nodes": [[["data", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_1", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_1", "padding": [[3, 3], [3, 3]]}, "inbound_nodes": [[["bn_data", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv0", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "conv0", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [7, 7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [2, 2], "filters": 64, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn0", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn0", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"class_name": "Activation", "name": "relu0", "config": {"trainable": true, "name": "relu0", "activation": "relu"}, "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_2", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_2", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["relu0", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "pooling0", "config": {"strides": [2, 2], "name": "pooling0", "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage1_unit1_bn1", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage1_unit1_bn1", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["pooling0", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage1_unit1_relu1", "config": {"trainable": true, "name": "stage1_unit1_relu1", "activation": "relu"}, "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_3", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_3", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage1_unit1_conv1", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage1_unit1_conv1", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 64, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage1_unit1_bn2", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage1_unit1_bn2", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage1_unit1_relu2", "config": {"trainable": true, "name": "stage1_unit1_relu2", "activation": "relu"}, "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_4", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_4", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage1_unit1_conv2", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage1_unit1_conv2", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 64, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage1_unit1_sc", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage1_unit1_sc", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 64, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage1_unit2_bn1", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage1_unit2_bn1", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage1_unit2_relu1", "config": {"trainable": true, "name": "stage1_unit2_relu1", "activation": "relu"}, "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_5", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_5", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage1_unit2_conv1", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage1_unit2_conv1", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 64, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage1_unit2_bn2", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage1_unit2_bn2", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage1_unit2_relu2", "config": {"trainable": true, "name": "stage1_unit2_relu2", "activation": "relu"}, "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_6", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_6", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage1_unit2_conv2", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage1_unit2_conv2", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 64, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage2_unit1_bn1", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_unit1_bn1", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage2_unit1_relu1", "config": {"trainable": true, "name": "stage2_unit1_relu1", "activation": "relu"}, "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_7", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_7", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage2_unit1_conv1", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage2_unit1_conv1", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [2, 2], "filters": 128, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage2_unit1_bn2", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_unit1_bn2", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage2_unit1_relu2", "config": {"trainable": true, "name": "stage2_unit1_relu2", "activation": "relu"}, "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_8", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_8", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage2_unit1_conv2", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage2_unit1_conv2", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 128, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage2_unit1_sc", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage2_unit1_sc", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [2, 2], "filters": 128, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage2_unit2_bn1", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_unit2_bn1", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage2_unit2_relu1", "config": {"trainable": true, "name": "stage2_unit2_relu1", "activation": "relu"}, "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_9", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_9", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage2_unit2_conv1", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage2_unit2_conv1", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 128, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage2_unit2_bn2", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_unit2_bn2", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage2_unit2_relu2", "config": {"trainable": true, "name": "stage2_unit2_relu2", "activation": "relu"}, "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_10", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_10", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage2_unit2_conv2", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage2_unit2_conv2", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 128, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage3_unit1_bn1", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage3_unit1_bn1", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage3_unit1_relu1", "config": {"trainable": true, "name": "stage3_unit1_relu1", "activation": "relu"}, "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_11", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_11", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage3_unit1_conv1", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage3_unit1_conv1", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [2, 2], "filters": 256, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage3_unit1_bn2", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage3_unit1_bn2", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage3_unit1_relu2", "config": {"trainable": true, "name": "stage3_unit1_relu2", "activation": "relu"}, "inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_12", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_12", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage3_unit1_conv2", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage3_unit1_conv2", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 256, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["zero_padding2d_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage3_unit1_sc", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage3_unit1_sc", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [2, 2], "filters": 256, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_5", "config": {"trainable": true, "name": "add_5"}, "inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage3_unit2_bn1", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage3_unit2_bn1", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage3_unit2_relu1", "config": {"trainable": true, "name": "stage3_unit2_relu1", "activation": "relu"}, "inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_13", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_13", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage3_unit2_conv1", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage3_unit2_conv1", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 256, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["zero_padding2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage3_unit2_bn2", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage3_unit2_bn2", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage3_unit2_relu2", "config": {"trainable": true, "name": "stage3_unit2_relu2", "activation": "relu"}, "inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_14", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_14", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage3_unit2_conv2", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage3_unit2_conv2", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 256, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_6", "config": {"trainable": true, "name": "add_6"}, "inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage4_unit1_bn1", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage4_unit1_bn1", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage4_unit1_relu1", "config": {"trainable": true, "name": "stage4_unit1_relu1", "activation": "relu"}, "inbound_nodes": [[["stage4_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_15", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_15", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage4_unit1_conv1", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage4_unit1_conv1", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [2, 2], "filters": 512, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage4_unit1_bn2", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage4_unit1_bn2", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["stage4_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage4_unit1_relu2", "config": {"trainable": true, "name": "stage4_unit1_relu2", "activation": "relu"}, "inbound_nodes": [[["stage4_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_16", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_16", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage4_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage4_unit1_conv2", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage4_unit1_conv2", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 512, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage4_unit1_sc", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage4_unit1_sc", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [2, 2], "filters": 512, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_7", "config": {"trainable": true, "name": "add_7"}, "inbound_nodes": [[["stage4_unit1_conv2", 0, 0, {}], ["stage4_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage4_unit2_bn1", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage4_unit2_bn1", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage4_unit2_relu1", "config": {"trainable": true, "name": "stage4_unit2_relu1", "activation": "relu"}, "inbound_nodes": [[["stage4_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_17", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_17", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage4_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage4_unit2_conv1", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage4_unit2_conv1", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 512, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "stage4_unit2_bn2", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage4_unit2_bn2", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["stage4_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "stage4_unit2_relu2", "config": {"trainable": true, "name": "stage4_unit2_relu2", "activation": "relu"}, "inbound_nodes": [[["stage4_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_18", "config": {"trainable": true, "data_format": "channels_last", "name": "zero_padding2d_18", "padding": [[1, 1], [1, 1]]}, "inbound_nodes": [[["stage4_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "stage4_unit2_conv2", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "stage4_unit2_conv2", "padding": "valid", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 512, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["zero_padding2d_18", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_8", "config": {"trainable": true, "name": "add_8"}, "inbound_nodes": [[["stage4_unit2_conv2", 0, 0, {}], ["add_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn1", "config": {"epsilon": 2e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn1", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Activation", "name": "relu1", "config": {"trainable": true, "name": "relu1", "activation": "relu"}, "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "decoder_stage0_upsample", "config": {"interpolation": "nearest", "trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "decoder_stage0_upsample"}, "inbound_nodes": [[["relu1", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "inbound_nodes": [[["decoder_stage0_upsample", 0, 0, {}], ["stage4_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage0_conv1", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "decoder_stage0_conv1", "padding": "same", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 256, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "decoder_stage0_bn1", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage0_bn1", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["decoder_stage0_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "decoder_stage0_relu1", "config": {"trainable": true, "name": "decoder_stage0_relu1", "activation": "relu"}, "inbound_nodes": [[["decoder_stage0_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage0_conv2", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "decoder_stage0_conv2", "padding": "same", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 256, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["decoder_stage0_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "decoder_stage0_bn2", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage0_bn2", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["decoder_stage0_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "decoder_stage0_relu2", "config": {"trainable": true, "name": "decoder_stage0_relu2", "activation": "relu"}, "inbound_nodes": [[["decoder_stage0_bn2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "decoder_stage1_upsample", "config": {"interpolation": "nearest", "trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "decoder_stage1_upsample"}, "inbound_nodes": [[["decoder_stage0_relu2", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_2", "config": {"trainable": true, "axis": -1, "name": "concatenate_2"}, "inbound_nodes": [[["decoder_stage1_upsample", 0, 0, {}], ["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage1_conv1", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "decoder_stage1_conv1", "padding": "same", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 128, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "decoder_stage1_bn1", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage1_bn1", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["decoder_stage1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "decoder_stage1_relu1", "config": {"trainable": true, "name": "decoder_stage1_relu1", "activation": "relu"}, "inbound_nodes": [[["decoder_stage1_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage1_conv2", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "decoder_stage1_conv2", "padding": "same", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 128, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["decoder_stage1_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "decoder_stage1_bn2", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage1_bn2", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["decoder_stage1_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "decoder_stage1_relu2", "config": {"trainable": true, "name": "decoder_stage1_relu2", "activation": "relu"}, "inbound_nodes": [[["decoder_stage1_bn2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "decoder_stage2_upsample", "config": {"interpolation": "nearest", "trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "decoder_stage2_upsample"}, "inbound_nodes": [[["decoder_stage1_relu2", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_3", "config": {"trainable": true, "axis": -1, "name": "concatenate_3"}, "inbound_nodes": [[["decoder_stage2_upsample", 0, 0, {}], ["stage2_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage2_conv1", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "decoder_stage2_conv1", "padding": "same", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 64, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "decoder_stage2_bn1", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage2_bn1", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["decoder_stage2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "decoder_stage2_relu1", "config": {"trainable": true, "name": "decoder_stage2_relu1", "activation": "relu"}, "inbound_nodes": [[["decoder_stage2_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage2_conv2", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "decoder_stage2_conv2", "padding": "same", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 64, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["decoder_stage2_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "decoder_stage2_bn2", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage2_bn2", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["decoder_stage2_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "decoder_stage2_relu2", "config": {"trainable": true, "name": "decoder_stage2_relu2", "activation": "relu"}, "inbound_nodes": [[["decoder_stage2_bn2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "decoder_stage3_upsample", "config": {"interpolation": "nearest", "trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "decoder_stage3_upsample"}, "inbound_nodes": [[["decoder_stage2_relu2", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_4", "config": {"trainable": true, "axis": -1, "name": "concatenate_4"}, "inbound_nodes": [[["decoder_stage3_upsample", 0, 0, {}], ["relu0", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage3_conv1", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "decoder_stage3_conv1", "padding": "same", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 32, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "decoder_stage3_bn1", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage3_bn1", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["decoder_stage3_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "decoder_stage3_relu1", "config": {"trainable": true, "name": "decoder_stage3_relu1", "activation": "relu"}, "inbound_nodes": [[["decoder_stage3_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage3_conv2", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "decoder_stage3_conv2", "padding": "same", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "strides": [1, 1], "filters": 32, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "use_bias": false}, "inbound_nodes": [[["decoder_stage3_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "decoder_stage3_bn2", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage3_bn2", "beta_regularizer": null, "center": true, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true}, "inbound_nodes": [[["decoder_stage3_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "decoder_stage3_relu2", "config": {"trainable": true, "name": "decoder_stage3_relu2", "activation": "relu"}, "inbound_nodes": [[["decoder_stage3_bn2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "decoder_stage4_upsample", "config": {"interpolation": "nearest", "trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "decoder_stage4_upsample"}, "inbound_nodes": [[["decoder_stage3_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "decoder_stage4_conv1", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "decoder_stage4_conv1", "padding": "same", "activation": "linear", 