{"keras_version": "2.2.4", "config": {"name": "u-resnet18", "input_layers": [["data", 0, 0]], "layers": [{"name": "data", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, null, null, 3], "sparse": false, "dtype": "float32", "name": "data"}}, {"name": "bn_data", "class_name": "BatchNormalization", "inbound_nodes": [[["data", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn_data", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "inbound_nodes": [[["bn_data", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_1", "data_format": "channels_last", "padding": [[3, 3], [3, 3]]}}, {"name": "conv0", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "conv0", "use_bias": false, "strides": [2, 2], "kernel_size": [7, 7], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 64}}, {"name": "bn0", "class_name": "BatchNormalization", "inbound_nodes": [[["conv0", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn0", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "relu0", "class_name": "Activation", "inbound_nodes": [[["bn0", 0, 0, {}]]], "config": {"name": "relu0", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_2", "class_name": "ZeroPadding2D", "inbound_nodes": [[["relu0", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_2", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "pooling0", "class_name": "MaxPooling2D", "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]], "config": {"padding": "valid", "trainable": true, "pool_size": [3, 3], "strides": [2, 2], "data_format": "channels_last", "name": "pooling0"}}, {"name": "stage1_unit1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["pooling0", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage1_unit1_bn1", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "stage1_unit1_relu1", "class_name": "Activation", "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]], "config": {"name": "stage1_unit1_relu1", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_3", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_3", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage1_unit1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage1_unit1_conv1", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 64}}, {"name": "stage1_unit1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage1_unit1_bn2", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "stage1_unit1_relu2", "class_name": "Activation", "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]], "config": {"name": "stage1_unit1_relu2", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_4", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_4", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage1_unit1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage1_unit1_conv2", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 64}}, {"name": "stage1_unit1_sc", "class_name": "Conv2D", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage1_unit1_sc", "use_bias": false, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 64}}, {"name": "add_1", "class_name": "Add", "inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}}, {"name": "stage1_unit2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage1_unit2_bn1", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "stage1_unit2_relu1", "class_name": "Activation", "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]], "config": {"name": "stage1_unit2_relu1", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_5", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_5", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage1_unit2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage1_unit2_conv1", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 64}}, {"name": "stage1_unit2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage1_unit2_bn2", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "stage1_unit2_relu2", "class_name": "Activation", "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]], "config": {"name": "stage1_unit2_relu2", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_6", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_6", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage1_unit2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage1_unit2_conv2", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 64}}, {"name": "add_2", "class_name": "Add", "inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_1", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}}, {"name": "stage2_unit1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage2_unit1_bn1", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "stage2_unit1_relu1", "class_name": "Activation", "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]], "config": {"name": "stage2_unit1_relu1", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_7", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_7", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage2_unit1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage2_unit1_conv1", "use_bias": false, "strides": [2, 2], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 128}}, {"name": "stage2_unit1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage2_unit1_bn2", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "stage2_unit1_relu2", "class_name": "Activation", "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]], "config": {"name": "stage2_unit1_relu2", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_8", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_8", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage2_unit1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage2_unit1_conv2", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 128}}, {"name": "stage2_unit1_sc", "class_name": "Conv2D", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage2_unit1_sc", "use_bias": false, "strides": [2, 2], "kernel_size": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 128}}, {"name": "add_3", "class_name": "Add", "inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}}, {"name": "stage2_unit2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage2_unit2_bn1", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "stage2_unit2_relu1", "class_name": "Activation", "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]], "config": {"name": "stage2_unit2_relu1", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_9", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_9", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage2_unit2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage2_unit2_conv1", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 128}}, {"name": "stage2_unit2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage2_unit2_bn2", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "stage2_unit2_relu2", "class_name": "Activation", "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]], "config": {"name": "stage2_unit2_relu2", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_10", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_10", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage2_unit2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage2_unit2_conv2", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 128}}, {"name": "add_4", "class_name": "Add", "inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_3", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}}, {"name": "stage3_unit1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage3_unit1_bn1", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "stage3_unit1_relu1", "class_name": "Activation", "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]], "config": {"name": "stage3_unit1_relu1", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_11", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_11", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage3_unit1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage3_unit1_conv1", "use_bias": false, "strides": [2, 2], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 256}}, {"name": "stage3_unit1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage3_unit1_bn2", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "stage3_unit1_relu2", "class_name": "Activation", "inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]], "config": {"name": "stage3_unit1_relu2", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_12", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_12", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage3_unit1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_12", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage3_unit1_conv2", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 256}}, {"name": "stage3_unit1_sc", "class_name": "Conv2D", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage3_unit1_sc", "use_bias": false, "strides": [2, 2], "kernel_size": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 256}}, {"name": "add_5", "class_name": "Add", "inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]], "config": {"name": "add_5", "trainable": true}}, {"name": "stage3_unit2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage3_unit2_bn1", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "stage3_unit2_relu1", "class_name": "Activation", "inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]], "config": {"name": "stage3_unit2_relu1", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_13", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_13", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage3_unit2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_13", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage3_unit2_conv1", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 256}}, {"name": "stage3_unit2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage3_unit2_bn2", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "stage3_unit2_relu2", "class_name": "Activation", "inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]], "config": {"name": "stage3_unit2_relu2", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_14", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_14", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage3_unit2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage3_unit2_conv2", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 256}}, {"name": "add_6", "class_name": "Add", "inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_5", 0, 0, {}]]], "config": {"name": "add_6", "trainable": true}}, {"name": "stage4_unit1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage4_unit1_bn1", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "stage4_unit1_relu1", "class_name": "Activation", "inbound_nodes": [[["stage4_unit1_bn1", 0, 0, {}]]], "config": {"name": "stage4_unit1_relu1", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_15", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_15", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage4_unit1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage4_unit1_conv1", "use_bias": false, "strides": [2, 2], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 512}}, {"name": "stage4_unit1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage4_unit1_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage4_unit1_bn2", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "stage4_unit1_relu2", "class_name": "Activation", "inbound_nodes": [[["stage4_unit1_bn2", 0, 0, {}]]], "config": {"name": "stage4_unit1_relu2", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_16", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage4_unit1_relu2", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_16", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage4_unit1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage4_unit1_conv2", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 512}}, {"name": "stage4_unit1_sc", "class_name": "Conv2D", "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage4_unit1_sc", "use_bias": false, "strides": [2, 2], "kernel_size": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 512}}, {"name": "add_7", "class_name": "Add", "inbound_nodes": [[["stage4_unit1_conv2", 0, 0, {}], ["stage4_unit1_sc", 0, 0, {}]]], "config": {"name": "add_7", "trainable": true}}, {"name": "stage4_unit2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage4_unit2_bn1", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "stage4_unit2_relu1", "class_name": "Activation", "inbound_nodes": [[["stage4_unit2_bn1", 0, 0, {}]]], "config": {"name": "stage4_unit2_relu1", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_17", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage4_unit2_relu1", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_17", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage4_unit2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage4_unit2_conv1", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 512}}, {"name": "stage4_unit2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage4_unit2_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage4_unit2_bn2", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "stage4_unit2_relu2", "class_name": "Activation", "inbound_nodes": [[["stage4_unit2_bn2", 0, 0, {}]]], "config": {"name": "stage4_unit2_relu2", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_18", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage4_unit2_relu2", 0, 0, {}]]], "config": {"trainable": true, "name": "zero_padding2d_18", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage4_unit2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_18", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "name": "stage4_unit2_conv2", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 512}}, {"name": "add_8", "class_name": "Add", "inbound_nodes": [[["stage4_unit2_conv2", 0, 0, {}], ["add_7", 0, 0, {}]]], "config": {"name": "add_8", "trainable": true}}, {"name": "bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn1", "beta_regularizer": null, "axis": 3, "center": true, "epsilon": 2e-05, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "relu1", "class_name": "Activation", "inbound_nodes": [[["bn1", 0, 0, {}]]], "config": {"name": "relu1", "activation": "relu", "trainable": true}}, {"name": "decoder_stage0_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["relu1", 0, 0, {}]]], "config": {"size": [2, 2], "name": "decoder_stage0_upsample", "interpolation": "nearest", "data_format": "channels_last", "trainable": true}}, {"name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage0_upsample", 0, 0, {}], ["stage4_unit1_relu1", 0, 0, {}]]], "config": {"name": "concatenate_1", "axis": -1, "trainable": true}}, {"name": "decoder_stage0_conv1", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_constraint": null, "name": "decoder_stage0_conv1", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 256}}, {"name": "decoder_stage0_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage0_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "decoder_stage0_bn1", "beta_regularizer": null, "axis": -1, "center": true, "epsilon": 0.001, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "decoder_stage0_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage0_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage0_relu1", "activation": "relu", "trainable": true}}, {"name": "decoder_stage0_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage0_relu1", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_constraint": null, "name": "decoder_stage0_conv2", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 256}}, {"name": "decoder_stage0_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage0_conv2", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "decoder_stage0_bn2", "beta_regularizer": null, "axis": -1, "center": true, "epsilon": 0.001, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "decoder_stage0_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage0_bn2", 0, 0, {}]]], "config": {"name": "decoder_stage0_relu2", "activation": "relu", "trainable": true}}, {"name": "decoder_stage1_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage0_relu2", 0, 0, {}]]], "config": {"size": [2, 2], "name": "decoder_stage1_upsample", "interpolation": "nearest", "data_format": "channels_last", "trainable": true}}, {"name": "concatenate_2", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage1_upsample", 0, 0, {}], ["stage3_unit1_relu1", 0, 0, {}]]], "config": {"name": "concatenate_2", "axis": -1, "trainable": true}}, {"name": "decoder_stage1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_constraint": null, "name": "decoder_stage1_conv1", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 128}}, {"name": "decoder_stage1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage1_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "decoder_stage1_bn1", "beta_regularizer": null, "axis": -1, "center": true, "epsilon": 0.001, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "decoder_stage1_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage1_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage1_relu1", "activation": "relu", "trainable": true}}, {"name": "decoder_stage1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage1_relu1", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_constraint": null, "name": "decoder_stage1_conv2", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 128}}, {"name": "decoder_stage1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage1_conv2", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "decoder_stage1_bn2", "beta_regularizer": null, "axis": -1, "center": true, "epsilon": 0.001, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "decoder_stage1_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage1_bn2", 0, 0, {}]]], "config": {"name": "decoder_stage1_relu2", "activation": "relu", "trainable": true}}, {"name": "decoder_stage2_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage1_relu2", 0, 0, {}]]], "config": {"size": [2, 2], "name": "decoder_stage2_upsample", "interpolation": "nearest", "data_format": "channels_last", "trainable": true}}, {"name": "concatenate_3", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage2_upsample", 0, 0, {}], ["stage2_unit1_relu1", 0, 0, {}]]], "config": {"name": "concatenate_3", "axis": -1, "trainable": true}}, {"name": "decoder_stage2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_constraint": null, "name": "decoder_stage2_conv1", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 64}}, {"name": "decoder_stage2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage2_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "decoder_stage2_bn1", "beta_regularizer": null, "axis": -1, "center": true, "epsilon": 0.001, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "decoder_stage2_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage2_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage2_relu1", "activation": "relu", "trainable": true}}, {"name": "decoder_stage2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage2_relu1", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_constraint": null, "name": "decoder_stage2_conv2", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 64}}, {"name": "decoder_stage2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage2_conv2", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "decoder_stage2_bn2", "beta_regularizer": null, "axis": -1, "center": true, "epsilon": 0.001, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "decoder_stage2_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage2_bn2", 0, 0, {}]]], "config": {"name": "decoder_stage2_relu2", "activation": "relu", "trainable": true}}, {"name": "decoder_stage3_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage2_relu2", 0, 0, {}]]], "config": {"size": [2, 2], "name": "decoder_stage3_upsample", "interpolation": "nearest", "data_format": "channels_last", "trainable": true}}, {"name": "concatenate_4", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage3_upsample", 0, 0, {}], ["relu0", 0, 0, {}]]], "config": {"name": "concatenate_4", "axis": -1, "trainable": true}}, {"name": "decoder_stage3_conv1", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_constraint": null, "name": "decoder_stage3_conv1", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 32}}, {"name": "decoder_stage3_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage3_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "decoder_stage3_bn1", "beta_regularizer": null, "axis": -1, "center": true, "epsilon": 0.001, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "decoder_stage3_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage3_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage3_relu1", "activation": "relu", "trainable": true}}, {"name": "decoder_stage3_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage3_relu1", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_constraint": null, "name": "decoder_stage3_conv2", "use_bias": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 32}}, {"name": "decoder_stage3_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage3_conv2", 0, 0, {}]]], "config": {"gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "decoder_stage3_bn2", "beta_regularizer": null, "axis": -1, "center": true, "epsilon": 0.001, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "decoder_stage3_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage3_bn2", 0, 0, {}]]], "config": {"name": "decoder_stage3_relu2", "activation": "relu", "trainable": true}}, {"name": "decoder_stage4_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage3_relu2", 0, 0, {}]]], "config": {"size": [2, 2], "name": "decoder_stage4_upsample", "interpolation": "nearest", "data_format": "channels_last", "trainable": true}}, {"name": "decoder_stage4_conv1", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage4_upsample", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_constraint": null, "name": "decoder_stage4_conv1", "use_bias": false, "strides": [1, 1], 