{"config": {"name": "u-resnet18", "input_layers": [["data", 0, 0]], "layers": [{"name": "data", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "data"}}, {"name": "bn_data", "class_name": "BatchNormalization", "inbound_nodes": [[["data", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn_data", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": false, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "zero_padding2d_37", "class_name": "ZeroPadding2D", "inbound_nodes": [[["bn_data", 0, 0, {}]]], "config": {"name": "zero_padding2d_37", "trainable": true, "data_format": "channels_last", "padding": [[3, 3], [3, 3]]}}, {"name": "conv0", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_37", 0, 0, {}]]], "config": {"name": "conv0", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 64, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [7, 7], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "bn0", "class_name": "BatchNormalization", "inbound_nodes": [[["conv0", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn0", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "relu0", "class_name": "Activation", "inbound_nodes": [[["bn0", 0, 0, {}]]], "config": {"name": "relu0", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_38", "class_name": "ZeroPadding2D", "inbound_nodes": [[["relu0", 0, 0, {}]]], "config": {"name": "zero_padding2d_38", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "pooling0", "class_name": "MaxPooling2D", "inbound_nodes": [[["zero_padding2d_38", 0, 0, {}]]], "config": {"name": "pooling0", "strides": [2, 2], "trainable": true, "pool_size": [3, 3], "padding": "valid", "data_format": "channels_last"}}, {"name": "stage1_unit1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["pooling0", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage1_unit1_bn1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "stage1_unit1_relu1", "class_name": "Activation", "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]], "config": {"name": "stage1_unit1_relu1", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_39", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "config": {"name": "zero_padding2d_39", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage1_unit1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_39", 0, 0, {}]]], "config": {"name": "stage1_unit1_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 64, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "stage1_unit1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage1_unit1_bn2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "stage1_unit1_relu2", "class_name": "Activation", "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]], "config": {"name": "stage1_unit1_relu2", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_40", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]], "config": {"name": "zero_padding2d_40", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage1_unit1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_40", 0, 0, {}]]], "config": {"name": "stage1_unit1_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 64, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "stage1_unit1_sc", "class_name": "Conv2D", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "config": {"name": "stage1_unit1_sc", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 64, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "add_17", "class_name": "Add", "inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]], "config": {"name": "add_17", "trainable": true}}, {"name": "stage1_unit2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_17", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage1_unit2_bn1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "stage1_unit2_relu1", "class_name": "Activation", "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]], "config": {"name": "stage1_unit2_relu1", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_41", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]], "config": {"name": "zero_padding2d_41", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage1_unit2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_41", 0, 0, {}]]], "config": {"name": "stage1_unit2_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 64, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "stage1_unit2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage1_unit2_bn2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "stage1_unit2_relu2", "class_name": "Activation", "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]], "config": {"name": "stage1_unit2_relu2", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_42", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]], "config": {"name": "zero_padding2d_42", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage1_unit2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_42", 0, 0, {}]]], "config": {"name": "stage1_unit2_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 64, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "add_18", "class_name": "Add", "inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_17", 0, 0, {}]]], "config": {"name": "add_18", "trainable": true}}, {"name": "stage2_unit1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_18", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage2_unit1_bn1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "stage2_unit1_relu1", "class_name": "Activation", "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]], "config": {"name": "stage2_unit1_relu1", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_43", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "config": {"name": "zero_padding2d_43", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage2_unit1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_43", 0, 0, {}]]], "config": {"name": "stage2_unit1_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 128, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "stage2_unit1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage2_unit1_bn2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "stage2_unit1_relu2", "class_name": "Activation", "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]], "config": {"name": "stage2_unit1_relu2", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_44", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]], "config": {"name": "zero_padding2d_44", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage2_unit1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_44", 0, 0, {}]]], "config": {"name": "stage2_unit1_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 128, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "stage2_unit1_sc", "class_name": "Conv2D", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "config": {"name": "stage2_unit1_sc", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 128, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "add_19", "class_name": "Add", "inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]], "config": {"name": "add_19", "trainable": true}}, {"name": "stage2_unit2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_19", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage2_unit2_bn1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "stage2_unit2_relu1", "class_name": "Activation", "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]], "config": {"name": "stage2_unit2_relu1", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_45", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]], "config": {"name": "zero_padding2d_45", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage2_unit2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_45", 0, 0, {}]]], "config": {"name": "stage2_unit2_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 128, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "stage2_unit2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage2_unit2_bn2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "stage2_unit2_relu2", "class_name": "Activation", "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]], "config": {"name": "stage2_unit2_relu2", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_46", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]], "config": {"name": "zero_padding2d_46", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage2_unit2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_46", 0, 0, {}]]], "config": {"name": "stage2_unit2_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 128, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "add_20", "class_name": "Add", "inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_19", 0, 0, {}]]], "config": {"name": "add_20", "trainable": true}}, {"name": "stage3_unit1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_20", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage3_unit1_bn1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "stage3_unit1_relu1", "class_name": "Activation", "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]], "config": {"name": "stage3_unit1_relu1", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_47", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "config": {"name": "zero_padding2d_47", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage3_unit1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_47", 0, 0, {}]]], "config": {"name": "stage3_unit1_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 256, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "stage3_unit1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage3_unit1_bn2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "stage3_unit1_relu2", "class_name": "Activation", "inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]], "config": {"name": "stage3_unit1_relu2", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_48", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]], "config": {"name": "zero_padding2d_48", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage3_unit1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_48", 0, 0, {}]]], "config": {"name": "stage3_unit1_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 256, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "stage3_unit1_sc", "class_name": "Conv2D", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "config": {"name": "stage3_unit1_sc", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 256, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "add_21", "class_name": "Add", "inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]], "config": {"name": "add_21", "trainable": true}}, {"name": "stage3_unit2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_21", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage3_unit2_bn1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "stage3_unit2_relu1", "class_name": "Activation", "inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]], "config": {"name": "stage3_unit2_relu1", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_49", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]], "config": {"name": "zero_padding2d_49", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage3_unit2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_49", 0, 0, {}]]], "config": {"name": "stage3_unit2_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 256, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "stage3_unit2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage3_unit2_bn2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "stage3_unit2_relu2", "class_name": "Activation", "inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]], "config": {"name": "stage3_unit2_relu2", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_50", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]], "config": {"name": "zero_padding2d_50", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage3_unit2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_50", 0, 0, {}]]], "config": {"name": "stage3_unit2_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 256, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "add_22", "class_name": "Add", "inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_21", 0, 0, {}]]], "config": {"name": "add_22", "trainable": true}}, {"name": "stage4_unit1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_22", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage4_unit1_bn1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "stage4_unit1_relu1", "class_name": "Activation", "inbound_nodes": [[["stage4_unit1_bn1", 0, 0, {}]]], "config": {"name": "stage4_unit1_relu1", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_51", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "config": {"name": "zero_padding2d_51", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage4_unit1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_51", 0, 0, {}]]], "config": {"name": "stage4_unit1_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 512, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "stage4_unit1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage4_unit1_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage4_unit1_bn2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "stage4_unit1_relu2", "class_name": "Activation", "inbound_nodes": [[["stage4_unit1_bn2", 0, 0, {}]]], "config": {"name": "stage4_unit1_relu2", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_52", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage4_unit1_relu2", 0, 0, {}]]], "config": {"name": "zero_padding2d_52", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage4_unit1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_52", 0, 0, {}]]], "config": {"name": "stage4_unit1_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 512, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "stage4_unit1_sc", "class_name": "Conv2D", "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "config": {"name": "stage4_unit1_sc", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 512, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "add_23", "class_name": "Add", "inbound_nodes": [[["stage4_unit1_conv2", 0, 0, {}], ["stage4_unit1_sc", 0, 0, {}]]], "config": {"name": "add_23", "trainable": true}}, {"name": "stage4_unit2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_23", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage4_unit2_bn1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "stage4_unit2_relu1", "class_name": "Activation", "inbound_nodes": [[["stage4_unit2_bn1", 0, 0, {}]]], "config": {"name": "stage4_unit2_relu1", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_53", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage4_unit2_relu1", 0, 0, {}]]], "config": {"name": "zero_padding2d_53", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage4_unit2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_53", 0, 0, {}]]], "config": {"name": "stage4_unit2_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 512, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "stage4_unit2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["stage4_unit2_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage4_unit2_bn2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "stage4_unit2_relu2", "class_name": "Activation", "inbound_nodes": [[["stage4_unit2_bn2", 0, 0, {}]]], "config": {"name": "stage4_unit2_relu2", "trainable": true, "activation": "relu"}}, {"name": "zero_padding2d_54", "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage4_unit2_relu2", 0, 0, {}]]], "config": {"name": "zero_padding2d_54", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"name": "stage4_unit2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_54", 0, 0, {}]]], "config": {"name": "stage4_unit2_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 512, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "add_24", "class_name": "Add", "inbound_nodes": [[["stage4_unit2_conv2", 0, 0, {}], ["add_23", 0, 0, {}]]], "config": {"name": "add_24", "trainable": true}}, {"name": "bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["add_24", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 2e-05, "center": true}}, {"name": "relu1", "class_name": "Activation", "inbound_nodes": [[["bn1", 0, 0, {}]]], "config": {"name": "relu1", "trainable": true, "activation": "relu"}}, {"name": "decoder_stage0_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["relu1", 0, 0, {}]]], "config": {"name": "decoder_stage0_upsample", "trainable": true, "interpolation": "nearest", "size": [2, 2], "data_format": "channels_last"}}, {"name": "concatenate_9", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage0_upsample", 0, 0, {}], ["stage4_unit1_relu1", 0, 0, {}]]], "config": {"name": "concatenate_9", "trainable": true, "axis": -1}}, {"name": "decoder_stage0_conv1", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_9", 0, 0, {}]]], "config": {"name": "decoder_stage0_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 256, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "decoder_stage0_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage0_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "decoder_stage0_bn1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 0.001, "center": true}}, {"name": "decoder_stage0_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage0_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage0_relu1", "trainable": true, "activation": "relu"}}, {"name": "decoder_stage0_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage0_relu1", 0, 0, {}]]], "config": {"name": "decoder_stage0_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 256, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "decoder_stage0_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage0_conv2", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "decoder_stage0_bn2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 0.001, "center": true}}, {"name": "decoder_stage0_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage0_bn2", 0, 0, {}]]], "config": {"name": "decoder_stage0_relu2", "trainable": true, "activation": "relu"}}, {"name": "decoder_stage1_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage0_relu2", 0, 0, {}]]], "config": {"name": "decoder_stage1_upsample", "trainable": true, "interpolation": "nearest", "size": [2, 2], "data_format": "channels_last"}}, {"name": "concatenate_10", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage1_upsample", 0, 0, {}], ["stage3_unit1_relu1", 0, 0, {}]]], "config": {"name": "concatenate_10", "trainable": true, "axis": -1}}, {"name": "decoder_stage1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_10", 0, 0, {}]]], "config": {"name": "decoder_stage1_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 128, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "decoder_stage1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage1_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "decoder_stage1_bn1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 0.001, "center": true}}, {"name": "decoder_stage1_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage1_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage1_relu1", "trainable": true, "activation": "relu"}}, {"name": "decoder_stage1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage1_relu1", 0, 0, {}]]], "config": {"name": "decoder_stage1_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 128, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "decoder_stage1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage1_conv2", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "decoder_stage1_bn2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 0.001, "center": true}}, {"name": "decoder_stage1_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage1_bn2", 0, 0, {}]]], "config": {"name": "decoder_stage1_relu2", "trainable": true, "activation": "relu"}}, {"name": "decoder_stage2_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage1_relu2", 0, 0, {}]]], "config": {"name": "decoder_stage2_upsample", "trainable": true, "interpolation": "nearest", "size": [2, 2], "data_format": "channels_last"}}, {"name": "concatenate_11", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage2_upsample", 0, 0, {}], ["stage2_unit1_relu1", 0, 0, {}]]], "config": {"name": "concatenate_11", "trainable": true, "axis": -1}}, {"name": "decoder_stage2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_11", 0, 0, {}]]], "config": {"name": "decoder_stage2_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 64, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "decoder_stage2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage2_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "decoder_stage2_bn1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 0.001, "center": true}}, {"name": "decoder_stage2_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage2_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage2_relu1", "trainable": true, "activation": "relu"}}, {"name": "decoder_stage2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage2_relu1", 0, 0, {}]]], "config": {"name": "decoder_stage2_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 64, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "decoder_stage2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage2_conv2", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "decoder_stage2_bn2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 0.001, "center": true}}, {"name": "decoder_stage2_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage2_bn2", 0, 0, {}]]], "config": {"name": "decoder_stage2_relu2", "trainable": true, "activation": "relu"}}, {"name": "decoder_stage3_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage2_relu2", 0, 0, {}]]], "config": {"name": "decoder_stage3_upsample", "trainable": true, "interpolation": "nearest", "size": [2, 2], "data_format": "channels_last"}}, {"name": "concatenate_12", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage3_upsample", 0, 0, {}], ["relu0", 0, 0, {}]]], "config": {"name": "concatenate_12", "trainable": true, "axis": -1}}, {"name": "decoder_stage3_conv1", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_12", 0, 0, {}]]], "config": {"name": "decoder_stage3_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "decoder_stage3_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage3_conv1", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "decoder_stage3_bn1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 0.001, "center": true}}, {"name": "decoder_stage3_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage3_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage3_relu1", "trainable": true, "activation": "relu"}}, {"name": "decoder_stage3_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage3_relu1", 0, 0, {}]]], "config": {"name": "decoder_stage3_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "decoder_stage3_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage3_conv2", 0, 0, {}]]], "config": {"gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "decoder_stage3_bn2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 0.001, "center": true}}, {"name": "decoder_stage3_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage3_bn2", 0, 0, {}]]], "config": {"name": "decoder_stage3_relu2", "trainable": true, "activation": "relu"}}, {"name": "decoder_stage4_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage3_relu2", 0, 0, {}]]], "config": {"name": "decoder_stage4_upsample", "trainable": true, "interpolation": "nearest", "size": [2, 2], "data_format": "channels_last"}}, {"name": "decoder_stage4_conv1", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage4_upsample", 0, 0, {}]]], "config": {"name": "decoder_stage4_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": 