{"class_name": "Model", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"input_layers": [["data", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null, null, 3], "name": "data"}, "name": "data"}, {"inbound_nodes": [[["data", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "bn_data", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "bn_data"}, {"inbound_nodes": [[["bn_data", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[3, 3], [3, 3]], "trainable": true, "name": "zero_padding2d_55"}, "name": "zero_padding2d_55"}, {"inbound_nodes": [[["zero_padding2d_55", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [7, 7], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "conv0", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "conv0"}, {"inbound_nodes": [[["conv0", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "bn0", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "bn0"}, {"inbound_nodes": [[["bn0", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu0"}, "name": "relu0"}, {"inbound_nodes": [[["relu0", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_56"}, "name": "zero_padding2d_56"}, {"inbound_nodes": [[["zero_padding2d_56", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "trainable": true, "name": "pooling0", "data_format": "channels_last", "pool_size": [3, 3]}, "name": "pooling0"}, {"inbound_nodes": [[["pooling0", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage1_unit1_bn1", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage1_unit1_bn1"}, {"inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit1_relu1"}, "name": "stage1_unit1_relu1"}, {"inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_57"}, "name": "zero_padding2d_57"}, {"inbound_nodes": [[["zero_padding2d_57", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "stage1_unit1_conv1", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage1_unit1_conv1"}, {"inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage1_unit1_bn2", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage1_unit1_bn2"}, {"inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit1_relu2"}, "name": "stage1_unit1_relu2"}, {"inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_58"}, "name": "zero_padding2d_58"}, {"inbound_nodes": [[["zero_padding2d_58", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "stage1_unit1_conv2", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage1_unit1_conv2"}, {"inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "stage1_unit1_sc", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage1_unit1_sc"}, {"inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_37"}, "name": "add_37"}, {"inbound_nodes": [[["add_37", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage1_unit2_bn1", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage1_unit2_bn1"}, {"inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit2_relu1"}, "name": "stage1_unit2_relu1"}, {"inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_59"}, "name": "zero_padding2d_59"}, {"inbound_nodes": [[["zero_padding2d_59", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "stage1_unit2_conv1", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage1_unit2_conv1"}, {"inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage1_unit2_bn2", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage1_unit2_bn2"}, {"inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit2_relu2"}, "name": "stage1_unit2_relu2"}, {"inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_60"}, "name": "zero_padding2d_60"}, {"inbound_nodes": [[["zero_padding2d_60", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "stage1_unit2_conv2", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage1_unit2_conv2"}, {"inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_37", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_38"}, "name": "add_38"}, {"inbound_nodes": [[["add_38", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage2_unit1_bn1", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage2_unit1_bn1"}, {"inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit1_relu1"}, "name": "stage2_unit1_relu1"}, {"inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_61"}, "name": "zero_padding2d_61"}, {"inbound_nodes": [[["zero_padding2d_61", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "name": "stage2_unit1_conv1", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage2_unit1_conv1"}, {"inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage2_unit1_bn2", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage2_unit1_bn2"}, {"inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit1_relu2"}, "name": "stage2_unit1_relu2"}, {"inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_62"}, "name": "zero_padding2d_62"}, {"inbound_nodes": [[["zero_padding2d_62", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "name": "stage2_unit1_conv2", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage2_unit1_conv2"}, {"inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "name": "stage2_unit1_sc", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage2_unit1_sc"}, {"inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_39"}, "name": "add_39"}, {"inbound_nodes": [[["add_39", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage2_unit2_bn1", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage2_unit2_bn1"}, {"inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit2_relu1"}, "name": "stage2_unit2_relu1"}, {"inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_63"}, "name": "zero_padding2d_63"}, {"inbound_nodes": [[["zero_padding2d_63", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "name": "stage2_unit2_conv1", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage2_unit2_conv1"}, {"inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage2_unit2_bn2", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage2_unit2_bn2"}, {"inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit2_relu2"}, "name": "stage2_unit2_relu2"}, {"inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_64"}, "name": "zero_padding2d_64"}, {"inbound_nodes": [[["zero_padding2d_64", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "name": "stage2_unit2_conv2", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage2_unit2_conv2"}, {"inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_39", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_40"}, "name": "add_40"}, {"inbound_nodes": [[["add_40", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage3_unit1_bn1", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage3_unit1_bn1"}, {"inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit1_relu1"}, "name": "stage3_unit1_relu1"}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_65"}, "name": "zero_padding2d_65"}, {"inbound_nodes": [[["zero_padding2d_65", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "name": "stage3_unit1_conv1", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage3_unit1_conv1"}, {"inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage3_unit1_bn2", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage3_unit1_bn2"}, {"inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit1_relu2"}, "name": "stage3_unit1_relu2"}, {"inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_66"}, "name": "zero_padding2d_66"}, {"inbound_nodes": [[["zero_padding2d_66", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "name": "stage3_unit1_conv2", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage3_unit1_conv2"}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "name": "stage3_unit1_sc", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage3_unit1_sc"}, {"inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_41"}, "name": "add_41"}, {"inbound_nodes": [[["add_41", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage3_unit2_bn1", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage3_unit2_bn1"}, {"inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit2_relu1"}, "name": "stage3_unit2_relu1"}, {"inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_67"}, "name": "zero_padding2d_67"}, {"inbound_nodes": [[["zero_padding2d_67", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "name": "stage3_unit2_conv1", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage3_unit2_conv1"}, {"inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage3_unit2_bn2", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage3_unit2_bn2"}, {"inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit2_relu2"}, "name": "stage3_unit2_relu2"}, {"inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_68"}, "name": "zero_padding2d_68"}, {"inbound_nodes": [[["zero_padding2d_68", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "name": "stage3_unit2_conv2", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage3_unit2_conv2"}, {"inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_41", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_42"}, "name": "add_42"}, {"inbound_nodes": [[["add_42", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage4_unit1_bn1", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage4_unit1_bn1"}, {"inbound_nodes": [[["stage4_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage4_unit1_relu1"}, "name": "stage4_unit1_relu1"}, {"inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_69"}, "name": "zero_padding2d_69"}, {"inbound_nodes": [[["zero_padding2d_69", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "name": "stage4_unit1_conv1", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage4_unit1_conv1"}, {"inbound_nodes": [[["stage4_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage4_unit1_bn2", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage4_unit1_bn2"}, {"inbound_nodes": [[["stage4_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage4_unit1_relu2"}, "name": "stage4_unit1_relu2"}, {"inbound_nodes": [[["stage4_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_70"}, "name": "zero_padding2d_70"}, {"inbound_nodes": [[["zero_padding2d_70", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "name": "stage4_unit1_conv2", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage4_unit1_conv2"}, {"inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "name": "stage4_unit1_sc", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage4_unit1_sc"}, {"inbound_nodes": [[["stage4_unit1_conv2", 0, 0, {}], ["stage4_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_43"}, "name": "add_43"}, {"inbound_nodes": [[["add_43", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage4_unit2_bn1", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage4_unit2_bn1"}, {"inbound_nodes": [[["stage4_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage4_unit2_relu1"}, "name": "stage4_unit2_relu1"}, {"inbound_nodes": [[["stage4_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_71"}, "name": "zero_padding2d_71"}, {"inbound_nodes": [[["zero_padding2d_71", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "name": "stage4_unit2_conv1", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage4_unit2_conv1"}, {"inbound_nodes": [[["stage4_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage4_unit2_bn2", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage4_unit2_bn2"}, {"inbound_nodes": [[["stage4_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage4_unit2_relu2"}, "name": "stage4_unit2_relu2"}, {"inbound_nodes": [[["stage4_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_72"}, "name": "zero_padding2d_72"}, {"inbound_nodes": [[["zero_padding2d_72", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "name": "stage4_unit2_conv2", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage4_unit2_conv2"}, {"inbound_nodes": [[["stage4_unit2_conv2", 0, 0, {}], ["add_43", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_44"}, "name": "add_44"}, {"inbound_nodes": [[["add_44", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "bn1", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "bn1"}, {"inbound_nodes": [[["bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu1"}, "name": "relu1"}, {"inbound_nodes": [[["relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "padding": "same", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "name": "decoder_stage0_conv1", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "decoder_stage0_conv1"}, {"inbound_nodes": [[["decoder_stage0_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "decoder_stage0_bn1", "beta_constraint": null, "epsilon": 0.001, "center": true}, "name": "decoder_stage0_bn1"}, {"inbound_nodes": [[["decoder_stage0_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "decoder_stage0_relu1"}, "name": "decoder_stage0_relu1"}, {"inbound_nodes": [[["decoder_stage0_relu1", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "interpolation": "nearest", "size": [2, 2], "trainable": true, "name": "decoder_stage0_upsample2"}, "name": "decoder_stage0_upsample2"}, {"inbound_nodes": [[["decoder_stage0_upsample2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "name": "decoder_stage0_conv2", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "decoder_stage0_conv2"}, {"inbound_nodes": [[["decoder_stage0_conv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "decoder_stage0_bn2", "beta_constraint": null, "epsilon": 0.001, "center": true}, "name": "decoder_stage0_bn2"}, {"inbound_nodes": [[["decoder_stage0_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "decoder_stage0_relu2"}, "name": "decoder_stage0_relu2"}, {"inbound_nodes": [[["decoder_stage0_relu2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "padding": "same", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "name": "decoder_stage0_conv3", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "decoder_stage0_conv3"}, {"inbound_nodes": [[["decoder_stage0_conv3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "decoder_stage0_bn3", "beta_constraint": null, "epsilon": 0.001, "center": true}, "name": "decoder_stage0_bn3"}, {"inbound_nodes": [[["decoder_stage0_bn3", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "decoder_stage0_relu3"}, "name": "decoder_stage0_relu3"}, {"inbound_nodes": [[["decoder_stage0_relu3", 0, 0, {}], ["stage4_unit1_relu1", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_45"}, "name": "add_45"}, {"inbound_nodes": [[["add_45", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "padding": "same", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "decoder_stage1_conv1", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "decoder_stage1_conv1"}, {"inbound_nodes": [[["decoder_stage1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "decoder_stage1_bn1", "beta_constraint": null, "epsilon": 0.001, "center": true}, "name": "decoder_stage1_bn1"}, {"inbound_nodes": [[["decoder_stage1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "decoder_stage1_relu1"}, "name": "decoder_stage1_relu1"}, {"inbound_nodes": [[["decoder_stage1_relu1", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "interpolation": "nearest", "size": [2, 2], "trainable": true, "name": "decoder_stage1_upsample2"}, "name": "decoder_stage1_upsample2"}, {"inbound_nodes": [[["decoder_stage1_upsample2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "decoder_stage1_conv2", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "decoder_stage1_conv2"}, {"inbound_nodes": [[["decoder_stage1_conv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "decoder_stage1_bn2", "beta_constraint": null, "epsilon": 0.001, "center": true}, "name": "decoder_stage1_bn2"}, {"inbound_nodes": [[["decoder_stage1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "decoder_stage1_relu2"}, "name": "decoder_stage1_relu2"}, {"inbound_nodes": [[["decoder_stage1_relu2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "padding": "same", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "name": "decoder_stage1_conv3", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "decoder_stage1_conv3"}, {"inbound_nodes": [[["decoder_stage1_conv3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "decoder_stage1_bn3", "beta_constraint": null, "epsilon": 0.001, "center": true}, "name": "decoder_stage1_bn3"}, {"inbound_nodes": [[["decoder_stage1_bn3", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "decoder_stage1_relu3"}, "name": "decoder_stage1_relu3"}, {"inbound_nodes": [[["decoder_stage1_relu3", 0, 0, {}], ["stage3_unit1_relu1", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_46"}, "name": "add_46"}, {"inbound_nodes": [[["add_46", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "padding": "same", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "name": "decoder_stage2_conv1", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "decoder_stage2_conv1"}, {"inbound_nodes": [[["decoder_stage2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "decoder_stage2_bn1", "beta_constraint": null, "epsilon": 0.001, "center": true}, "name": "decoder_stage2_bn1"}, {"inbound_nodes": [[["decoder_stage2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "decoder_stage2_relu1"}, "name": "decoder_stage2_relu1"}, {"inbound_nodes": [[["decoder_stage2_relu1", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "interpolation": "nearest", "size": [2, 2], "trainable": true, "name": "decoder_stage2_upsample2"}, "name": "decoder_stage2_upsample2"}, {"inbound_nodes": [[["decoder_stage2_upsample2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "name": "decoder_stage2_conv2", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "decoder_stage2_conv2"}, {"inbound_nodes": [[["decoder_stage2_conv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "decoder_stage2_bn2", "beta_constraint": null, "epsilon": 0.001, "center": true}, "name": "decoder_stage2_bn2"}, {"inbound_nodes": [[["decoder_stage2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "decoder_stage2_relu2"}, "name": "decoder_stage2_relu2"}, {"inbound_nodes": [[["decoder_stage2_relu2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "padding": "same", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "decoder_stage2_conv3", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "decoder_stage2_conv3"}, {"inbound_nodes": [[["decoder_stage2_conv3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "decoder_stage2_bn3", "beta_constraint": null, 