{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null, null, 3], "name": "data"}, "name": "data", "inbound_nodes": []}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn_data", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "bn_data", "inbound_nodes": [[["data", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[3, 3], [3, 3]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_19"}, "name": "zero_padding2d_19", "inbound_nodes": [[["bn_data", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [2, 2], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [7, 7], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv0", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 64}, "name": "conv0", "inbound_nodes": [[["zero_padding2d_19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn0", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "bn0", "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "relu0", "activation": "relu"}, "name": "relu0", "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_20"}, "name": "zero_padding2d_20", "inbound_nodes": [[["relu0", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "pooling0", "pool_size": [3, 3], "trainable": true}, "name": "pooling0", "inbound_nodes": [[["zero_padding2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "stage1_unit1_bn1", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "stage1_unit1_bn1", "inbound_nodes": [[["pooling0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage1_unit1_relu1", "activation": "relu"}, "name": "stage1_unit1_relu1", "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_21"}, "name": "zero_padding2d_21", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage1_unit1_conv1", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 64}, "name": "stage1_unit1_conv1", "inbound_nodes": [[["zero_padding2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "stage1_unit1_bn2", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "stage1_unit1_bn2", "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage1_unit1_relu2", "activation": "relu"}, "name": "stage1_unit1_relu2", "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_22"}, "name": "zero_padding2d_22", "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage1_unit1_conv2", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 64}, "name": "stage1_unit1_conv2", "inbound_nodes": [[["zero_padding2d_22", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage1_unit1_sc", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 64}, "name": "stage1_unit1_sc", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_9"}, "name": "add_9", "inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "stage1_unit2_bn1", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "stage1_unit2_bn1", "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage1_unit2_relu1", "activation": "relu"}, "name": "stage1_unit2_relu1", "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_23"}, "name": "zero_padding2d_23", "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage1_unit2_conv1", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 64}, "name": "stage1_unit2_conv1", "inbound_nodes": [[["zero_padding2d_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "stage1_unit2_bn2", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "stage1_unit2_bn2", "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage1_unit2_relu2", "activation": "relu"}, "name": "stage1_unit2_relu2", "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_24"}, "name": "zero_padding2d_24", "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage1_unit2_conv2", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 64}, "name": "stage1_unit2_conv2", "inbound_nodes": [[["zero_padding2d_24", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_10"}, "name": "add_10", "inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "stage2_unit1_bn1", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "stage2_unit1_bn1", "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage2_unit1_relu1", "activation": "relu"}, "name": "stage2_unit1_relu1", "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_25"}, "name": "zero_padding2d_25", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [2, 2], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_unit1_conv1", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 128}, "name": "stage2_unit1_conv1", "inbound_nodes": [[["zero_padding2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "stage2_unit1_bn2", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "stage2_unit1_bn2", "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage2_unit1_relu2", "activation": "relu"}, "name": "stage2_unit1_relu2", "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_26"}, "name": "zero_padding2d_26", "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_unit1_conv2", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 128}, "name": "stage2_unit1_conv2", "inbound_nodes": [[["zero_padding2d_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [2, 2], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_unit1_sc", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 128}, "name": "stage2_unit1_sc", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_11"}, "name": "add_11", "inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "stage2_unit2_bn1", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "stage2_unit2_bn1", "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage2_unit2_relu1", "activation": "relu"}, "name": "stage2_unit2_relu1", "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_27"}, "name": "zero_padding2d_27", "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_unit2_conv1", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 128}, "name": "stage2_unit2_conv1", "inbound_nodes": [[["zero_padding2d_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "stage2_unit2_bn2", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "stage2_unit2_bn2", "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage2_unit2_relu2", "activation": "relu"}, "name": "stage2_unit2_relu2", "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_28"}, "name": "zero_padding2d_28", "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_unit2_conv2", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 128}, "name": "stage2_unit2_conv2", "inbound_nodes": [[["zero_padding2d_28", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_12"}, "name": "add_12", "inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "stage3_unit1_bn1", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "stage3_unit1_bn1", "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage3_unit1_relu1", "activation": "relu"}, "name": "stage3_unit1_relu1", "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_29"}, "name": "zero_padding2d_29", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [2, 2], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage3_unit1_conv1", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 256}, "name": "stage3_unit1_conv1", "inbound_nodes": [[["zero_padding2d_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "stage3_unit1_bn2", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "stage3_unit1_bn2", "inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage3_unit1_relu2", "activation": "relu"}, "name": "stage3_unit1_relu2", "inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_30"}, "name": "zero_padding2d_30", "inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage3_unit1_conv2", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 256}, "name": "stage3_unit1_conv2", "inbound_nodes": [[["zero_padding2d_30", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [2, 2], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage3_unit1_sc", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 256}, "name": "stage3_unit1_sc", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_13"}, "name": "add_13", "inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "stage3_unit2_bn1", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "stage3_unit2_bn1", "inbound_nodes": [[["add_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage3_unit2_relu1", "activation": "relu"}, "name": "stage3_unit2_relu1", "inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_31"}, "name": "zero_padding2d_31", "inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage3_unit2_conv1", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 256}, "name": "stage3_unit2_conv1", "inbound_nodes": [[["zero_padding2d_31", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "stage3_unit2_bn2", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "stage3_unit2_bn2", "inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage3_unit2_relu2", "activation": "relu"}, "name": "stage3_unit2_relu2", "inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_32"}, "name": "zero_padding2d_32", "inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage3_unit2_conv2", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 256}, "name": "stage3_unit2_conv2", "inbound_nodes": [[["zero_padding2d_32", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_14"}, "name": "add_14", "inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "stage4_unit1_bn1", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "stage4_unit1_bn1", "inbound_nodes": [[["add_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage4_unit1_relu1", "activation": "relu"}, "name": "stage4_unit1_relu1", "inbound_nodes": [[["stage4_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_33"}, "name": "zero_padding2d_33", "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [2, 2], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage4_unit1_conv1", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 512}, "name": "stage4_unit1_conv1", "inbound_nodes": [[["zero_padding2d_33", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "stage4_unit1_bn2", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "stage4_unit1_bn2", "inbound_nodes": [[["stage4_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage4_unit1_relu2", "activation": "relu"}, "name": "stage4_unit1_relu2", "inbound_nodes": [[["stage4_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_34"}, "name": "zero_padding2d_34", "inbound_nodes": [[["stage4_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage4_unit1_conv2", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 512}, "name": "stage4_unit1_conv2", "inbound_nodes": [[["zero_padding2d_34", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [2, 2], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage4_unit1_sc", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 512}, "name": "stage4_unit1_sc", "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_15"}, "name": "add_15", "inbound_nodes": [[["stage4_unit1_conv2", 0, 0, {}], ["stage4_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "stage4_unit2_bn1", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "stage4_unit2_bn1", "inbound_nodes": [[["add_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage4_unit2_relu1", "activation": "relu"}, "name": "stage4_unit2_relu1", "inbound_nodes": [[["stage4_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_35"}, "name": "zero_padding2d_35", "inbound_nodes": [[["stage4_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage4_unit2_conv1", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 512}, "name": "stage4_unit2_conv1", "inbound_nodes": [[["zero_padding2d_35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "stage4_unit2_bn2", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "stage4_unit2_bn2", "inbound_nodes": [[["stage4_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "stage4_unit2_relu2", "activation": "relu"}, "name": "stage4_unit2_relu2", "inbound_nodes": [[["stage4_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true, "name": "zero_padding2d_36"}, "name": "zero_padding2d_36", "inbound_nodes": [[["stage4_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "uniform", "mode": "fan_in", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage4_unit2_conv2", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 512}, "name": "stage4_unit2_conv2", "inbound_nodes": [[["zero_padding2d_36", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_16"}, "name": "add_16", "inbound_nodes": [[["stage4_unit2_conv2", 0, 0, {}], ["add_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn1", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 2e-05, "trainable": true}, "name": "bn1", "inbound_nodes": [[["add_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "relu1", "activation": "relu"}, "name": "relu1", "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage0_conv1", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 128}, "name": "decoder_stage0_conv1", "inbound_nodes": [[["relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "decoder_stage0_bn1", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true}, "name": "decoder_stage0_bn1", "inbound_nodes": [[["decoder_stage0_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage0_relu1", "activation": "relu"}, "name": "decoder_stage0_relu1", "inbound_nodes": [[["decoder_stage0_bn1", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "decoder_stage0_upsample2", "interpolation": "nearest"}, "name": "decoder_stage0_upsample2", "inbound_nodes": [[["decoder_stage0_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage0_conv2", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 128}, "name": "decoder_stage0_conv2", "inbound_nodes": [[["decoder_stage0_upsample2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "decoder_stage0_bn2", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true}, "name": "decoder_stage0_bn2", "inbound_nodes": [[["decoder_stage0_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage0_relu2", "activation": "relu"}, "name": "decoder_stage0_relu2", "inbound_nodes": [[["decoder_stage0_bn2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage0_conv3", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 256}, "name": "decoder_stage0_conv3", "inbound_nodes": [[["decoder_stage0_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "decoder_stage0_bn3", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true}, "name": "decoder_stage0_bn3", "inbound_nodes": [[["decoder_stage0_conv3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage0_relu3", "activation": "relu"}, "name": "decoder_stage0_relu3", "inbound_nodes": [[["decoder_stage0_bn3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_17"}, "name": "add_17", "inbound_nodes": [[["decoder_stage0_relu3", 0, 0, {}], ["stage4_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage1_conv1", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 64}, "name": "decoder_stage1_conv1", "inbound_nodes": [[["add_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "decoder_stage1_bn1", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true}, "name": "decoder_stage1_bn1", "inbound_nodes": [[["decoder_stage1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage1_relu1", "activation": "relu"}, "name": "decoder_stage1_relu1", "inbound_nodes": [[["decoder_stage1_bn1", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "decoder_stage1_upsample2", "interpolation": "nearest"}, "name": "decoder_stage1_upsample2", "inbound_nodes": [[["decoder_stage1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage1_conv2", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 64}, "name": "decoder_stage1_conv2", "inbound_nodes": [[["decoder_stage1_upsample2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "decoder_stage1_bn2", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true}, "name": "decoder_stage1_bn2", "inbound_nodes": [[["decoder_stage1_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage1_relu2", "activation": "relu"}, "name": "decoder_stage1_relu2", "inbound_nodes": [[["decoder_stage1_bn2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage1_conv3", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 128}, "name": "decoder_stage1_conv3", "inbound_nodes": [[["decoder_stage1_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "decoder_stage1_bn3", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true}, "name": "decoder_stage1_bn3", "inbound_nodes": [[["decoder_stage1_conv3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage1_relu3", "activation": "relu"}, "name": "decoder_stage1_relu3", "inbound_nodes": [[["decoder_stage1_bn3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_18"}, "name": "add_18", "inbound_nodes": [[["decoder_stage1_relu3", 0, 0, {}], ["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage2_conv1", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 32}, "name": "decoder_stage2_conv1", "inbound_nodes": [[["add_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "decoder_stage2_bn1", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true}, "name": "decoder_stage2_bn1", "inbound_nodes": [[["decoder_stage2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage2_relu1", "activation": "relu"}, "name": "decoder_stage2_relu1", "inbound_nodes": [[["decoder_stage2_bn1", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "decoder_stage2_upsample2", "interpolation": "nearest"}, "name": "decoder_stage2_upsample2", "inbound_nodes": [[["decoder_stage2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage2_conv2", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 32}, "name": "decoder_stage2_conv2", "inbound_nodes": [[["decoder_stage2_upsample2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "decoder_stage2_bn2", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true}, "name": "decoder_stage2_bn2", "inbound_nodes": [[["decoder_stage2_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "decoder_stage2_relu2", "activation": "relu"}, "name": "decoder_stage2_relu2", "inbound_nodes": [[["decoder_stage2_bn2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_stage2_conv3", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "use_bias": false, "filters": 64}, "name": "decoder_stage2_conv3", "inbound_nodes": [[["decoder_stage2_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "decoder_stage2_bn3", "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true}, "name": "decoder_stage2_bn3", "inbound_nodes": 