{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Model", "config": {"output_layers": [["sigmoid", 0, 0]], "input_layers": [["data", 0, 0]], "layers": [{"inbound_nodes": [], "name": "data", "class_name": "InputLayer", "config": {"sparse": false, "name": "data", "batch_input_shape": [null, 384, 384, 3], "dtype": "float32"}}, {"inbound_nodes": [[["data", 0, 0, {}]]], "name": "bn_data", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "bn_data", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["bn_data", 0, 0, {}]]], "name": "zero_padding2d_33", "class_name": "ZeroPadding2D", "config": {"padding": [[3, 3], [3, 3]], "data_format": "channels_last", "name": "zero_padding2d_33", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_33", 0, 0, {}]]], "name": "conv0", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [2, 2], "kernel_regularizer": null, "name": "conv0", "bias_constraint": null, "filters": 64, "trainable": true, "activity_regularizer": null, "kernel_size": [7, 7], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["conv0", 0, 0, {}]]], "name": "bn0", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "bn0", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["bn0", 0, 0, {}]]], "name": "relu0", "class_name": "Activation", "config": {"name": "relu0", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["relu0", 0, 0, {}]]], "name": "zero_padding2d_34", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_34", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_34", 0, 0, {}]]], "name": "pooling0", "class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [3, 3], "strides": [2, 2], "data_format": "channels_last", "name": "pooling0", "trainable": true}}, {"inbound_nodes": [[["pooling0", 0, 0, {}]]], "name": "stage1_unit1_bn1", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage1_unit1_bn1", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]], "name": "stage1_unit1_relu1", "class_name": "Activation", "config": {"name": "stage1_unit1_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "name": "zero_padding2d_35", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_35", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_35", 0, 0, {}]]], "name": "stage1_unit1_conv1", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage1_unit1_conv1", "bias_constraint": null, "filters": 64, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]], "name": "stage1_unit1_bn2", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage1_unit1_bn2", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]], "name": "stage1_unit1_relu2", "class_name": "Activation", "config": {"name": "stage1_unit1_relu2", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]], "name": "zero_padding2d_36", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_36", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_36", 0, 0, {}]]], "name": "stage1_unit1_conv2", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage1_unit1_conv2", "bias_constraint": null, "filters": 64, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "name": "stage1_unit1_sc", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage1_unit1_sc", "bias_constraint": null, "filters": 64, "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]], "name": "add_15", "class_name": "Add", "config": {"name": "add_15", "trainable": true}}, {"inbound_nodes": [[["add_15", 0, 0, {}]]], "name": "stage1_unit2_bn1", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage1_unit2_bn1", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]], "name": "stage1_unit2_relu1", "class_name": "Activation", "config": {"name": "stage1_unit2_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]], "name": "zero_padding2d_37", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_37", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_37", 0, 0, {}]]], "name": "stage1_unit2_conv1", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage1_unit2_conv1", "bias_constraint": null, "filters": 64, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]], "name": "stage1_unit2_bn2", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage1_unit2_bn2", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]], "name": "stage1_unit2_relu2", "class_name": "Activation", "config": {"name": "stage1_unit2_relu2", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]], "name": "zero_padding2d_38", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_38", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_38", 0, 0, {}]]], "name": "stage1_unit2_conv2", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage1_unit2_conv2", "bias_constraint": null, "filters": 64, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_15", 0, 0, {}]]], "name": "add_16", "class_name": "Add", "config": {"name": "add_16", "trainable": true}}, {"inbound_nodes": [[["add_16", 0, 0, {}]]], "name": "stage2_unit1_bn1", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage2_unit1_bn1", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]], "name": "stage2_unit1_relu1", "class_name": "Activation", "config": {"name": "stage2_unit1_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "name": "zero_padding2d_39", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_39", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_39", 0, 0, {}]]], "name": "stage2_unit1_conv1", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [2, 2], "kernel_regularizer": null, "name": "stage2_unit1_conv1", "bias_constraint": null, "filters": 128, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]], "name": "stage2_unit1_bn2", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage2_unit1_bn2", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]], "name": "stage2_unit1_relu2", "class_name": "Activation", "config": {"name": "stage2_unit1_relu2", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]], "name": "zero_padding2d_40", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_40", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_40", 0, 0, {}]]], "name": "stage2_unit1_conv2", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage2_unit1_conv2", "bias_constraint": null, "filters": 128, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "name": "stage2_unit1_sc", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [2, 2], "kernel_regularizer": null, "name": "stage2_unit1_sc", "bias_constraint": null, "filters": 128, "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]], "name": "add_17", "class_name": "Add", "config": {"name": "add_17", "trainable": true}}, {"inbound_nodes": [[["add_17", 0, 0, {}]]], "name": "stage2_unit2_bn1", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage2_unit2_bn1", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]], "name": "stage2_unit2_relu1", "class_name": "Activation", "config": {"name": "stage2_unit2_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]], "name": "zero_padding2d_41", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_41", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_41", 0, 0, {}]]], "name": "stage2_unit2_conv1", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage2_unit2_conv1", "bias_constraint": null, "filters": 128, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]], "name": "stage2_unit2_bn2", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage2_unit2_bn2", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]], "name": "stage2_unit2_relu2", "class_name": "Activation", "config": {"name": "stage2_unit2_relu2", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]], "name": "zero_padding2d_42", "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_42", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_42", 0, 0, {}]]], "name": "stage2_unit2_conv2", "class_name": "Conv2D", "config": {"padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "stage2_unit2_conv2", "bias_constraint": null, "filters": 128, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_17", 0, 0, {}]]], "name": "add_18", "class_name": "Add", "config": {"name": "add_18", "trainable": true}}, {"inbound_nodes": [[["add_18", 0, 0, {}]]], "name": "stage3_unit1_bn1", "class_name": "BatchNormalization", "config": {"axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "stage3_unit1_bn1", "trainable": true, "epsilon": 2e-05, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]], "name": "stage3_unit1_relu1", "class_name": "Activation", "config": {"name": "stage3_unit1_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "name": "average_pooling2d_5", "class_name": "AveragePooling2D", "config": {"padding": "same", "pool_size": [48, 48], "strides": [48, 48], "data_format": "channels_last", "name": "average_pooling2d_5", "trainable": true}}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "name": "average_pooling2d_6", "class_name": "AveragePooling2D", "config": {"padding": "same", "pool_size": [24, 24], "strides": [24, 24], "data_format": "channels_last", "name": "average_pooling2d_6", "trainable": true}}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "name": "average_pooling2d_7", "class_name": "AveragePooling2D", "config": {"padding": "same", "pool_size": [16, 16], "strides": [16, 16], "data_format": "channels_last", "name": "average_pooling2d_7", "trainable": true}}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "name": "average_pooling2d_8", "class_name": "AveragePooling2D", "config": {"padding": "same", "pool_size": [8, 8], "strides": [8, 8], "data_format": "channels_last", "name": "average_pooling2d_8", "trainable": true}}, {"inbound_nodes": [[["average_pooling2d_5", 0, 0, {}]]], "name": "level1_conv", "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "level1_conv", "bias_constraint": null, "filters": 512, "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["average_pooling2d_6", 0, 0, {}]]], "name": "level2_conv", "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "level2_conv", "bias_constraint": null, "filters": 512, "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["average_pooling2d_7", 0, 0, {}]]], "name": "level3_conv", "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "level3_conv", "bias_constraint": null, "filters": 512, "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["average_pooling2d_8", 0, 0, {}]]], "name": "level6_conv", "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "level6_conv", "bias_constraint": null, "filters": 512, "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["level1_conv", 0, 0, {}]]], "name": "level1_bn", "class_name": "BatchNormalization", "config": {"axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "level1_bn", "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["level2_conv", 0, 0, {}]]], "name": "level2_bn", "class_name": "BatchNormalization", "config": {"axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "level2_bn", "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["level3_conv", 0, 0, {}]]], "name": "level3_bn", "class_name": "BatchNormalization", "config": {"axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "level3_bn", "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["level6_conv", 0, 0, {}]]], "name": "level6_bn", "class_name": "BatchNormalization", "config": {"axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "level6_bn", "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["level1_bn", 0, 0, {}]]], "name": "level1_relu", "class_name": "Activation", "config": {"name": "level1_relu", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["level2_bn", 0, 0, {}]]], "name": "level2_relu", "class_name": "Activation", "config": {"name": "level2_relu", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["level3_bn", 0, 0, {}]]], "name": "level3_relu", "class_name": "Activation", "config": {"name": "level3_relu", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["level6_bn", 0, 0, {}]]], "name": "level6_relu", "class_name": "Activation", "config": {"name": "level6_relu", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["level1_relu", 0, 0, {}]]], "name": "resize_image_6", "class_name": "ResizeImage", "config": {"data_format": "channels_last", "name": "resize_image_6", "trainable": true, "factor": [48, 48]}}, {"inbound_nodes": [[["level2_relu", 0, 0, {}]]], "name": "resize_image_7", "class_name": "ResizeImage", "config": {"data_format": "channels_last", "name": "resize_image_7", "trainable": true, "factor": [24, 24]}}, {"inbound_nodes": [[["level3_relu", 0, 0, {}]]], "name": "resize_image_8", "class_name": "ResizeImage", "config": {"data_format": "channels_last", "name": "resize_image_8", "trainable": true, "factor": [16, 16]}}, {"inbound_nodes": [[["level6_relu", 0, 0, {}]]], "name": "resize_image_9", "class_name": "ResizeImage", "config": {"data_format": "channels_last", "name": "resize_image_9", "trainable": true, "factor": [8, 8]}}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}], ["resize_image_6", 0, 0, {}], ["resize_image_7", 0, 0, {}], ["resize_image_8", 0, 0, {}], ["resize_image_9", 0, 0, {}]]], "name": "concatenate_2", "class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_2", "trainable": true}}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "conv_block_conv", "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv_block_conv", "bias_constraint": null, "filters": 512, "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["conv_block_conv", 0, 0, {}]]], "name": "conv_block_bn", "class_name": "BatchNormalization", "config": {"axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "name": "conv_block_bn", "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["conv_block_bn", 0, 0, {}]]], "name": "conv_block_relu", "class_name": "Activation", "config": {"name": "conv_block_relu", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["conv_block_relu", 0, 0, {}]]], "name": "final_conv", "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "name": "final_conv", "bias_constraint": null, "filters": 1, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["final_conv", 0, 0, {}]]], "name": "resize_image_10", "class_name": "ResizeImage", "config": {"data_format": "channels_last", "name": "resize_image_10", "trainable": true, "factor": [8, 8]}}, {"inbound_nodes": [[["resize_image_10", 0, 0, {}]]], "name": "sigmoid", "class_name": "Activation", "config": {"name": "sigmoid", "trainable": true, "activation": "sigmoid"}}], "name": "psp-resnet18"}}