{"keras_version": "2.2.4", "class_name": "Model", "backend": "tensorflow", "config": {"name": "u-resnet34", "output_layers": [["sigmoid", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "sparse": false, "dtype": "float32", "name": "data"}, "inbound_nodes": [], "name": "data"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "bn_data", "scale": false, "momentum": 0.99}, "inbound_nodes": [[["data", 0, 0, {}]]], "name": "bn_data"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[3, 3], [3, 3]], "trainable": true, "name": "zero_padding2d_19"}, "inbound_nodes": [[["bn_data", 0, 0, {}]]], "name": "zero_padding2d_19"}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [7, 7], "trainable": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "conv0", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_19", 0, 0, {}]]], "name": "conv0"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "bn0", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["conv0", 0, 0, {}]]], "name": "bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu0"}, "inbound_nodes": [[["bn0", 0, 0, {}]]], "name": "relu0"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_20"}, "inbound_nodes": [[["relu0", 0, 0, {}]]], "name": "zero_padding2d_20"}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "name": "pooling0"}, "inbound_nodes": [[["zero_padding2d_20", 0, 0, {}]]], "name": "pooling0"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage1_unit1_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["pooling0", 0, 0, {}]]], "name": "stage1_unit1_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit1_relu1"}, "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]], "name": "stage1_unit1_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_21"}, "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "name": "zero_padding2d_21"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage1_unit1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_21", 0, 0, {}]]], "name": "stage1_unit1_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage1_unit1_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]], "name": "stage1_unit1_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit1_relu2"}, "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]], "name": "stage1_unit1_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_22"}, "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]], "name": "zero_padding2d_22"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage1_unit1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_22", 0, 0, {}]]], "name": "stage1_unit1_conv2"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [1, 1], "trainable": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage1_unit1_sc", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "name": "stage1_unit1_sc"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_9"}, "inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]], "name": "add_9"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage1_unit2_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "stage1_unit2_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit2_relu1"}, "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]], "name": "stage1_unit2_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_23"}, "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]], "name": "zero_padding2d_23"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage1_unit2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_23", 0, 0, {}]]], "name": "stage1_unit2_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage1_unit2_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]], "name": "stage1_unit2_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit2_relu2"}, "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]], "name": "stage1_unit2_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_24"}, "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]], "name": "zero_padding2d_24"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage1_unit2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_24", 0, 0, {}]]], "name": "stage1_unit2_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_10"}, "inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_9", 0, 0, {}]]], "name": "add_10"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage1_unit3_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_10", 0, 0, {}]]], "name": "stage1_unit3_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit3_relu1"}, "inbound_nodes": [[["stage1_unit3_bn1", 0, 0, {}]]], "name": "stage1_unit3_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_25"}, "inbound_nodes": [[["stage1_unit3_relu1", 0, 0, {}]]], "name": "zero_padding2d_25"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage1_unit3_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_25", 0, 0, {}]]], "name": "stage1_unit3_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage1_unit3_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage1_unit3_conv1", 0, 0, {}]]], "name": "stage1_unit3_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit3_relu2"}, "inbound_nodes": [[["stage1_unit3_bn2", 0, 0, {}]]], "name": "stage1_unit3_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_26"}, "inbound_nodes": [[["stage1_unit3_relu2", 0, 0, {}]]], "name": "zero_padding2d_26"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage1_unit3_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_26", 0, 0, {}]]], "name": "stage1_unit3_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_11"}, "inbound_nodes": [[["stage1_unit3_conv2", 0, 0, {}], ["add_10", 0, 0, {}]]], "name": "add_11"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage2_unit1_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_11", 0, 0, {}]]], "name": "stage2_unit1_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit1_relu1"}, "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]], "name": "stage2_unit1_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_27"}, "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "name": "zero_padding2d_27"}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage2_unit1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_27", 0, 0, {}]]], "name": "stage2_unit1_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage2_unit1_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]], "name": "stage2_unit1_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit1_relu2"}, "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]], "name": "stage2_unit1_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_28"}, "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]], "name": "zero_padding2d_28"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage2_unit1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_28", 0, 0, {}]]], "name": "stage2_unit1_conv2"}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [1, 1], "trainable": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage2_unit1_sc", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "name": "stage2_unit1_sc"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_12"}, "inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]], "name": "add_12"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage2_unit2_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_12", 0, 0, {}]]], "name": "stage2_unit2_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit2_relu1"}, "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]], "name": "stage2_unit2_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_29"}, "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]], "name": "zero_padding2d_29"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage2_unit2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_29", 0, 0, {}]]], "name": "stage2_unit2_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage2_unit2_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]], "name": "stage2_unit2_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit2_relu2"}, "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]], "name": "stage2_unit2_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_30"}, "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]], "name": "zero_padding2d_30"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage2_unit2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_30", 0, 0, {}]]], "name": "stage2_unit2_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_13"}, "inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_12", 0, 0, {}]]], "name": "add_13"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage2_unit3_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_13", 0, 0, {}]]], "name": "stage2_unit3_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit3_relu1"}, "inbound_nodes": [[["stage2_unit3_bn1", 0, 0, {}]]], "name": "stage2_unit3_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_31"}, "inbound_nodes": [[["stage2_unit3_relu1", 0, 0, {}]]], "name": "zero_padding2d_31"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage2_unit3_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_31", 0, 0, {}]]], "name": "stage2_unit3_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage2_unit3_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage2_unit3_conv1", 0, 0, {}]]], "name": "stage2_unit3_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit3_relu2"}, "inbound_nodes": [[["stage2_unit3_bn2", 0, 0, {}]]], "name": "stage2_unit3_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_32"}, "inbound_nodes": [[["stage2_unit3_relu2", 0, 0, {}]]], "name": "zero_padding2d_32"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage2_unit3_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_32", 0, 0, {}]]], "name": "stage2_unit3_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_14"}, "inbound_nodes": [[["stage2_unit3_conv2", 0, 0, {}], ["add_13", 0, 0, {}]]], "name": "add_14"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage2_unit4_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_14", 0, 0, {}]]], "name": "stage2_unit4_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit4_relu1"}, "inbound_nodes": [[["stage2_unit4_bn1", 0, 0, {}]]], "name": "stage2_unit4_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_33"}, "inbound_nodes": [[["stage2_unit4_relu1", 0, 0, {}]]], "name": "zero_padding2d_33"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage2_unit4_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_33", 0, 0, {}]]], "name": "stage2_unit4_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage2_unit4_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage2_unit4_conv1", 0, 0, {}]]], "name": "stage2_unit4_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit4_relu2"}, "inbound_nodes": [[["stage2_unit4_bn2", 0, 0, {}]]], "name": "stage2_unit4_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_34"}, "inbound_nodes": [[["stage2_unit4_relu2", 0, 0, {}]]], "name": "zero_padding2d_34"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage2_unit4_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_34", 0, 0, {}]]], "name": "stage2_unit4_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_15"}, "inbound_nodes": [[["stage2_unit4_conv2", 0, 0, {}], ["add_14", 0, 0, {}]]], "name": "add_15"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage3_unit1_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_15", 0, 0, {}]]], "name": "stage3_unit1_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit1_relu1"}, "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]], "name": "stage3_unit1_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_35"}, "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "name": "zero_padding2d_35"}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage3_unit1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_35", 0, 0, {}]]], "name": "stage3_unit1_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage3_unit1_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]], "name": "stage3_unit1_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit1_relu2"}, "inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]], "name": "stage3_unit1_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_36"}, "inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]], "name": "zero_padding2d_36"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage3_unit1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_36", 0, 0, {}]]], "name": "stage3_unit1_conv2"}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [1, 1], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage3_unit1_sc", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "name": "stage3_unit1_sc"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_16"}, "inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]], "name": "add_16"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage3_unit2_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_16", 0, 0, {}]]], "name": "stage3_unit2_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit2_relu1"}, "inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]], "name": "stage3_unit2_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_37"}, "inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]], "name": "zero_padding2d_37"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage3_unit2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_37", 0, 0, {}]]], "name": "stage3_unit2_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage3_unit2_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]], "name": "stage3_unit2_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit2_relu2"}, "inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]], "name": "stage3_unit2_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_38"}, "inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]], "name": "zero_padding2d_38"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage3_unit2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_38", 0, 0, {}]]], "name": "stage3_unit2_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_17"}, "inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_16", 0, 0, {}]]], "name": "add_17"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage3_unit3_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_17", 0, 0, {}]]], "name": "stage3_unit3_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit3_relu1"}, "inbound_nodes": [[["stage3_unit3_bn1", 0, 0, {}]]], "name": "stage3_unit3_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_39"}, "inbound_nodes": [[["stage3_unit3_relu1", 0, 0, {}]]], "name": "zero_padding2d_39"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage3_unit3_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_39", 0, 0, {}]]], "name": "stage3_unit3_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage3_unit3_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage3_unit3_conv1", 0, 0, {}]]], "name": "stage3_unit3_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit3_relu2"}, "inbound_nodes": [[["stage3_unit3_bn2", 0, 0, {}]]], "name": "stage3_unit3_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_40"}, "inbound_nodes": [[["stage3_unit3_relu2", 0, 0, {}]]], "name": "zero_padding2d_40"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage3_unit3_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_40", 0, 0, {}]]], "name": "stage3_unit3_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_18"}, "inbound_nodes": [[["stage3_unit3_conv2", 0, 0, {}], ["add_17", 0, 0, {}]]], "name": "add_18"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage3_unit4_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_18", 0, 0, {}]]], "name": "stage3_unit4_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit4_relu1"}, "inbound_nodes": [[["stage3_unit4_bn1", 0, 0, {}]]], "name": "stage3_unit4_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_41"}, "inbound_nodes": [[["stage3_unit4_relu1", 0, 0, {}]]], "name": "zero_padding2d_41"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage3_unit4_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_41", 0, 0, {}]]], "name": "stage3_unit4_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage3_unit4_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage3_unit4_conv1", 0, 0, {}]]], "name": "stage3_unit4_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit4_relu2"}, "inbound_nodes": [[["stage3_unit4_bn2", 0, 0, {}]]], "name": "stage3_unit4_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_42"}, "inbound_nodes": [[["stage3_unit4_relu2", 0, 0, {}]]], "name": "zero_padding2d_42"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage3_unit4_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_42", 0, 0, {}]]], "name": "stage3_unit4_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_19"}, "inbound_nodes": [[["stage3_unit4_conv2", 0, 0, {}], ["add_18", 0, 0, {}]]], "name": "add_19"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage3_unit5_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_19", 0, 0, {}]]], "name": "stage3_unit5_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit5_relu1"}, "inbound_nodes": [[["stage3_unit5_bn1", 0, 0, {}]]], "name": "stage3_unit5_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_43"}, "inbound_nodes": [[["stage3_unit5_relu1", 0, 0, {}]]], "name": "zero_padding2d_43"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage3_unit5_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_43", 0, 0, {}]]], "name": "stage3_unit5_conv1"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage3_unit5_bn2", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["stage3_unit5_conv1", 0, 0, {}]]], "name": "stage3_unit5_bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit5_relu2"}, "inbound_nodes": [[["stage3_unit5_bn2", 0, 0, {}]]], "name": "stage3_unit5_relu2"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_44"}, "inbound_nodes": [[["stage3_unit5_relu2", 0, 0, {}]]], "name": "zero_padding2d_44"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "stage3_unit5_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_44", 0, 0, {}]]], "name": "stage3_unit5_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_20"}, "inbound_nodes": [[["stage3_unit5_conv2", 0, 0, {}], ["add_19", 0, 0, {}]]], "name": "add_20"}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "gamma_regularizer": null, "center": true, "name": "stage3_unit6_bn1", "scale": true, "momentum": 0.99}, "inbound_nodes": [[["add_20", 0, 0, {}]]], "name": "stage3_unit6_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit6_relu1"}, "inbound_nodes": [[["stage3_unit6_bn1", 0, 0, {}]]], "name": "stage3_unit6_relu1"}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_45"}, "inbound_nodes": [[["stage3_unit6_relu1", 0, 0, {}]]], "name": "zero_padding2d_45"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "trainable": true, "filters": 256, 