{"class_name": "Model", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"input_layers": [["data", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 384, 384, 3], "name": "data"}, "name": "data"}, {"inbound_nodes": [[["data", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "bn_data", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "bn_data"}, {"inbound_nodes": [[["bn_data", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[3, 3], [3, 3]], "trainable": true, "name": "zero_padding2d_181"}, "name": "zero_padding2d_181"}, {"inbound_nodes": [[["zero_padding2d_181", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [7, 7], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "conv0", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "conv0"}, {"inbound_nodes": [[["conv0", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "bn0", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "bn0"}, {"inbound_nodes": [[["bn0", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu0"}, "name": "relu0"}, {"inbound_nodes": [[["relu0", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_182"}, "name": "zero_padding2d_182"}, {"inbound_nodes": [[["zero_padding2d_182", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "trainable": true, "name": "pooling0", "data_format": "channels_last", "pool_size": [3, 3]}, "name": "pooling0"}, {"inbound_nodes": [[["pooling0", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage1_unit1_bn1", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage1_unit1_bn1"}, {"inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit1_relu1"}, "name": "stage1_unit1_relu1"}, {"inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_183"}, "name": "zero_padding2d_183"}, {"inbound_nodes": [[["zero_padding2d_183", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "stage1_unit1_conv1", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage1_unit1_conv1"}, {"inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage1_unit1_bn2", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage1_unit1_bn2"}, {"inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit1_relu2"}, "name": "stage1_unit1_relu2"}, {"inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_184"}, "name": "zero_padding2d_184"}, {"inbound_nodes": [[["zero_padding2d_184", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "stage1_unit1_conv2", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage1_unit1_conv2"}, {"inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "stage1_unit1_sc", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage1_unit1_sc"}, {"inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_97"}, "name": "add_97"}, {"inbound_nodes": [[["add_97", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage1_unit2_bn1", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage1_unit2_bn1"}, {"inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit2_relu1"}, "name": "stage1_unit2_relu1"}, {"inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_185"}, "name": "zero_padding2d_185"}, {"inbound_nodes": [[["zero_padding2d_185", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "stage1_unit2_conv1", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage1_unit2_conv1"}, {"inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage1_unit2_bn2", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage1_unit2_bn2"}, {"inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage1_unit2_relu2"}, "name": "stage1_unit2_relu2"}, {"inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_186"}, "name": "zero_padding2d_186"}, {"inbound_nodes": [[["zero_padding2d_186", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "stage1_unit2_conv2", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage1_unit2_conv2"}, {"inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_97", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_98"}, "name": "add_98"}, {"inbound_nodes": [[["add_98", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage2_unit1_bn1", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage2_unit1_bn1"}, {"inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit1_relu1"}, "name": "stage2_unit1_relu1"}, {"inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_187"}, "name": "zero_padding2d_187"}, {"inbound_nodes": [[["zero_padding2d_187", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "name": "stage2_unit1_conv1", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage2_unit1_conv1"}, {"inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage2_unit1_bn2", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage2_unit1_bn2"}, {"inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit1_relu2"}, "name": "stage2_unit1_relu2"}, {"inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_188"}, "name": "zero_padding2d_188"}, {"inbound_nodes": [[["zero_padding2d_188", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "name": "stage2_unit1_conv2", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage2_unit1_conv2"}, {"inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "name": "stage2_unit1_sc", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage2_unit1_sc"}, {"inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_99"}, "name": "add_99"}, {"inbound_nodes": [[["add_99", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage2_unit2_bn1", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage2_unit2_bn1"}, {"inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit2_relu1"}, "name": "stage2_unit2_relu1"}, {"inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_189"}, "name": "zero_padding2d_189"}, {"inbound_nodes": [[["zero_padding2d_189", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "name": "stage2_unit2_conv1", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage2_unit2_conv1"}, {"inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage2_unit2_bn2", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage2_unit2_bn2"}, {"inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage2_unit2_relu2"}, "name": "stage2_unit2_relu2"}, {"inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_190"}, "name": "zero_padding2d_190"}, {"inbound_nodes": [[["zero_padding2d_190", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "name": "stage2_unit2_conv2", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "stage2_unit2_conv2"}, {"inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_99", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_100"}, "name": "add_100"}, {"inbound_nodes": [[["add_100", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "stage3_unit1_bn1", "beta_constraint": null, "epsilon": 2e-05, "center": true}, "name": "stage3_unit1_bn1"}, {"inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "stage3_unit1_relu1"}, "name": "stage3_unit1_relu1"}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"strides": [48, 48], "padding": "same", "trainable": true, "name": "average_pooling2d_13", "data_format": "channels_last", "pool_size": [48, 48]}, "name": "average_pooling2d_13"}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"strides": [24, 24], "padding": "same", "trainable": true, "name": "average_pooling2d_14", "data_format": "channels_last", "pool_size": [24, 24]}, "name": "average_pooling2d_14"}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"strides": [16, 16], "padding": "same", "trainable": true, "name": "average_pooling2d_15", "data_format": "channels_last", "pool_size": [16, 16]}, "name": "average_pooling2d_15"}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"strides": [8, 8], "padding": "same", "trainable": true, "name": "average_pooling2d_16", "data_format": "channels_last", "pool_size": [8, 8]}, "name": "average_pooling2d_16"}, {"inbound_nodes": [[["average_pooling2d_13", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "padding": "same", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "name": "level1_conv", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "level1_conv"}, {"inbound_nodes": [[["average_pooling2d_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "padding": "same", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "name": "level2_conv", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "level2_conv"}, {"inbound_nodes": [[["average_pooling2d_15", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "padding": "same", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "name": "level3_conv", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "level3_conv"}, {"inbound_nodes": [[["average_pooling2d_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "padding": "same", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "name": "level6_conv", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "level6_conv"}, {"inbound_nodes": [[["level1_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "level1_bn", "beta_constraint": null, "epsilon": 0.001, "center": true}, "name": "level1_bn"}, {"inbound_nodes": [[["level2_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "level2_bn", "beta_constraint": null, "epsilon": 0.001, "center": true}, "name": "level2_bn"}, {"inbound_nodes": [[["level3_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "level3_bn", "beta_constraint": null, "epsilon": 0.001, "center": true}, "name": "level3_bn"}, {"inbound_nodes": [[["level6_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "level6_bn", "beta_constraint": null, "epsilon": 0.001, "center": true}, "name": "level6_bn"}, {"inbound_nodes": [[["level1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "level1_relu"}, "name": "level1_relu"}, {"inbound_nodes": [[["level2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "level2_relu"}, "name": "level2_relu"}, {"inbound_nodes": [[["level3_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "level3_relu"}, "name": "level3_relu"}, {"inbound_nodes": [[["level6_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "level6_relu"}, "name": "level6_relu"}, {"inbound_nodes": [[["level1_relu", 0, 0, {}]]], "class_name": "ResizeImage", "config": {"data_format": "channels_last", "name": "resize_image_16", "trainable": true, "factor": [48, 48]}, "name": "resize_image_16"}, {"inbound_nodes": [[["level2_relu", 0, 0, {}]]], "class_name": "ResizeImage", "config": {"data_format": "channels_last", "name": "resize_image_17", "trainable": true, "factor": [24, 24]}, "name": "resize_image_17"}, {"inbound_nodes": [[["level3_relu", 0, 0, {}]]], "class_name": "ResizeImage", "config": {"data_format": "channels_last", "name": "resize_image_18", "trainable": true, "factor": [16, 16]}, "name": "resize_image_18"}, {"inbound_nodes": [[["level6_relu", 0, 0, {}]]], "class_name": "ResizeImage", "config": {"data_format": "channels_last", "name": "resize_image_19", "trainable": true, "factor": [8, 8]}, "name": "resize_image_19"}, {"inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}], ["resize_image_16", 0, 0, {}], ["resize_image_17", 0, 0, {}], ["resize_image_18", 0, 0, {}], ["resize_image_19", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_16"}, "name": "concatenate_16"}, {"inbound_nodes": [[["concatenate_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "padding": "same", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "name": "conv_block_conv", "kernel_constraint": null, "bias_constraint": null, "use_bias": false, "kernel_regularizer": null}, "name": "conv_block_conv"}, {"inbound_nodes": [[["conv_block_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "conv_block_bn", "beta_constraint": null, "epsilon": 0.001, "center": true}, "name": "conv_block_bn"}, {"inbound_nodes": [[["conv_block_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv_block_relu"}, "name": "conv_block_relu"}, {"inbound_nodes": [[["conv_block_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1, "name": "final_conv", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null}, "name": "final_conv"}, {"inbound_nodes": [[["final_conv", 0, 0, {}]]], "class_name": "ResizeImage", "config": {"data_format": "channels_last", "name": "resize_image_20", "trainable": true, "factor": [8, 8]}, "name": "resize_image_20"}, {"inbound_nodes": [[["resize_image_20", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "sigmoid"}, "name": "sigmoid"}], "output_layers": [["sigmoid", 0, 0]], "name": "psp-resnet18"}}