{"config": {"name": "model_1", "layers": [{"name": "input_1", "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 224, 224, 3]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "lambda_1", "config": {"name": "lambda_1", "trainable": true, "function_type": "lambda", "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAEAAABTAAAAcwQAAAB8AABTKQFOqQApAdoBeHIBAAAAcgEAAAD6Wi9ob21l\nL2FqdXNrYS9Eb2t1bWVudHkvU2tvbGEvdW5ldF9pbXBsZW1lbnRhdGlvbi92ZXNzZWxfc2VnbWVu\ndGF0aW9uL3VuZXRfcHJvamVjdC91X25ldC5wedoIPGxhbWJkYT4UAAAA8wAAAAA=\n", null, null], "output_shape": null, "arguments": {}}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Lambda"}, {"name": "conv2d_1", "config": {"trainable": true, "filters": 16, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_1", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_2", "config": {"trainable": true, "filters": 16, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_2", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_3", "config": {"trainable": true, "filters": 32, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_3", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_4", "config": {"trainable": true, "filters": 32, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_4", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_5", "config": {"trainable": true, "filters": 64, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_5", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "dropout_3", "config": {"name": "dropout_3", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_6", "config": {"trainable": true, "filters": 64, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_6", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pooling2d_3", "config": {"name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_7", "config": {"trainable": true, "filters": 128, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_7", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "dropout_4", "config": {"name": "dropout_4", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_8", "config": {"trainable": true, "filters": 128, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_8", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pooling2d_4", "config": {"name": "max_pooling2d_4", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_9", "config": {"trainable": true, "filters": 256, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_9", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "dropout_5", "config": {"name": "dropout_5", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_10", "config": {"trainable": true, "filters": 256, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_10", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_transpose_1", "config": {"trainable": true, "filters": 128, "kernel_size": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "output_padding": null, "kernel_constraint": null, "name": "conv2d_transpose_1", "bias_constraint": null, "strides": [2, 2], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "concatenate_1", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}], ["conv2d_8", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "conv2d_11", "config": {"trainable": true, "filters": 128, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_11", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "dropout_6", "config": {"name": "dropout_6", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_12", "config": {"trainable": true, "filters": 128, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_12", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_transpose_2", "config": {"trainable": true, "filters": 64, "kernel_size": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "output_padding": null, "kernel_constraint": null, "name": "conv2d_transpose_2", "bias_constraint": null, "strides": [2, 2], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "concatenate_2", "config": {"name": "concatenate_2", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}], ["conv2d_6", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "conv2d_13", "config": {"trainable": true, "filters": 64, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_13", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "dropout_7", "config": {"name": "dropout_7", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_14", "config": {"trainable": true, "filters": 64, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_14", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_transpose_3", "config": {"trainable": true, "filters": 32, "kernel_size": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "output_padding": null, "kernel_constraint": null, "name": "conv2d_transpose_3", "bias_constraint": null, "strides": [2, 2], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "concatenate_3", "config": {"name": "concatenate_3", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}], ["conv2d_4", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "conv2d_15", "config": {"trainable": true, "filters": 32, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_15", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "dropout_8", "config": {"name": "dropout_8", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_16", "config": {"trainable": true, "filters": 32, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_16", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_transpose_4", "config": {"trainable": true, "filters": 16, "kernel_size": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "output_padding": null, "kernel_constraint": null, "name": "conv2d_transpose_4", "bias_constraint": null, "strides": [2, 2], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "concatenate_4", "config": {"name": "concatenate_4", "trainable": true, "axis": 3}, "inbound_nodes": [[["conv2d_transpose_4", 0, 0, {}], ["conv2d_2", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "conv2d_17", "config": {"trainable": true, "filters": 16, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_17", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "dropout_9", "config": {"name": "dropout_9", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_18", "config": {"trainable": true, "filters": 16, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_18", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "activation": "elu"}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_19", "config": {"trainable": true, "filters": 1, "kernel_size": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_19", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "valid", "use_bias": true, "bias_regularizer": null, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "Conv2D"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_19", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4"}