{"config": {"name": "model_1", "layers": [{"config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"function": ["4wEAAAAAAAAAAQAAAAEAAABTAAAAcwQAAAB8AABTKQFOqQApAdoBeHIBAAAAcgEAAAD6Wi9ob21l\nL2FqdXNrYS9Eb2t1bWVudHkvU2tvbGEvdW5ldF9pbXBsZW1lbnRhdGlvbi92ZXNzZWxfc2VnbWVu\ndGF0aW9uL3VuZXRfcHJvamVjdC91X25ldC5wedoIPGxhbWJkYT4UAAAA8wAAAAA=\n", null, null], "arguments": {}, "function_type": "lambda", "output_shape_type": "raw", "output_shape": null, "trainable": true, "name": "lambda_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_1", "class_name": "Lambda"}, {"config": {"filters": 16, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D"}, {"config": {"rate": 0.1, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"filters": 16, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "max_pooling2d_1", "class_name": "MaxPooling2D"}, {"config": {"filters": 32, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D"}, {"config": {"rate": 0.1, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_2"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout"}, {"config": {"filters": 32, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "max_pooling2d_2", "class_name": "MaxPooling2D"}, {"config": {"filters": 64, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D"}, {"config": {"rate": 0.2, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_3"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "dropout_3", "class_name": "Dropout"}, {"config": {"filters": 64, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_3"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "max_pooling2d_3", "class_name": "MaxPooling2D"}, {"config": {"filters": 128, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_7", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D"}, {"config": {"rate": 0.2, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_4"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "dropout_4", "class_name": "Dropout"}, {"config": {"filters": 128, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_8", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_4"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "max_pooling2d_4", "class_name": "MaxPooling2D"}, {"config": {"filters": 256, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_9", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "conv2d_9", "class_name": "Conv2D"}, {"config": {"rate": 0.3, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_5"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "dropout_5", "class_name": "Dropout"}, {"config": {"filters": 256, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_10", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "name": "conv2d_10", "class_name": "Conv2D"}, {"config": {"output_padding": null, "filters": 128, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_transpose_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [2, 2], "use_bias": true, "activation": "linear", "kernel_regularizer": null, "kernel_size": [2, 2], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "conv2d_transpose_1", "class_name": "Conv2DTranspose"}, {"config": {"axis": -1, "trainable": true, "name": "concatenate_1"}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}], ["conv2d_8", 0, 0, {}]]], "name": "concatenate_1", "class_name": "Concatenate"}, {"config": {"filters": 128, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_11", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "conv2d_11", "class_name": "Conv2D"}, {"config": {"rate": 0.2, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_6"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "dropout_6", "class_name": "Dropout"}, {"config": {"filters": 128, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_12", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "name": "conv2d_12", "class_name": "Conv2D"}, {"config": {"output_padding": null, "filters": 64, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_transpose_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [2, 2], "use_bias": true, "activation": "linear", "kernel_regularizer": null, "kernel_size": [2, 2], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "conv2d_transpose_2", "class_name": "Conv2DTranspose"}, {"config": {"axis": -1, "trainable": true, "name": "concatenate_2"}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}], ["conv2d_6", 0, 0, {}]]], "name": "concatenate_2", "class_name": "Concatenate"}, {"config": {"filters": 64, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_13", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "conv2d_13", "class_name": "Conv2D"}, {"config": {"rate": 0.2, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_7"}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "dropout_7", "class_name": "Dropout"}, {"config": {"filters": 64, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_14", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "name": "conv2d_14", "class_name": "Conv2D"}, {"config": {"output_padding": null, "filters": 32, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_transpose_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [2, 2], "use_bias": true, "activation": "linear", "kernel_regularizer": null, "kernel_size": [2, 2], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "conv2d_transpose_3", "class_name": "Conv2DTranspose"}, {"config": {"axis": -1, "trainable": true, "name": "concatenate_3"}, "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}], ["conv2d_4", 0, 0, {}]]], "name": "concatenate_3", "class_name": "Concatenate"}, {"config": {"filters": 32, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_15", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "conv2d_15", "class_name": "Conv2D"}, {"config": {"rate": 0.1, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_8"}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "dropout_8", "class_name": "Dropout"}, {"config": {"filters": 32, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_16", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "name": "conv2d_16", "class_name": "Conv2D"}, {"config": {"output_padding": null, "filters": 16, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_transpose_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [2, 2], "use_bias": true, "activation": "linear", "kernel_regularizer": null, "kernel_size": [2, 2], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "conv2d_transpose_4", "class_name": "Conv2DTranspose"}, {"config": {"axis": 3, "trainable": true, "name": "concatenate_4"}, "inbound_nodes": [[["conv2d_transpose_4", 0, 0, {}], ["conv2d_2", 0, 0, {}]]], "name": "concatenate_4", "class_name": "Concatenate"}, {"config": {"filters": 16, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_17", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "name": "conv2d_17", "class_name": "Conv2D"}, {"config": {"rate": 0.1, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_9"}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "dropout_9", "class_name": "Dropout"}, {"config": {"filters": 16, "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_18", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "elu", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "name": "conv2d_18", "class_name": "Conv2D"}, {"config": {"filters": 1, "padding": "valid", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_19", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activation": "sigmoid", "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "conv2d_19", "class_name": "Conv2D"}], "output_layers": [["conv2d_19", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Model"}