{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "dtype": "float32", "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAEAAABTAAAAcwQAAAB8AABTKQFOqQApAdoBeHIBAAAAcgEAAAD6Wi9ob21l\nL2FqdXNrYS9Eb2t1bWVudHkvU2tvbGEvdW5ldF9pbXBsZW1lbnRhdGlvbi92ZXNzZWxfc2VnbWVu\ndGF0aW9uL3VuZXRfcHJvamVjdC91X25ldC5wedoIPGxhbWJkYT4UAAAA8wAAAAA=\n", null, null], "output_shape": null, "output_shape_type": "raw", "name": "lambda_1", "trainable": true, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_1", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 16}, "name": "conv2d_1", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "seed": null, "noise_shape": null, "name": "dropout_1"}, "name": "dropout_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_2", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 16}, "name": "conv2d_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2]}, "name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_3", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 32}, "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "seed": null, "noise_shape": null, "name": "dropout_2"}, "name": "dropout_2", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_4", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 32}, "name": "conv2d_4", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2]}, "name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_5", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 64}, "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "noise_shape": null, "name": "dropout_3"}, "name": "dropout_3", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_6", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 64}, "name": "conv2d_6", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2]}, "name": "max_pooling2d_3", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_7", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 128}, "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "noise_shape": null, "name": "dropout_4"}, "name": "dropout_4", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_8", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 128}, "name": "conv2d_8", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_4", "strides": [2, 2]}, "name": "max_pooling2d_4", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_9", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 256}, "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "seed": null, "noise_shape": null, "name": "dropout_5"}, "name": "dropout_5", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_10", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 256}, "name": "conv2d_10", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_transpose_1", "output_padding": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "strides": [2, 2], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [2, 2], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 128}, "name": "conv2d_transpose_1", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "concatenate_1"}, "name": "concatenate_1", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}], ["conv2d_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_11", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 128}, "name": "conv2d_11", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "noise_shape": null, "name": "dropout_6"}, "name": "dropout_6", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_12", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 128}, "name": "conv2d_12", "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_transpose_2", "output_padding": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "strides": [2, 2], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [2, 2], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 64}, "name": "conv2d_transpose_2", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "concatenate_2"}, "name": "concatenate_2", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}], ["conv2d_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_13", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 64}, "name": "conv2d_13", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "noise_shape": null, "name": "dropout_7"}, "name": "dropout_7", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_14", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 64}, "name": "conv2d_14", "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_transpose_3", "output_padding": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "strides": [2, 2], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [2, 2], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 32}, "name": "conv2d_transpose_3", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "concatenate_3"}, "name": "concatenate_3", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}], ["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_15", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 32}, "name": "conv2d_15", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "seed": null, "noise_shape": null, "name": "dropout_8"}, "name": "dropout_8", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_16", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 32}, "name": "conv2d_16", "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_transpose_4", "output_padding": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "strides": [2, 2], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [2, 2], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 16}, "name": "conv2d_transpose_4", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "trainable": true, "name": "concatenate_4"}, "name": "concatenate_4", "inbound_nodes": [[["conv2d_transpose_4", 0, 0, {}], ["conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_17", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 16}, "name": "conv2d_17", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "seed": null, "noise_shape": null, "name": "dropout_9"}, "name": "dropout_9", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_18", "data_format": "channels_last", "activation": "elu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 16}, "name": "conv2d_18", "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_19", "data_format": "channels_last", "activation": "sigmoid", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "filters": 1}, "name": "conv2d_19", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["conv2d_19", 0, 0]]}, "backend": "tensorflow"}